NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/*

Copyright (c) 2010 - 2026, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef __NRF9120_BITS_H
#define __NRF9120_BITS_H

/*lint ++flb "Enter library region" */

/* Peripheral: APPROTECT */
/* Description: Access Port Protection 0 */

/* Register: APPROTECT_SECUREAPPROTECT_DISABLE */
/* Description: Software disable SECUREAPPROTECT mechanism */

/* Bits 7..0 : Software disable SECUREAPPROTECT mechanism */
#define APPROTECT_SECUREAPPROTECT_DISABLE_DISABLE_Pos (0UL) /*!< Position of DISABLE field. */
#define APPROTECT_SECUREAPPROTECT_DISABLE_DISABLE_Msk (0xFFUL << APPROTECT_SECUREAPPROTECT_DISABLE_DISABLE_Pos) /*!< Bit mask of DISABLE field. */
#define APPROTECT_SECUREAPPROTECT_DISABLE_DISABLE_SwUnprotected (0x5AUL) /*!< Software disable SECUREAPPROTECT mechanism */

/* Register: APPROTECT_SECUREAPPROTECT_FORCEPROTECT */
/* Description: Software force SECUREAPPROTECT mechanism */

/* Bit 9 : Write 0x1 to force enable SECUREAPPROTECT mechanism */
#define APPROTECT_SECUREAPPROTECT_FORCEPROTECT_FORCEPROTECT_Pos (9UL) /*!< Position of FORCEPROTECT field. */
#define APPROTECT_SECUREAPPROTECT_FORCEPROTECT_FORCEPROTECT_Msk (0x1UL << APPROTECT_SECUREAPPROTECT_FORCEPROTECT_FORCEPROTECT_Pos) /*!< Bit mask of FORCEPROTECT field. */
#define APPROTECT_SECUREAPPROTECT_FORCEPROTECT_FORCEPROTECT_Force (0x1UL) /*!< Software force enable SECUREAPPROTECT mechanism */

/* Register: APPROTECT_APPROTECT_DISABLE */
/* Description: Software disable APPROTECT mechanism */

/* Bits 7..0 : Software disable APPROTECT mechanism */
#define APPROTECT_APPROTECT_DISABLE_DISABLE_Pos (0UL) /*!< Position of DISABLE field. */
#define APPROTECT_APPROTECT_DISABLE_DISABLE_Msk (0xFFUL << APPROTECT_APPROTECT_DISABLE_DISABLE_Pos) /*!< Bit mask of DISABLE field. */
#define APPROTECT_APPROTECT_DISABLE_DISABLE_SwUnprotected (0x5AUL) /*!< Software disable APPROTECT mechanism */

/* Register: APPROTECT_APPROTECT_FORCEPROTECT */
/* Description: Software force APPROTECT mechanism */

/* Bit 9 : Write 0x1 to force enable APPROTECT mechanism */
#define APPROTECT_APPROTECT_FORCEPROTECT_FORCEPROTECT_Pos (9UL) /*!< Position of FORCEPROTECT field. */
#define APPROTECT_APPROTECT_FORCEPROTECT_FORCEPROTECT_Msk (0x1UL << APPROTECT_APPROTECT_FORCEPROTECT_FORCEPROTECT_Pos) /*!< Bit mask of FORCEPROTECT field. */
#define APPROTECT_APPROTECT_FORCEPROTECT_FORCEPROTECT_Force (0x1UL) /*!< Software force enable APPROTECT mechanism */


/* Peripheral: ATBFUNNEL */
/* Description: ATB funnel module 0 */

/* Register: ATBFUNNEL_CTRLREG */
/* Description: The IDFILTER0 register enables the programming of ID filtering for master port 0. */

/* Bits 11..8 : Hold Time. The formatting scheme can become inefficient when fast switching occurs, and you can use this setting to minimize switching. 
          When a source has nothing to transmit, then another source is selected irrespective of the minimum number of transactions. 
          The ATB funnel holds for the minimum hold time and one additional transaction. The actual hold time is the register value plus 1. 
          The maximum value that can be entered is 0b1110 and this equates to 15 transactions. 0b1111 is reserved. */
#define ATBFUNNEL_CTRLREG_HT_Pos (8UL) /*!< Position of HT field. */
#define ATBFUNNEL_CTRLREG_HT_Msk (0xFUL << ATBFUNNEL_CTRLREG_HT_Pos) /*!< Bit mask of HT field. */

/* Bit 7 : Enable slave port 7. */
#define ATBFUNNEL_CTRLREG_ENS_7_Pos (7UL) /*!< Position of ENS_7 field. */
#define ATBFUNNEL_CTRLREG_ENS_7_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS_7_Pos) /*!< Bit mask of ENS_7 field. */
#define ATBFUNNEL_CTRLREG_ENS_7_Disabled (0x0UL) /*!< Slave port disabled. This excludes the port from the priority selection scheme. */
#define ATBFUNNEL_CTRLREG_ENS_7_Enabled (0x1UL) /*!< Slave port enabled. */

/* Bit 6 : Enable slave port 6. */
#define ATBFUNNEL_CTRLREG_ENS_6_Pos (6UL) /*!< Position of ENS_6 field. */
#define ATBFUNNEL_CTRLREG_ENS_6_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS_6_Pos) /*!< Bit mask of ENS_6 field. */
#define ATBFUNNEL_CTRLREG_ENS_6_Disabled (0x0UL) /*!< Slave port disabled. This excludes the port from the priority selection scheme. */
#define ATBFUNNEL_CTRLREG_ENS_6_Enabled (0x1UL) /*!< Slave port enabled. */

/* Bit 5 : Enable slave port 5. */
#define ATBFUNNEL_CTRLREG_ENS_5_Pos (5UL) /*!< Position of ENS_5 field. */
#define ATBFUNNEL_CTRLREG_ENS_5_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS_5_Pos) /*!< Bit mask of ENS_5 field. */
#define ATBFUNNEL_CTRLREG_ENS_5_Disabled (0x0UL) /*!< Slave port disabled. This excludes the port from the priority selection scheme. */
#define ATBFUNNEL_CTRLREG_ENS_5_Enabled (0x1UL) /*!< Slave port enabled. */

