NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 4 : Enable slave port 4. */
#define ATBFUNNEL_CTRLREG_ENS_4_Pos (4UL) /*!< Position of ENS_4 field. */
#define ATBFUNNEL_CTRLREG_ENS_4_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS_4_Pos) /*!< Bit mask of ENS_4 field. */
#define ATBFUNNEL_CTRLREG_ENS_4_Disabled (0x0UL) /*!< Slave port disabled. This excludes the port from the priority selection scheme. */
#define ATBFUNNEL_CTRLREG_ENS_4_Enabled (0x1UL) /*!< Slave port enabled. */

/* Bit 3 : Enable slave port 3. */
#define ATBFUNNEL_CTRLREG_ENS_3_Pos (3UL) /*!< Position of ENS_3 field. */
#define ATBFUNNEL_CTRLREG_ENS_3_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS_3_Pos) /*!< Bit mask of ENS_3 field. */
#define ATBFUNNEL_CTRLREG_ENS_3_Disabled (0x0UL) /*!< Slave port disabled. This excludes the port from the priority selection scheme. */
#define ATBFUNNEL_CTRLREG_ENS_3_Enabled (0x1UL) /*!< Slave port enabled. */

/* Bit 2 : Enable slave port 2. */
#define ATBFUNNEL_CTRLREG_ENS_2_Pos (2UL) /*!< Position of ENS_2 field. */
#define ATBFUNNEL_CTRLREG_ENS_2_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS_2_Pos) /*!< Bit mask of ENS_2 field. */
#define ATBFUNNEL_CTRLREG_ENS_2_Disabled (0x0UL) /*!< Slave port disabled. This excludes the port from the priority selection scheme. */
#define ATBFUNNEL_CTRLREG_ENS_2_Enabled (0x1UL) /*!< Slave port enabled. */

/* Bit 1 : Enable slave port 1. */
#define ATBFUNNEL_CTRLREG_ENS_1_Pos (1UL) /*!< Position of ENS_1 field. */
#define ATBFUNNEL_CTRLREG_ENS_1_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS_1_Pos) /*!< Bit mask of ENS_1 field. */
#define ATBFUNNEL_CTRLREG_ENS_1_Disabled (0x0UL) /*!< Slave port disabled. This excludes the port from the priority selection scheme. */
#define ATBFUNNEL_CTRLREG_ENS_1_Enabled (0x1UL) /*!< Slave port enabled. */

/* Bit 0 : Enable slave port 0. */
#define ATBFUNNEL_CTRLREG_ENS_0_Pos (0UL) /*!< Position of ENS_0 field. */
#define ATBFUNNEL_CTRLREG_ENS_0_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS_0_Pos) /*!< Bit mask of ENS_0 field. */
#define ATBFUNNEL_CTRLREG_ENS_0_Disabled (0x0UL) /*!< Slave port disabled. This excludes the port from the priority selection scheme. */
#define ATBFUNNEL_CTRLREG_ENS_0_Enabled (0x1UL) /*!< Slave port enabled. */

/* Register: ATBFUNNEL_PRIORITYCTRLREG */
/* Description: The Priority_Ctrl_Reg register defines the order in which inputs are selected. Each 3-bit field is a priority for each particular slave interface. */

/* Bits 23..21 : Priority value of port number 7. */
#define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT7_Pos (21UL) /*!< Position of PRIPORT7 field. */
#define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT7_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT7_Pos) /*!< Bit mask of PRIPORT7 field. */

/* Bits 20..18 : Priority value of port number 6. */
#define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT6_Pos (18UL) /*!< Position of PRIPORT6 field. */
#define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT6_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT6_Pos) /*!< Bit mask of PRIPORT6 field. */

/* Bits 17..15 : Priority value of port number 5. */
#define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT5_Pos (15UL) /*!< Position of PRIPORT5 field. */
#define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT5_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT5_Pos) /*!< Bit mask of PRIPORT5 field. */

/* Bits 14..12 : Priority value of port number 4. */
#define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT4_Pos (12UL) /*!< Position of PRIPORT4 field. */
#define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT4_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT4_Pos) /*!< Bit mask of PRIPORT4 field. */

/* Bits 11..9 : Priority value of port number 3. */
#define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT3_Pos (9UL) /*!< Position of PRIPORT3 field. */
#define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT3_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT3_Pos) /*!< Bit mask of PRIPORT3 field. */

/* Bits 8..6 : Priority value of port number 2. */
#define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT2_Pos (6UL) /*!< Position of PRIPORT2 field. */
#define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT2_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT2_Pos) /*!< Bit mask of PRIPORT2 field. */

/* Bits 5..3 : Priority value of port number 1. */
#define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT1_Pos (3UL) /*!< Position of PRIPORT1 field. */
#define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT1_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT1_Pos) /*!< Bit mask of PRIPORT1 field. */

/* Bits 2..0 : Priority value of port number 0. */
#define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT0_Pos (0UL) /*!< Position of PRIPORT0 field. */
#define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT0_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT0_Pos) /*!< Bit mask of PRIPORT0 field. */

/* Register: ATBFUNNEL_ITATBDATA0 */
/* Description: The ITATBDATA0 register performs different functions depending on whether the access is a read or a write. */

/* Bit 16 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_16_Pos (16UL) /*!< Position of ATDATA_16 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_16_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA_16_Pos) /*!< Bit mask of ATDATA_16 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_16_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_16_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 15 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_15_Pos (15UL) /*!< Position of ATDATA_15 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_15_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA_15_Pos) /*!< Bit mask of ATDATA_15 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_15_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_15_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 14 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_14_Pos (14UL) /*!< Position of ATDATA_14 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_14_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA_14_Pos) /*!< Bit mask of ATDATA_14 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_14_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_14_High (0x1UL) /*!< Pin is logic 1. */

