NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 13 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_13_Pos (13UL) /*!< Position of ATDATA_13 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_13_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA_13_Pos) /*!< Bit mask of ATDATA_13 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_13_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_13_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 12 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_12_Pos (12UL) /*!< Position of ATDATA_12 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_12_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA_12_Pos) /*!< Bit mask of ATDATA_12 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_12_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_12_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 11 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_11_Pos (11UL) /*!< Position of ATDATA_11 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_11_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA_11_Pos) /*!< Bit mask of ATDATA_11 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_11_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_11_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 10 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_10_Pos (10UL) /*!< Position of ATDATA_10 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_10_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA_10_Pos) /*!< Bit mask of ATDATA_10 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_10_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_10_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 9 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_9_Pos (9UL) /*!< Position of ATDATA_9 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_9_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA_9_Pos) /*!< Bit mask of ATDATA_9 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_9_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_9_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 8 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_8_Pos (8UL) /*!< Position of ATDATA_8 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_8_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA_8_Pos) /*!< Bit mask of ATDATA_8 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_8_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_8_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 7 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_7_Pos (7UL) /*!< Position of ATDATA_7 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_7_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA_7_Pos) /*!< Bit mask of ATDATA_7 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_7_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_7_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 6 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_6_Pos (6UL) /*!< Position of ATDATA_6 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_6_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA_6_Pos) /*!< Bit mask of ATDATA_6 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_6_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_6_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 5 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_5_Pos (5UL) /*!< Position of ATDATA_5 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_5_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA_5_Pos) /*!< Bit mask of ATDATA_5 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_5_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_5_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 4 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_4_Pos (4UL) /*!< Position of ATDATA_4 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_4_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA_4_Pos) /*!< Bit mask of ATDATA_4 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_4_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_4_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 3 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_3_Pos (3UL) /*!< Position of ATDATA_3 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_3_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA_3_Pos) /*!< Bit mask of ATDATA_3 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_3_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_3_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 2 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_2_Pos (2UL) /*!< Position of ATDATA_2 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_2_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA_2_Pos) /*!< Bit mask of ATDATA_2 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_2_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_2_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 1 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_1_Pos (1UL) /*!< Position of ATDATA_1 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_1_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA_1_Pos) /*!< Bit mask of ATDATA_1 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_1_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_1_High (0x1UL) /*!< Pin is logic 1. */

