NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 0 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_0_Pos (0UL) /*!< Position of ATDATA_0 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_0_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA_0_Pos) /*!< Bit mask of ATDATA_0 field. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_0_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBDATA0_ATDATA_0_High (0x1UL) /*!< Pin is logic 1. */

/* Register: ATBFUNNEL_ITATBCTR2 */
/* Description: The ITATBCTR2 register performs different functions depending on whether the access is a read or a write. */

/* Bit 1 : A read access returns the value of afvalidm.
        A write access outputs the data to atreadys[n], where the value of the CTRLREG at 0x000 defines n. */
#define ATBFUNNEL_ITATBCTR2_AFVALID_Pos (1UL) /*!< Position of AFVALID field. */
#define ATBFUNNEL_ITATBCTR2_AFVALID_Msk (0x1UL << ATBFUNNEL_ITATBCTR2_AFVALID_Pos) /*!< Bit mask of AFVALID field. */
#define ATBFUNNEL_ITATBCTR2_AFVALID_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBCTR2_AFVALID_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 0 : A read access returns the value of atreadym.
        A write access outputs the data to afvalids[n], where the value of the CTRLREG at 0x000 defines n. */
#define ATBFUNNEL_ITATBCTR2_ATREADY_Pos (0UL) /*!< Position of ATREADY field. */
#define ATBFUNNEL_ITATBCTR2_ATREADY_Msk (0x1UL << ATBFUNNEL_ITATBCTR2_ATREADY_Pos) /*!< Bit mask of ATREADY field. */
#define ATBFUNNEL_ITATBCTR2_ATREADY_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBCTR2_ATREADY_High (0x1UL) /*!< Pin is logic 1. */

/* Register: ATBFUNNEL_ITATBCTR1 */
/* Description: The ITATBCTR1 register performs different functions depending on whether the access is a read or a write. */

/* Bits 6..0 : A read returns the value of the atids[n] signals, where the value of the Control Register at 0x000 defines n.
A write outputs the value to the atidm port. */
#define ATBFUNNEL_ITATBCTR1_ATVALIDM0_Pos (0UL) /*!< Position of ATVALIDM0 field. */
#define ATBFUNNEL_ITATBCTR1_ATVALIDM0_Msk (0x7FUL << ATBFUNNEL_ITATBCTR1_ATVALIDM0_Pos) /*!< Bit mask of ATVALIDM0 field. */
#define ATBFUNNEL_ITATBCTR1_ATVALIDM0_Low (0x00UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBCTR1_ATVALIDM0_High (0x01UL) /*!< Pin is logic 1. */

/* Register: ATBFUNNEL_ITATBCTR0 */
/* Description: The ITATBCTR0 register performs different functions depending on whether the access is a read or a write. */

/* Bits 9..8 : A read returns the value of the atbytess[n] signal, where the value of the Ctrl_Reg at 0x000 defines n.
A write outputs the value to atbytesm. */
#define ATBFUNNEL_ITATBCTR0_ATBYTES_Pos (8UL) /*!< Position of ATBYTES field. */
#define ATBFUNNEL_ITATBCTR0_ATBYTES_Msk (0x3UL << ATBFUNNEL_ITATBCTR0_ATBYTES_Pos) /*!< Bit mask of ATBYTES field. */
#define ATBFUNNEL_ITATBCTR0_ATBYTES_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBCTR0_ATBYTES_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 2 : A read returns the value of the afreadys[n] signal, where the value of the Ctrl_Reg at 0x000 defines n.
A write outputs the value to afreadym. */
#define ATBFUNNEL_ITATBCTR0_AFREADY_Pos (2UL) /*!< Position of AFREADY field. */
#define ATBFUNNEL_ITATBCTR0_AFREADY_Msk (0x1UL << ATBFUNNEL_ITATBCTR0_AFREADY_Pos) /*!< Bit mask of AFREADY field. */
#define ATBFUNNEL_ITATBCTR0_AFREADY_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBCTR0_AFREADY_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 0 : A read returns the value of the atvalids[n] signal, where the value of the CTRLREG at 0x000 defines n.
A write outputs the value to atvalidm. */
#define ATBFUNNEL_ITATBCTR0_ATVALID_Pos (0UL) /*!< Position of ATVALID field. */
#define ATBFUNNEL_ITATBCTR0_ATVALID_Msk (0x1UL << ATBFUNNEL_ITATBCTR0_ATVALID_Pos) /*!< Bit mask of ATVALID field. */
#define ATBFUNNEL_ITATBCTR0_ATVALID_Low (0x0UL) /*!< Pin is logic 0. */
#define ATBFUNNEL_ITATBCTR0_ATVALID_High (0x1UL) /*!< Pin is logic 1. */

/* Register: ATBFUNNEL_ITCTRL */
/* Description: The ITCTRL register enables the component to switch from a functional mode, which is the default behavior, 
      to integration mode where the inputs and outputs of the component can be directly controlled for the purposes of integration testing and topology detection. */

/* Bit 0 : Integration Mode Enable. */
#define ATBFUNNEL_ITCTRL_IME_Pos (0UL) /*!< Position of IME field. */
#define ATBFUNNEL_ITCTRL_IME_Msk (0x1UL << ATBFUNNEL_ITCTRL_IME_Pos) /*!< Bit mask of IME field. */
#define ATBFUNNEL_ITCTRL_IME_Disabled (0x0UL) /*!< Integration mode disabled. */
#define ATBFUNNEL_ITCTRL_IME_Enabled (0x1UL) /*!< Integration mode enabled. */

/* Register: ATBFUNNEL_CLAIMSET */
/* Description: Software can use the claim tag to coordinate application and debugger access to trace unit functionality. 
      The claim tags have no effect on the operation of the component. The CLAIMSET register sets bits in the claim tag, and determines the number of claim bits implemented. */

/* Bit 3 : Set claim bit 3 and check if bit is implemented or not. */
#define ATBFUNNEL_CLAIMSET_BIT_3_Pos (3UL) /*!< Position of BIT_3 field. */
#define ATBFUNNEL_CLAIMSET_BIT_3_Msk (0x1UL << ATBFUNNEL_CLAIMSET_BIT_3_Pos) /*!< Bit mask of BIT_3 field. */
#define ATBFUNNEL_CLAIMSET_BIT_3_NotImplemented (0x0UL) /*!< Claim bit 3 is not implemented. */
#define ATBFUNNEL_CLAIMSET_BIT_3_Implemented (0x1UL) /*!< Claim bit 3 is implemented. */
#define ATBFUNNEL_CLAIMSET_BIT_3_Set (0x1UL) /*!< Set claim bit 3. */

/* Bit 2 : Set claim bit 2 and check if bit is implemented or not. */
#define ATBFUNNEL_CLAIMSET_BIT_2_Pos (2UL) /*!< Position of BIT_2 field. */
#define ATBFUNNEL_CLAIMSET_BIT_2_Msk (0x1UL << ATBFUNNEL_CLAIMSET_BIT_2_Pos) /*!< Bit mask of BIT_2 field. */
#define ATBFUNNEL_CLAIMSET_BIT_2_NotImplemented (0x0UL) /*!< Claim bit 2 is not implemented. */
#define ATBFUNNEL_CLAIMSET_BIT_2_Implemented (0x1UL) /*!< Claim bit 2 is implemented. */
#define ATBFUNNEL_CLAIMSET_BIT_2_Set (0x1UL) /*!< Set claim bit 2. */

/* Bit 1 : Set claim bit 1 and check if bit is implemented or not. */
#define ATBFUNNEL_CLAIMSET_BIT_1_Pos (1UL) /*!< Position of BIT_1 field. */
#define ATBFUNNEL_CLAIMSET_BIT_1_Msk (0x1UL << ATBFUNNEL_CLAIMSET_BIT_1_Pos) /*!< Bit mask of BIT_1 field. */
#define ATBFUNNEL_CLAIMSET_BIT_1_NotImplemented (0x0UL) /*!< Claim bit 1 is not implemented. */
#define ATBFUNNEL_CLAIMSET_BIT_1_Implemented (0x1UL) /*!< Claim bit 1 is implemented. */
#define ATBFUNNEL_CLAIMSET_BIT_1_Set (0x1UL) /*!< Set claim bit 1. */

