NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Register: ATBREPLICATOR_CLAIMSET */
/* Description: Software can use the claim tag to coordinate application and debugger access to trace unit functionality. 
      The claim tags have no effect on the operation of the component. The CLAIMSET register sets bits in the claim tag, and determines the number of claim bits implemented. */

/* Bit 3 : Set claim bit 3 and check if bit is implemented or not. */
#define ATBREPLICATOR_CLAIMSET_BIT_3_Pos (3UL) /*!< Position of BIT_3 field. */
#define ATBREPLICATOR_CLAIMSET_BIT_3_Msk (0x1UL << ATBREPLICATOR_CLAIMSET_BIT_3_Pos) /*!< Bit mask of BIT_3 field. */
#define ATBREPLICATOR_CLAIMSET_BIT_3_NotImplemented (0x0UL) /*!< Claim bit 3 is not implemented. */
#define ATBREPLICATOR_CLAIMSET_BIT_3_Implemented (0x1UL) /*!< Claim bit 3 is implemented. */
#define ATBREPLICATOR_CLAIMSET_BIT_3_Set (0x1UL) /*!< Set claim bit 3. */

/* Bit 2 : Set claim bit 2 and check if bit is implemented or not. */
#define ATBREPLICATOR_CLAIMSET_BIT_2_Pos (2UL) /*!< Position of BIT_2 field. */
#define ATBREPLICATOR_CLAIMSET_BIT_2_Msk (0x1UL << ATBREPLICATOR_CLAIMSET_BIT_2_Pos) /*!< Bit mask of BIT_2 field. */
#define ATBREPLICATOR_CLAIMSET_BIT_2_NotImplemented (0x0UL) /*!< Claim bit 2 is not implemented. */
#define ATBREPLICATOR_CLAIMSET_BIT_2_Implemented (0x1UL) /*!< Claim bit 2 is implemented. */
#define ATBREPLICATOR_CLAIMSET_BIT_2_Set (0x1UL) /*!< Set claim bit 2. */

/* Bit 1 : Set claim bit 1 and check if bit is implemented or not. */
#define ATBREPLICATOR_CLAIMSET_BIT_1_Pos (1UL) /*!< Position of BIT_1 field. */
#define ATBREPLICATOR_CLAIMSET_BIT_1_Msk (0x1UL << ATBREPLICATOR_CLAIMSET_BIT_1_Pos) /*!< Bit mask of BIT_1 field. */
#define ATBREPLICATOR_CLAIMSET_BIT_1_NotImplemented (0x0UL) /*!< Claim bit 1 is not implemented. */
#define ATBREPLICATOR_CLAIMSET_BIT_1_Implemented (0x1UL) /*!< Claim bit 1 is implemented. */
#define ATBREPLICATOR_CLAIMSET_BIT_1_Set (0x1UL) /*!< Set claim bit 1. */

/* Bit 0 : Set claim bit 0 and check if bit is implemented or not. */
#define ATBREPLICATOR_CLAIMSET_BIT_0_Pos (0UL) /*!< Position of BIT_0 field. */
#define ATBREPLICATOR_CLAIMSET_BIT_0_Msk (0x1UL << ATBREPLICATOR_CLAIMSET_BIT_0_Pos) /*!< Bit mask of BIT_0 field. */
#define ATBREPLICATOR_CLAIMSET_BIT_0_NotImplemented (0x0UL) /*!< Claim bit 0 is not implemented. */
#define ATBREPLICATOR_CLAIMSET_BIT_0_Implemented (0x1UL) /*!< Claim bit 0 is implemented. */
#define ATBREPLICATOR_CLAIMSET_BIT_0_Set (0x1UL) /*!< Set claim bit 0. */

/* Register: ATBREPLICATOR_CLAIMCLR */
/* Description: Software can use the claim tag to coordinate application and debugger access to trace unit functionality. 
      The claim tags have no effect on the operation of the component. 
      The CLAIMCLR register sets the bits in the claim tag to 0 and determines the current value of the claim tag. */

/* Bit 3 : Read or clear claim bit 3. */
#define ATBREPLICATOR_CLAIMCLR_BIT_3_Pos (3UL) /*!< Position of BIT_3 field. */
#define ATBREPLICATOR_CLAIMCLR_BIT_3_Msk (0x1UL << ATBREPLICATOR_CLAIMCLR_BIT_3_Pos) /*!< Bit mask of BIT_3 field. */
#define ATBREPLICATOR_CLAIMCLR_BIT_3_Cleared (0x0UL) /*!< Claim bit 3 is not set. */
#define ATBREPLICATOR_CLAIMCLR_BIT_3_Set (0x1UL) /*!< Claim bit 3 is set. */
#define ATBREPLICATOR_CLAIMCLR_BIT_3_Clear (0x1UL) /*!< Clear claim bit 3. */

/* Bit 2 : Read or clear claim bit 2. */
#define ATBREPLICATOR_CLAIMCLR_BIT_2_Pos (2UL) /*!< Position of BIT_2 field. */
#define ATBREPLICATOR_CLAIMCLR_BIT_2_Msk (0x1UL << ATBREPLICATOR_CLAIMCLR_BIT_2_Pos) /*!< Bit mask of BIT_2 field. */
#define ATBREPLICATOR_CLAIMCLR_BIT_2_Cleared (0x0UL) /*!< Claim bit 2 is not set. */
#define ATBREPLICATOR_CLAIMCLR_BIT_2_Set (0x1UL) /*!< Claim bit 2 is set. */
#define ATBREPLICATOR_CLAIMCLR_BIT_2_Clear (0x1UL) /*!< Clear claim bit 2. */

/* Bit 1 : Read or clear claim bit 1. */
#define ATBREPLICATOR_CLAIMCLR_BIT_1_Pos (1UL) /*!< Position of BIT_1 field. */
#define ATBREPLICATOR_CLAIMCLR_BIT_1_Msk (0x1UL << ATBREPLICATOR_CLAIMCLR_BIT_1_Pos) /*!< Bit mask of BIT_1 field. */
#define ATBREPLICATOR_CLAIMCLR_BIT_1_Cleared (0x0UL) /*!< Claim bit 1 is not set. */
#define ATBREPLICATOR_CLAIMCLR_BIT_1_Set (0x1UL) /*!< Claim bit 1 is set. */
#define ATBREPLICATOR_CLAIMCLR_BIT_1_Clear (0x1UL) /*!< Clear claim bit 1. */

/* Bit 0 : Read or clear claim bit 0. */
#define ATBREPLICATOR_CLAIMCLR_BIT_0_Pos (0UL) /*!< Position of BIT_0 field. */
#define ATBREPLICATOR_CLAIMCLR_BIT_0_Msk (0x1UL << ATBREPLICATOR_CLAIMCLR_BIT_0_Pos) /*!< Bit mask of BIT_0 field. */
#define ATBREPLICATOR_CLAIMCLR_BIT_0_Cleared (0x0UL) /*!< Claim bit 0 is not set. */
#define ATBREPLICATOR_CLAIMCLR_BIT_0_Set (0x1UL) /*!< Claim bit 0 is set. */
#define ATBREPLICATOR_CLAIMCLR_BIT_0_Clear (0x1UL) /*!< Clear claim bit 0. */

/* Register: ATBREPLICATOR_LAR */
/* Description: This is used to enable write access to device registers. */

/* Bits 31..0 : A write of 0xC5ACCE55 enables further write access to this device. Any other write removes write access. */
#define ATBREPLICATOR_LAR_ACCESS_Pos (0UL) /*!< Position of ACCESS field. */
#define ATBREPLICATOR_LAR_ACCESS_Msk (0xFFFFFFFFUL << ATBREPLICATOR_LAR_ACCESS_Pos) /*!< Bit mask of ACCESS field. */
#define ATBREPLICATOR_LAR_ACCESS_UnLock (0xC5ACCE55UL) /*!< Unlock register interface. */

/* Register: ATBREPLICATOR_LSR */
/* Description: This indicates the status of the lock control mechanism. This lock prevents accidental writes by code under debug. 
      Accesses to the extended stimulus port registers are not affected by the lock mechanism. 
      This register must always be present although there might not be any lock access control mechanism. 
      The lock mechanism, where present and locked, must block write accesses to any control register, except the Lock Access Register. 
      For most components this covers all registers except for the Lock Access Register. */

/* Bit 2 : Indicates if the Lock Access Register is implemented as 8-bit or 32-bit. */
#define ATBREPLICATOR_LSR_TYPE_Pos (2UL) /*!< Position of TYPE field. */
#define ATBREPLICATOR_LSR_TYPE_Msk (0x1UL << ATBREPLICATOR_LSR_TYPE_Pos) /*!< Bit mask of TYPE field. */
#define ATBREPLICATOR_LSR_TYPE_Bits32 (0x0UL) /*!< This component implements a 32-bit Lock Access Register. */
#define ATBREPLICATOR_LSR_TYPE_Bits8 (0x1UL) /*!< This component implements an 8-bit Lock Access Register. */

/* Bit 1 : Returns the current status of the Lock. */
#define ATBREPLICATOR_LSR_LOCKED_Pos (1UL) /*!< Position of LOCKED field. */
#define ATBREPLICATOR_LSR_LOCKED_Msk (0x1UL << ATBREPLICATOR_LSR_LOCKED_Pos) /*!< Bit mask of LOCKED field. */
#define ATBREPLICATOR_LSR_LOCKED_UnLocked (0x0UL) /*!< Write access is allowed to this device. */
#define ATBREPLICATOR_LSR_LOCKED_Locked (0x1UL) /*!< Write access to the component is blocked. All writes to control registers are ignored. Reads are permitted. */

/* Bit 0 : Indicates that a lock control mechanism exists for this device. */
#define ATBREPLICATOR_LSR_PRESENT_Pos (0UL) /*!< Position of PRESENT field. */
#define ATBREPLICATOR_LSR_PRESENT_Msk (0x1UL << ATBREPLICATOR_LSR_PRESENT_Pos) /*!< Bit mask of PRESENT field. */
#define ATBREPLICATOR_LSR_PRESENT_NotImplemented (0x0UL) /*!< No lock control mechanism exists, writes to the Lock Access Register are ignored. */
#define ATBREPLICATOR_LSR_PRESENT_Implemented (0x1UL) /*!< Lock control mechanism is present. */

/* Register: ATBREPLICATOR_AUTHSTATUS */
/* Description: Indicates the current level of tracing permitted by the system */

