NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bits 7..6 : Secure Non-Invasive Debug */
#define ATBREPLICATOR_AUTHSTATUS_SNID_Pos (6UL) /*!< Position of SNID field. */
#define ATBREPLICATOR_AUTHSTATUS_SNID_Msk (0x3UL << ATBREPLICATOR_AUTHSTATUS_SNID_Pos) /*!< Bit mask of SNID field. */
#define ATBREPLICATOR_AUTHSTATUS_SNID_NotImplemented (0x0UL) /*!< The feature is not implemented. */
#define ATBREPLICATOR_AUTHSTATUS_SNID_Implemented (0x1UL) /*!< The feature is implemented. */

/* Bits 5..4 : Secure Invasive Debug */
#define ATBREPLICATOR_AUTHSTATUS_SID_Pos (4UL) /*!< Position of SID field. */
#define ATBREPLICATOR_AUTHSTATUS_SID_Msk (0x3UL << ATBREPLICATOR_AUTHSTATUS_SID_Pos) /*!< Bit mask of SID field. */
#define ATBREPLICATOR_AUTHSTATUS_SID_NotImplemented (0x0UL) /*!< The feature is not implemented. */
#define ATBREPLICATOR_AUTHSTATUS_SID_Implemented (0x1UL) /*!< The feature is implemented. */

/* Bits 3..2 : Non-secure Non-Invasive Debug */
#define ATBREPLICATOR_AUTHSTATUS_NSNID_Pos (2UL) /*!< Position of NSNID field. */
#define ATBREPLICATOR_AUTHSTATUS_NSNID_Msk (0x3UL << ATBREPLICATOR_AUTHSTATUS_NSNID_Pos) /*!< Bit mask of NSNID field. */
#define ATBREPLICATOR_AUTHSTATUS_NSNID_NotImplemented (0x0UL) /*!< The feature is not implemented. */
#define ATBREPLICATOR_AUTHSTATUS_NSNID_Implemented (0x1UL) /*!< The feature is implemented. */

/* Bits 1..0 : Non-secure Invasive Debug */
#define ATBREPLICATOR_AUTHSTATUS_NSID_Pos (0UL) /*!< Position of NSID field. */
#define ATBREPLICATOR_AUTHSTATUS_NSID_Msk (0x3UL << ATBREPLICATOR_AUTHSTATUS_NSID_Pos) /*!< Bit mask of NSID field. */
#define ATBREPLICATOR_AUTHSTATUS_NSID_NotImplemented (0x0UL) /*!< The feature is not implemented. */
#define ATBREPLICATOR_AUTHSTATUS_NSID_Implemented (0x1UL) /*!< The feature is implemented. */

/* Register: ATBREPLICATOR_DEVID */
/* Description: Indicates the capabilities of the component. */

/* Bits 3..0 : Indicates the number of master ports implemented. */
#define ATBREPLICATOR_DEVID_PORTNUM_Pos (0UL) /*!< Position of PORTNUM field. */
#define ATBREPLICATOR_DEVID_PORTNUM_Msk (0xFUL << ATBREPLICATOR_DEVID_PORTNUM_Pos) /*!< Bit mask of PORTNUM field. */

/* Register: ATBREPLICATOR_DEVTYPE */
/* Description: The DEVTYPE register provides a debugger with information about the component when the Part Number field is not recognized. The debugger can then report this information. */

/* Bits 7..4 : The sub-type of the component */
#define ATBREPLICATOR_DEVTYPE_SUB_Pos (4UL) /*!< Position of SUB field. */
#define ATBREPLICATOR_DEVTYPE_SUB_Msk (0xFUL << ATBREPLICATOR_DEVTYPE_SUB_Pos) /*!< Bit mask of SUB field. */
#define ATBREPLICATOR_DEVTYPE_SUB_Replicator (0x2UL) /*!< Indicates that this component replicates trace from a single source to multiple targets. */

/* Bits 3..0 : The main type of the component */
#define ATBREPLICATOR_DEVTYPE_MAJOR_Pos (0UL) /*!< Position of MAJOR field. */
#define ATBREPLICATOR_DEVTYPE_MAJOR_Msk (0xFUL << ATBREPLICATOR_DEVTYPE_MAJOR_Pos) /*!< Bit mask of MAJOR field. */
#define ATBREPLICATOR_DEVTYPE_MAJOR_InputOutputDevice (0x2UL) /*!< Indicates that this component has ATB inputs and outputs. */


/* Peripheral: CC_AES */
/* Description: CRYPTOCELL AES engine */

/* Register: CC_AES_AES_KEY_0 */
/* Description: Description collection: AES key value to use.
        The initial AES_KEY_0[0] register holds the least significant bits [31:0] of the key value. */

/* Bits 31..0 : AES key value. */
#define CC_AES_AES_KEY_0_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define CC_AES_AES_KEY_0_VALUE_Msk (0xFFFFFFFFUL << CC_AES_AES_KEY_0_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: CC_AES_AES_IV_0 */
/* Description: Description collection: AES Initialization Vector (IV) to use.
        The initial AES_IV_0[0] register holds the least significant bits [31:0] of the IV. */

/* Bits 31..0 : AES non-tunneling or first tunnel stage IV value. */
#define CC_AES_AES_IV_0_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define CC_AES_AES_IV_0_VALUE_Msk (0xFFFFFFFFUL << CC_AES_AES_IV_0_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: CC_AES_AES_CTR */
/* Description: Description collection: AES counter (CTR) to use.
        The initial AES_CTR[0] register holds the least significant bits [31:0] of the CTR. */

/* Bits 31..0 : AES CTR value. */
#define CC_AES_AES_CTR_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define CC_AES_AES_CTR_VALUE_Msk (0xFFFFFFFFUL << CC_AES_AES_CTR_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: CC_AES_AES_BUSY */
/* Description: Status register for AES engine activity. */

/* Bit 0 : AES engine status. */
#define CC_AES_AES_BUSY_STATUS_Pos (0UL) /*!< Position of STATUS field. */
#define CC_AES_AES_BUSY_STATUS_Msk (0x1UL << CC_AES_AES_BUSY_STATUS_Pos) /*!< Bit mask of STATUS field. */
#define CC_AES_AES_BUSY_STATUS_Idle (0x0UL) /*!< AES engine is idle */
#define CC_AES_AES_BUSY_STATUS_Busy (0x1UL) /*!< AES engine is busy */

/* Register: CC_AES_AES_SK */
/* Description: Writing to this address trigger sampling of the HW key to the AES_KEY_0 register */

/* Bit 0 : Sample HW key to AES_KEY_0 registers. */
#define CC_AES_AES_SK_AES_SK_Pos (0UL) /*!< Position of AES_SK field. */
#define CC_AES_AES_SK_AES_SK_Msk (0x1UL << CC_AES_AES_SK_AES_SK_Pos) /*!< Bit mask of AES_SK field. */

/* Register: CC_AES_AES_CMAC_INIT */
/* Description: Writing to this address triggers the AES engine to generate K1 and K2 for AES-CMAC operations. */

/* Bit 0 : Generate K1 and K2 for the AES-CMAC operations. */
#define CC_AES_AES_CMAC_INIT_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define CC_AES_AES_CMAC_INIT_ENABLE_Msk (0x1UL << CC_AES_AES_CMAC_INIT_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define CC_AES_AES_CMAC_INIT_ENABLE_Enable (0x1UL) /*!< Initialize AES-CMAC operations. */

/* Register: CC_AES_AES_REMAINING_BYTES */
/* Description: This register should be set with the amount of remaining bytes until the end of the current AES operation. */

/* Bits 31..0 : Remaining bytes util the end of the current AES operation. */
#define CC_AES_AES_REMAINING_BYTES_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define CC_AES_AES_REMAINING_BYTES_VALUE_Msk (0xFFFFFFFFUL << CC_AES_AES_REMAINING_BYTES_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: CC_AES_AES_CONTROL */
/* Description: Control the AES engine behavior. */

