NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bits 9..1 : The physical word address used for the virtual register. */
#define CC_PKA_MEMORY_MAP_ADDR_Pos (1UL) /*!< Position of ADDR field. */
#define CC_PKA_MEMORY_MAP_ADDR_Msk (0x1FFUL << CC_PKA_MEMORY_MAP_ADDR_Pos) /*!< Bit mask of ADDR field. */

/* Register: CC_PKA_OPCODE */
/* Description: Operation code to be executed by the PKA engine. Writing to this register triggers the PKA operation. */

/* Bits 31..27 : Operation code to be executed by the PKA engine */
#define CC_PKA_OPCODE_OPCODE_Pos (27UL) /*!< Position of OPCODE field. */
#define CC_PKA_OPCODE_OPCODE_Msk (0x1FUL << CC_PKA_OPCODE_OPCODE_Pos) /*!< Bit mask of OPCODE field. */
#define CC_PKA_OPCODE_OPCODE_Terminate (0x00UL) /*!< Terminate operation */
#define CC_PKA_OPCODE_OPCODE_AddInc (0x04UL) /*!< Add or Increment */
#define CC_PKA_OPCODE_OPCODE_SubDecNeg (0x05UL) /*!< Subtract, Decrement, or Negate */
#define CC_PKA_OPCODE_OPCODE_ModAddInc (0x06UL) /*!< Modular Add or Modular Increment */
#define CC_PKA_OPCODE_OPCODE_ModSubDecNeg (0x07UL) /*!< Modular Subtract, Modular Decrement, or Modular Negate */
#define CC_PKA_OPCODE_OPCODE_ANDTST0CLR0 (0x08UL) /*!< Perform AND, test, or clear */
#define CC_PKA_OPCODE_OPCODE_ORCOPYSET0 (0x09UL) /*!< Perform OR, copy, or set bits */
#define CC_PKA_OPCODE_OPCODE_XORFLP0INVCMP (0x0AUL) /*!< Perform XOR, flip bits, invert, or compare */
#define CC_PKA_OPCODE_OPCODE_SHR0 (0x0CUL) /*!< Shift right 0 operation */
#define CC_PKA_OPCODE_OPCODE_SHR1 (0x0DUL) /*!< Shift right 1 operation */
#define CC_PKA_OPCODE_OPCODE_SHL0 (0x0EUL) /*!< Shift left 0 operation */
#define CC_PKA_OPCODE_OPCODE_SHL1 (0x0FUL) /*!< Shift left 1 operation */
#define CC_PKA_OPCODE_OPCODE_MulLow (0x10UL) /*!< Multiply low operation */
#define CC_PKA_OPCODE_OPCODE_ModMul (0x11UL) /*!< Modular multiply operation */
#define CC_PKA_OPCODE_OPCODE_ModMulN (0x12UL) /*!< Modular multiply N operation */
#define CC_PKA_OPCODE_OPCODE_ModExp (0x13UL) /*!< Modular exponentiation operation */
#define CC_PKA_OPCODE_OPCODE_Division (0x14UL) /*!< Division operation */
#define CC_PKA_OPCODE_OPCODE_ModInv (0x15UL) /*!< Modular inversion operation */
#define CC_PKA_OPCODE_OPCODE_ModDiv (0x16UL) /*!< Modular division operation */
#define CC_PKA_OPCODE_OPCODE_MulHigh (0x17UL) /*!< Multiply high operation */
#define CC_PKA_OPCODE_OPCODE_ModMLAC (0x18UL) /*!< Modular multiplication acceleration */
#define CC_PKA_OPCODE_OPCODE_ModMLACNR (0x19UL) /*!< Modular multiplication acceleration where final reduction is omitted */
#define CC_PKA_OPCODE_OPCODE_Reduction (0x1BUL) /*!< Reduction operation */

/* Bits 26..24 : The length of the operands. This value serves as an PKA length register index. E.g.: if LEN field value is set to 0, PKA_L[0] holds the size of the operands. */
#define CC_PKA_OPCODE_LEN_Pos (24UL) /*!< Position of LEN field. */
#define CC_PKA_OPCODE_LEN_Msk (0x7UL << CC_PKA_OPCODE_LEN_Pos) /*!< Bit mask of LEN field. */

/* Bit 23 : This field controls the interpretation of REG_A. */
#define CC_PKA_OPCODE_CONST_A_Pos (23UL) /*!< Position of CONST_A field. */
#define CC_PKA_OPCODE_CONST_A_Msk (0x1UL << CC_PKA_OPCODE_CONST_A_Pos) /*!< Bit mask of CONST_A field. */
#define CC_PKA_OPCODE_CONST_A_Register (0x0UL) /*!< REG_A is intepreted as a register index. */
#define CC_PKA_OPCODE_CONST_A_Constant (0x1UL) /*!< REG_A is intepreted as a constant. */

/* Bits 22..18 : Operand A virtual register index. */
#define CC_PKA_OPCODE_REG_A_Pos (18UL) /*!< Position of REG_A field. */
#define CC_PKA_OPCODE_REG_A_Msk (0x1FUL << CC_PKA_OPCODE_REG_A_Pos) /*!< Bit mask of REG_A field. */

/* Bit 17 : This field controls the interpretation of REG_B. */
#define CC_PKA_OPCODE_CONST_B_Pos (17UL) /*!< Position of CONST_B field. */
#define CC_PKA_OPCODE_CONST_B_Msk (0x1UL << CC_PKA_OPCODE_CONST_B_Pos) /*!< Bit mask of CONST_B field. */
#define CC_PKA_OPCODE_CONST_B_Register (0x0UL) /*!< REG_B is intepreted as a register index. */
#define CC_PKA_OPCODE_CONST_B_Constant (0x1UL) /*!< REG_B is intepreted as a constant. */

/* Bits 16..12 : Operand B virtual register index. */
#define CC_PKA_OPCODE_REG_B_Pos (12UL) /*!< Position of REG_B field. */
#define CC_PKA_OPCODE_REG_B_Msk (0x1FUL << CC_PKA_OPCODE_REG_B_Pos) /*!< Bit mask of REG_B field. */

/* Bit 11 : This field controls the interpretation of REG_R. */
#define CC_PKA_OPCODE_DISCARD_R_Pos (11UL) /*!< Position of DISCARD_R field. */
#define CC_PKA_OPCODE_DISCARD_R_Msk (0x1UL << CC_PKA_OPCODE_DISCARD_R_Pos) /*!< Bit mask of DISCARD_R field. */
#define CC_PKA_OPCODE_DISCARD_R_Register (0x0UL) /*!< REG_R is intepreted as a register index. */
#define CC_PKA_OPCODE_DISCARD_R_Discard (0x1UL) /*!< Result is discarded. */

/* Bits 10..6 : Result register virtual register index. */
#define CC_PKA_OPCODE_REG_R_Pos (6UL) /*!< Position of REG_R field. */
#define CC_PKA_OPCODE_REG_R_Msk (0x1FUL << CC_PKA_OPCODE_REG_R_Pos) /*!< Bit mask of REG_R field. */

/* Bits 5..0 : Holds the operation tag or the operand C virtual register index. */
#define CC_PKA_OPCODE_TAG_Pos (0UL) /*!< Position of TAG field. */
#define CC_PKA_OPCODE_TAG_Msk (0x3FUL << CC_PKA_OPCODE_TAG_Pos) /*!< Bit mask of TAG field. */

/* Register: CC_PKA_N_NP_T0_T1_ADDR */
/* Description: This register defines the N, Np, T0, and T1 virtual register index. */

/* Bits 19..15 : Temporary register 1 virtual register index. Default is R31. */
#define CC_PKA_N_NP_T0_T1_ADDR_T1_VIRTUAL_ADDR_Pos (15UL) /*!< Position of T1_VIRTUAL_ADDR field. */
#define CC_PKA_N_NP_T0_T1_ADDR_T1_VIRTUAL_ADDR_Msk (0x1FUL << CC_PKA_N_NP_T0_T1_ADDR_T1_VIRTUAL_ADDR_Pos) /*!< Bit mask of T1_VIRTUAL_ADDR field. */

/* Bits 14..10 : Temporary register 0 virtual register index. Default is R30. */
#define CC_PKA_N_NP_T0_T1_ADDR_T0_VIRTUAL_ADDR_Pos (10UL) /*!< Position of T0_VIRTUAL_ADDR field. */
#define CC_PKA_N_NP_T0_T1_ADDR_T0_VIRTUAL_ADDR_Msk (0x1FUL << CC_PKA_N_NP_T0_T1_ADDR_T0_VIRTUAL_ADDR_Pos) /*!< Bit mask of T0_VIRTUAL_ADDR field. */

/* Bits 9..5 : Register Np virtual register index. Default is R1. */
#define CC_PKA_N_NP_T0_T1_ADDR_NP_VIRTUAL_ADDR_Pos (5UL) /*!< Position of NP_VIRTUAL_ADDR field. */
#define CC_PKA_N_NP_T0_T1_ADDR_NP_VIRTUAL_ADDR_Msk (0x1FUL << CC_PKA_N_NP_T0_T1_ADDR_NP_VIRTUAL_ADDR_Pos) /*!< Bit mask of NP_VIRTUAL_ADDR field. */

/* Bits 4..0 : Register N virtual register index. Default is R0. */
#define CC_PKA_N_NP_T0_T1_ADDR_N_VIRTUAL_ADDR_Pos (0UL) /*!< Position of N_VIRTUAL_ADDR field. */
#define CC_PKA_N_NP_T0_T1_ADDR_N_VIRTUAL_ADDR_Msk (0x1FUL << CC_PKA_N_NP_T0_T1_ADDR_N_VIRTUAL_ADDR_Pos) /*!< Bit mask of N_VIRTUAL_ADDR field. */

