NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 7 : Write '1' to disable interrupt for event TRIGGERED[7] */
#define EGU_INTENCLR_TRIGGERED7_Pos (7UL) /*!< Position of TRIGGERED7 field. */
#define EGU_INTENCLR_TRIGGERED7_Msk (0x1UL << EGU_INTENCLR_TRIGGERED7_Pos) /*!< Bit mask of TRIGGERED7 field. */
#define EGU_INTENCLR_TRIGGERED7_Disabled (0x0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED7_Enabled (0x1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED7_Clear (0x1UL) /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event TRIGGERED[6] */
#define EGU_INTENCLR_TRIGGERED6_Pos (6UL) /*!< Position of TRIGGERED6 field. */
#define EGU_INTENCLR_TRIGGERED6_Msk (0x1UL << EGU_INTENCLR_TRIGGERED6_Pos) /*!< Bit mask of TRIGGERED6 field. */
#define EGU_INTENCLR_TRIGGERED6_Disabled (0x0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED6_Enabled (0x1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED6_Clear (0x1UL) /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event TRIGGERED[5] */
#define EGU_INTENCLR_TRIGGERED5_Pos (5UL) /*!< Position of TRIGGERED5 field. */
#define EGU_INTENCLR_TRIGGERED5_Msk (0x1UL << EGU_INTENCLR_TRIGGERED5_Pos) /*!< Bit mask of TRIGGERED5 field. */
#define EGU_INTENCLR_TRIGGERED5_Disabled (0x0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED5_Enabled (0x1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED5_Clear (0x1UL) /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event TRIGGERED[4] */
#define EGU_INTENCLR_TRIGGERED4_Pos (4UL) /*!< Position of TRIGGERED4 field. */
#define EGU_INTENCLR_TRIGGERED4_Msk (0x1UL << EGU_INTENCLR_TRIGGERED4_Pos) /*!< Bit mask of TRIGGERED4 field. */
#define EGU_INTENCLR_TRIGGERED4_Disabled (0x0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED4_Enabled (0x1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED4_Clear (0x1UL) /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event TRIGGERED[3] */
#define EGU_INTENCLR_TRIGGERED3_Pos (3UL) /*!< Position of TRIGGERED3 field. */
#define EGU_INTENCLR_TRIGGERED3_Msk (0x1UL << EGU_INTENCLR_TRIGGERED3_Pos) /*!< Bit mask of TRIGGERED3 field. */
#define EGU_INTENCLR_TRIGGERED3_Disabled (0x0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED3_Enabled (0x1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED3_Clear (0x1UL) /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event TRIGGERED[2] */
#define EGU_INTENCLR_TRIGGERED2_Pos (2UL) /*!< Position of TRIGGERED2 field. */
#define EGU_INTENCLR_TRIGGERED2_Msk (0x1UL << EGU_INTENCLR_TRIGGERED2_Pos) /*!< Bit mask of TRIGGERED2 field. */
#define EGU_INTENCLR_TRIGGERED2_Disabled (0x0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED2_Enabled (0x1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED2_Clear (0x1UL) /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event TRIGGERED[1] */
#define EGU_INTENCLR_TRIGGERED1_Pos (1UL) /*!< Position of TRIGGERED1 field. */
#define EGU_INTENCLR_TRIGGERED1_Msk (0x1UL << EGU_INTENCLR_TRIGGERED1_Pos) /*!< Bit mask of TRIGGERED1 field. */
#define EGU_INTENCLR_TRIGGERED1_Disabled (0x0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED1_Enabled (0x1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED1_Clear (0x1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event TRIGGERED[0] */
#define EGU_INTENCLR_TRIGGERED0_Pos (0UL) /*!< Position of TRIGGERED0 field. */
#define EGU_INTENCLR_TRIGGERED0_Msk (0x1UL << EGU_INTENCLR_TRIGGERED0_Pos) /*!< Bit mask of TRIGGERED0 field. */
#define EGU_INTENCLR_TRIGGERED0_Disabled (0x0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED0_Enabled (0x1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED0_Clear (0x1UL) /*!< Disable */


/* Peripheral: ETB */
/* Description: Embedded Trace Buffer */

/* Register: ETB_RDP */
/* Description: ETB RAM Depth Register */

/* Bits 31..0 : Defines the depth, in words, of the trace RAM. */
#define ETB_RDP_ETB_RAM_DEPTH_Pos (0UL) /*!< Position of ETB_RAM_DEPTH field. */
#define ETB_RDP_ETB_RAM_DEPTH_Msk (0xFFFFFFFFUL << ETB_RDP_ETB_RAM_DEPTH_Pos) /*!< Bit mask of ETB_RAM_DEPTH field. */

/* Register: ETB_STS */
/* Description: ETB Status Register */

/* Bit 3 : Formatter pipeline empty. All data stored to RAM. */
#define ETB_STS_FTEMPTY_Pos (3UL) /*!< Position of FTEMPTY field. */
#define ETB_STS_FTEMPTY_Msk (0x1UL << ETB_STS_FTEMPTY_Pos) /*!< Bit mask of FTEMPTY field. */

/* Bit 2 : The acquisition complete flag indicates that capture has been completed when the formatter stops because of any of the methods defined in the Formatter and Flush Control Register, or TraceCaptEn = 0. This also results in FtStopped in the Formatter and Flush Status Register going HIGH. */
#define ETB_STS_ACQCOMP_Pos (2UL) /*!< Position of ACQCOMP field. */
#define ETB_STS_ACQCOMP_Msk (0x1UL << ETB_STS_ACQCOMP_Pos) /*!< Bit mask of ACQCOMP field. */

/* Bit 1 : The Triggered bit is set when a trigger has been observed. This does not indicate that a trigger has been embedded in the trace data by the formatter, but is determined by the programming of the Formatter and Flush Control Register. */
#define ETB_STS_TRIGGERED_Pos (1UL) /*!< Position of TRIGGERED field. */
#define ETB_STS_TRIGGERED_Msk (0x1UL << ETB_STS_TRIGGERED_Pos) /*!< Bit mask of TRIGGERED field. */

/* Bit 0 : RAM Full. The flag indicates when the RAM write pointer has wrapped around. */
#define ETB_STS_FULL_Pos (0UL) /*!< Position of FULL field. */
#define ETB_STS_FULL_Msk (0x1UL << ETB_STS_FULL_Pos) /*!< Bit mask of FULL field. */

/* Register: ETB_RRD */
/* Description: ETB RAM Read Data Register */

/* Bits 31..0 : Data read from the ETB Trace RAM. */
#define ETB_RRD_RAM_READ_DATA_Pos (0UL) /*!< Position of RAM_READ_DATA field. */
#define ETB_RRD_RAM_READ_DATA_Msk (0xFFFFFFFFUL << ETB_RRD_RAM_READ_DATA_Pos) /*!< Bit mask of RAM_READ_DATA field. */

/* Register: ETB_RRP */
/* Description: ETB RAM Read Pointer Register */

/* Bits 9..0 : Sets the read pointer used to read entries from the Trace RAM over the APB interface. */
#define ETB_RRP_RAM_READ_POINTER_Pos (0UL) /*!< Position of RAM_READ_POINTER field. */
#define ETB_RRP_RAM_READ_POINTER_Msk (0x3FFUL << ETB_RRP_RAM_READ_POINTER_Pos) /*!< Bit mask of RAM_READ_POINTER field. */

