NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Register: ETB_RWP */
/* Description: ETB RAM Write Pointer Register */

/* Bits 9..0 : Sets the write pointer used to write entries from the CoreSight bus into the Trace RAM. */
#define ETB_RWP_RAM_WRITE_POINTER_Pos (0UL) /*!< Position of RAM_WRITE_POINTER field. */
#define ETB_RWP_RAM_WRITE_POINTER_Msk (0x3FFUL << ETB_RWP_RAM_WRITE_POINTER_Pos) /*!< Bit mask of RAM_WRITE_POINTER field. */

/* Register: ETB_TRG */
/* Description: ETB Trigger Counter Register */

/* Bits 9..0 : The counter is used as follows:Trace after - The counter is set to a large value, slightly less than the number of entries in the RAM. Trace before - The counter is set to a small value. Trace about - The counter is set to half the depth of the Trace RAM. This register must not be written to when trace capture is enabled (FtStopped=0, TraceCaptEn=1). If a write is attempted, the register is not updated. A read access is permitted with trace capture enabled. */
#define ETB_TRG_TRIGGER_COUNTER_Pos (0UL) /*!< Position of TRIGGER_COUNTER field. */
#define ETB_TRG_TRIGGER_COUNTER_Msk (0x3FFUL << ETB_TRG_TRIGGER_COUNTER_Pos) /*!< Bit mask of TRIGGER_COUNTER field. */

/* Register: ETB_CTL */
/* Description: ETB Control Register */

/* Bit 0 : ETB Trace Capture Enable. This is the master enable bit forcing FtStopped HIGH when TraceCaptEn is LOW. When capture is disabled, any remaining data in the ATB formatter is stored to RAM. When all data is stored the formatter outputs FtStopped. Capture is fully disabled, or complete, when FtStopped goes HIGH. See ETB Formatter and Flush Status Register, FFSR, 0x300. */
#define ETB_CTL_TRACECAPTEN_Pos (0UL) /*!< Position of TRACECAPTEN field. */
#define ETB_CTL_TRACECAPTEN_Msk (0x1UL << ETB_CTL_TRACECAPTEN_Pos) /*!< Bit mask of TRACECAPTEN field. */

/* Register: ETB_RWD */
/* Description: ETB RAM Write Data Register */

/* Bits 31..0 : Data written to the ETB Trace RAM. When trace capture is disabled, the contents of this register are placed into the ETB Trace RAM when this register is written to. Writing to this register increments the RAM Write Pointer Register. If trace capture is enabled, and this register is accessed, then a read from this register outputs 0xFFFFFFFF. Reads of this register never increment the RAM Write Pointer Register. A constant stream of 1s being output corresponds to a synchronization output from the ETB. If a write access is attempted, the data is not written into Trace RAM. */
#define ETB_RWD_RAM_WRITE_DATA_Pos (0UL) /*!< Position of RAM_WRITE_DATA field. */
#define ETB_RWD_RAM_WRITE_DATA_Msk (0xFFFFFFFFUL << ETB_RWD_RAM_WRITE_DATA_Pos) /*!< Bit mask of RAM_WRITE_DATA field. */

/* Register: ETB_FFSR */
/* Description: ETB Formatter and Flush Status Register */

/* Bit 1 : Formatter stopped. The formatter has received a stop request signal and all trace data and post-amble has been output. Any more trace data on the ATB interface is ignored and atreadys goes HIGH. */
#define ETB_FFSR_FTSTOPPED_Pos (1UL) /*!< Position of FTSTOPPED field. */
#define ETB_FFSR_FTSTOPPED_Msk (0x1UL << ETB_FFSR_FTSTOPPED_Pos) /*!< Bit mask of FTSTOPPED field. */

/* Bit 0 : Flush In Progress. This is an indication of the current state of afvalids. */
#define ETB_FFSR_FLINPROG_Pos (0UL) /*!< Position of FLINPROG field. */
#define ETB_FFSR_FLINPROG_Msk (0x1UL << ETB_FFSR_FLINPROG_Pos) /*!< Bit mask of FLINPROG field. */

/* Register: ETB_FFCR */
/* Description: ETB Formatter and Flush Control Register */

/* Bit 13 : Stop the formatter after a Trigger Event is observed. Reset to disabled (zero). */
#define ETB_FFCR_STOPTRIG_Pos (13UL) /*!< Position of STOPTRIG field. */
#define ETB_FFCR_STOPTRIG_Msk (0x1UL << ETB_FFCR_STOPTRIG_Pos) /*!< Bit mask of STOPTRIG field. */

/* Bit 12 : This forces the FIFO to drain off any part-completed packets. Setting this bit enables this function but this is clear on reset (disabled). */
#define ETB_FFCR_STOPFL_Pos (12UL) /*!< Position of STOPFL field. */
#define ETB_FFCR_STOPFL_Msk (0x1UL << ETB_FFCR_STOPFL_Pos) /*!< Bit mask of STOPFL field. */

/* Bit 10 : Indicates a trigger on Flush completion (afreadys being returned). */
#define ETB_FFCR_TRIGFL_Pos (10UL) /*!< Position of TRIGFL field. */
#define ETB_FFCR_TRIGFL_Msk (0x1UL << ETB_FFCR_TRIGFL_Pos) /*!< Bit mask of TRIGFL field. */

/* Bit 9 : Indicate a trigger on a Trigger Event. */
#define ETB_FFCR_TRIGEVT_Pos (9UL) /*!< Position of TRIGEVT field. */
#define ETB_FFCR_TRIGEVT_Msk (0x1UL << ETB_FFCR_TRIGEVT_Pos) /*!< Bit mask of TRIGEVT field. */

/* Bit 8 : Indicate a trigger on trigin being asserted. */
#define ETB_FFCR_TRIGIN_Pos (8UL) /*!< Position of TRIGIN field. */
#define ETB_FFCR_TRIGIN_Msk (0x1UL << ETB_FFCR_TRIGIN_Pos) /*!< Bit mask of TRIGIN field. */

/* Bit 6 : Setting this bit causes a flush to be generated. This is cleared when this flush has been serviced. This bit is clear on reset. */
#define ETB_FFCR_FONMAN_Pos (6UL) /*!< Position of FONMAN field. */
#define ETB_FFCR_FONMAN_Msk (0x1UL << ETB_FFCR_FONMAN_Pos) /*!< Bit mask of FONMAN field. */

/* Bit 5 : Generate flush using Trigger event. Set this bit to cause a flush of data in the system when a Trigger Event occurs. This bit is clear on reset. A Trigger Event is defined as when the Trigger counter reaches zero (where fitted) or, in the case of the trigger counter being zero (or not fitted), when trigin is HIGH. */
#define ETB_FFCR_FONTRIG_Pos (5UL) /*!< Position of FONTRIG field. */
#define ETB_FFCR_FONTRIG_Msk (0x1UL << ETB_FFCR_FONTRIG_Pos) /*!< Bit mask of FONTRIG field. */

/* Bit 4 : Set this bit to enable use of the flushin connection. This is clear on reset. */
#define ETB_FFCR_FONFLIN_Pos (4UL) /*!< Position of FONFLIN field. */
#define ETB_FFCR_FONFLIN_Msk (0x1UL << ETB_FFCR_FONFLIN_Pos) /*!< Bit mask of FONFLIN field. */

/* Bit 1 : Continuous mode in the ETB corresponds to normal mode with the embedding of triggers. Can only be changed when FtStopped is HIGH. This bit is clear on reset. */
#define ETB_FFCR_ENFCONT_Pos (1UL) /*!< Position of ENFCONT field. */
#define ETB_FFCR_ENFCONT_Msk (0x1UL << ETB_FFCR_ENFCONT_Pos) /*!< Bit mask of ENFCONT field. */

/* Bit 0 : Do not embed Triggers into the formatted stream. Trace disable cycles and triggers are indicated by TRACECTL, where fitted. Can only be changed when FtStopped is HIGH. This bit is clear on reset. */
#define ETB_FFCR_ENFTC_Pos (0UL) /*!< Position of ENFTC field. */
#define ETB_FFCR_ENFTC_Msk (0x1UL << ETB_FFCR_ENFTC_Pos) /*!< Bit mask of ENFTC field. */

/* Register: ETB_ITMISCOP0 */
/* Description: Integration Test Miscellaneous Output Register 0 */

