NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 1 : Set the value of full output port. */
#define ETB_ITMISCOP0_FULL_Pos (1UL) /*!< Position of FULL field. */
#define ETB_ITMISCOP0_FULL_Msk (0x1UL << ETB_ITMISCOP0_FULL_Pos) /*!< Bit mask of FULL field. */

/* Bit 0 : Set the value of acqcomp. */
#define ETB_ITMISCOP0_ACQCOMP_Pos (0UL) /*!< Position of ACQCOMP field. */
#define ETB_ITMISCOP0_ACQCOMP_Msk (0x1UL << ETB_ITMISCOP0_ACQCOMP_Pos) /*!< Bit mask of ACQCOMP field. */

/* Register: ETB_ITTRFLINACK */
/* Description: Integration Test Trigger In and Flush In Acknowledge Register */

/* Bit 1 : Set the value of flushinack. */
#define ETB_ITTRFLINACK_FLUSHINACK_Pos (1UL) /*!< Position of FLUSHINACK field. */
#define ETB_ITTRFLINACK_FLUSHINACK_Msk (0x1UL << ETB_ITTRFLINACK_FLUSHINACK_Pos) /*!< Bit mask of FLUSHINACK field. */

/* Bit 0 : Set the value of triginack. */
#define ETB_ITTRFLINACK_TRIGINACK_Pos (0UL) /*!< Position of TRIGINACK field. */
#define ETB_ITTRFLINACK_TRIGINACK_Msk (0x1UL << ETB_ITTRFLINACK_TRIGINACK_Pos) /*!< Bit mask of TRIGINACK field. */

/* Register: ETB_ITTRFLIN */
/* Description: Integration Test Trigger In and Flush In Register */

/* Bit 1 : Read the value of flushin. */
#define ETB_ITTRFLIN_FLUSHIN_Pos (1UL) /*!< Position of FLUSHIN field. */
#define ETB_ITTRFLIN_FLUSHIN_Msk (0x1UL << ETB_ITTRFLIN_FLUSHIN_Pos) /*!< Bit mask of FLUSHIN field. */

/* Bit 0 : Read the value of trigin. */
#define ETB_ITTRFLIN_TRIGIN_Pos (0UL) /*!< Position of TRIGIN field. */
#define ETB_ITTRFLIN_TRIGIN_Msk (0x1UL << ETB_ITTRFLIN_TRIGIN_Pos) /*!< Bit mask of TRIGIN field. */

/* Register: ETB_ITATBDATA0 */
/* Description: Integration Test ATB Data Register 0 */

/* Bit 4 : Read the value of atdatas[31]. */
#define ETB_ITATBDATA0_ATDATA_31_Pos (4UL) /*!< Position of ATDATA_31 field. */
#define ETB_ITATBDATA0_ATDATA_31_Msk (0x1UL << ETB_ITATBDATA0_ATDATA_31_Pos) /*!< Bit mask of ATDATA_31 field. */

/* Bit 3 : Read the value of atdatas[23]. */
#define ETB_ITATBDATA0_ATDATA_23_Pos (3UL) /*!< Position of ATDATA_23 field. */
#define ETB_ITATBDATA0_ATDATA_23_Msk (0x1UL << ETB_ITATBDATA0_ATDATA_23_Pos) /*!< Bit mask of ATDATA_23 field. */

/* Bit 2 : Read the value of atdatas[15]. */
#define ETB_ITATBDATA0_ATDATA_15_Pos (2UL) /*!< Position of ATDATA_15 field. */
#define ETB_ITATBDATA0_ATDATA_15_Msk (0x1UL << ETB_ITATBDATA0_ATDATA_15_Pos) /*!< Bit mask of ATDATA_15 field. */

/* Bit 1 : Read the value of atdatas[7]. */
#define ETB_ITATBDATA0_ATDATA_7_Pos (1UL) /*!< Position of ATDATA_7 field. */
#define ETB_ITATBDATA0_ATDATA_7_Msk (0x1UL << ETB_ITATBDATA0_ATDATA_7_Pos) /*!< Bit mask of ATDATA_7 field. */

/* Bit 0 : Read the value of atdatas[0]. */
#define ETB_ITATBDATA0_ATDATA_0_Pos (0UL) /*!< Position of ATDATA_0 field. */
#define ETB_ITATBDATA0_ATDATA_0_Msk (0x1UL << ETB_ITATBDATA0_ATDATA_0_Pos) /*!< Bit mask of ATDATA_0 field. */

/* Register: ETB_ITATBCTR2 */
/* Description: Integration Test ATB Control Register 2 */

/* Bit 1 : Set the value of afvalids. */
#define ETB_ITATBCTR2_AFVALIDS_Pos (1UL) /*!< Position of AFVALIDS field. */
#define ETB_ITATBCTR2_AFVALIDS_Msk (0x1UL << ETB_ITATBCTR2_AFVALIDS_Pos) /*!< Bit mask of AFVALIDS field. */

/* Bit 0 : Set the value of atreadys. */
#define ETB_ITATBCTR2_ATREADYS_Pos (0UL) /*!< Position of ATREADYS field. */
#define ETB_ITATBCTR2_ATREADYS_Msk (0x1UL << ETB_ITATBCTR2_ATREADYS_Pos) /*!< Bit mask of ATREADYS field. */

/* Register: ETB_ITATBCTR1 */
/* Description: Integration Test ATB Control Register 1 */

/* Bits 6..0 : Read the value of atids. */
#define ETB_ITATBCTR1_ATID_Pos (0UL) /*!< Position of ATID field. */
#define ETB_ITATBCTR1_ATID_Msk (0x7FUL << ETB_ITATBCTR1_ATID_Pos) /*!< Bit mask of ATID field. */

/* Register: ETB_ITATBCTR0 */
/* Description: Integration Test ATB Control Register 0 */

/* Bits 9..8 : Read the value of atbytess. */
#define ETB_ITATBCTR0_ATBYTES_Pos (8UL) /*!< Position of ATBYTES field. */
#define ETB_ITATBCTR0_ATBYTES_Msk (0x3UL << ETB_ITATBCTR0_ATBYTES_Pos) /*!< Bit mask of ATBYTES field. */

/* Bit 1 : Read the value of afreadys. */
#define ETB_ITATBCTR0_AFREADY_Pos (1UL) /*!< Position of AFREADY field. */
#define ETB_ITATBCTR0_AFREADY_Msk (0x1UL << ETB_ITATBCTR0_AFREADY_Pos) /*!< Bit mask of AFREADY field. */

/* Bit 0 : Read the value of atvalids. */
#define ETB_ITATBCTR0_ATVALID_Pos (0UL) /*!< Position of ATVALID field. */
#define ETB_ITATBCTR0_ATVALID_Msk (0x1UL << ETB_ITATBCTR0_ATVALID_Pos) /*!< Bit mask of ATVALID field. */

/* Register: ETB_ITCTRL */
/* Description: Integration Mode Control Register */

/* Bit 0 : Allows the component to switch from functional mode to integration mode or back. */
#define ETB_ITCTRL_INTEGRATION_MODE_Pos (0UL) /*!< Position of INTEGRATION_MODE field. */
#define ETB_ITCTRL_INTEGRATION_MODE_Msk (0x1UL << ETB_ITCTRL_INTEGRATION_MODE_Pos) /*!< Bit mask of INTEGRATION_MODE field. */

/* Register: ETB_CLAIMSET */
/* Description: Claim Tag Set Register */

/* Bits 3..0 : This claim tag bit is implemented */
#define ETB_CLAIMSET_CLAIMSET_Pos (0UL) /*!< Position of CLAIMSET field. */
#define ETB_CLAIMSET_CLAIMSET_Msk (0xFUL << ETB_CLAIMSET_CLAIMSET_Pos) /*!< Bit mask of CLAIMSET field. */

/* Register: ETB_CLAIMCLR */
/* Description: Claim Tag Clear Register */

/* Bits 3..0 : The value present reflects the current setting of the Claim Tag. */
#define ETB_CLAIMCLR_CLAIMCLR_Pos (0UL) /*!< Position of CLAIMCLR field. */
#define ETB_CLAIMCLR_CLAIMCLR_Msk (0xFUL << ETB_CLAIMCLR_CLAIMCLR_Pos) /*!< Bit mask of CLAIMCLR field. */

/* Register: ETB_LAR */
/* Description: Lock Access Register */

/* Bits 31..0 : A write of 0xC5ACCE55 enables further write access to this device. A write of any value other than 0xC5ACCE55 will have the affect of removing write access. */
#define ETB_LAR_ACCESS_W_Pos (0UL) /*!< Position of ACCESS_W field. */
#define ETB_LAR_ACCESS_W_Msk (0xFFFFFFFFUL << ETB_LAR_ACCESS_W_Pos) /*!< Bit mask of ACCESS_W field. */

/* Register: ETB_LSR */
/* Description: Lock Status Register */

/* Bit 2 : Indicates if the Lock Access Register (0xFB0) is implemented as 8-bit or 32-bit */
#define ETB_LSR_LOCKTYPE_Pos (2UL) /*!< Position of LOCKTYPE field. */
#define ETB_LSR_LOCKTYPE_Msk (0x1UL << ETB_LSR_LOCKTYPE_Pos) /*!< Bit mask of LOCKTYPE field. */

/* Bit 1 : Returns the current status of the Lock. This bit reads as 0 when read from an external debugger (paddrdbg31 = 1) since external debugger accesses are not subject to Lock Registers. */
#define ETB_LSR_LOCKGRANT_Pos (1UL) /*!< Position of LOCKGRANT field. */
#define ETB_LSR_LOCKGRANT_Msk (0x1UL << ETB_LSR_LOCKGRANT_Pos) /*!< Bit mask of LOCKGRANT field. */

/* Bit 0 : Indicates that a lock control mechanism exists for this device. This bit reads as 0 when read from an external debugger (paddrdbg31 = 1) since external debugger accesses are not subject to Lock Registers. */
#define ETB_LSR_LOCKEXIST_Pos (0UL) /*!< Position of LOCKEXIST field. */
#define ETB_LSR_LOCKEXIST_Msk (0x1UL << ETB_LSR_LOCKEXIST_Pos) /*!< Bit mask of LOCKEXIST field. */

