NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Register: ETB_AUTHSTATUS */
/* Description: Authentication Status Register */

/* Bits 7..6 : Indicates the security level for secure non-invasive debug */
#define ETB_AUTHSTATUS_SNID_Pos (6UL) /*!< Position of SNID field. */
#define ETB_AUTHSTATUS_SNID_Msk (0x3UL << ETB_AUTHSTATUS_SNID_Pos) /*!< Bit mask of SNID field. */

/* Bits 5..4 : Indicates the security level for secure invasive debug */
#define ETB_AUTHSTATUS_SID_Pos (4UL) /*!< Position of SID field. */
#define ETB_AUTHSTATUS_SID_Msk (0x3UL << ETB_AUTHSTATUS_SID_Pos) /*!< Bit mask of SID field. */

/* Bits 3..2 : Indicates the security level for non-secure non-invasive debug */
#define ETB_AUTHSTATUS_NSNID_Pos (2UL) /*!< Position of NSNID field. */
#define ETB_AUTHSTATUS_NSNID_Msk (0x3UL << ETB_AUTHSTATUS_NSNID_Pos) /*!< Bit mask of NSNID field. */

/* Bits 1..0 : Indicates the security level for non-secure invasive debug */
#define ETB_AUTHSTATUS_NSID_Pos (0UL) /*!< Position of NSID field. */
#define ETB_AUTHSTATUS_NSID_Msk (0x3UL << ETB_AUTHSTATUS_NSID_Pos) /*!< Bit mask of NSID field. */

/* Register: ETB_DEVID */
/* Description: Device Configuration Register */

/* Bit 5 : This bit returns 0 on reads indicating that the ETB RAM operates synchronously to atclk. */
#define ETB_DEVID_RAMCLK_Pos (5UL) /*!< Position of RAMCLK field. */
#define ETB_DEVID_RAMCLK_Msk (0x1UL << ETB_DEVID_RAMCLK_Pos) /*!< Bit mask of RAMCLK field. */

/* Bits 4..0 : When non-zero this value indicates the type/number of ATB multiplexing present on the input to the ATB. */
#define ETB_DEVID_EXTMUXNUM_Pos (0UL) /*!< Position of EXTMUXNUM field. */
#define ETB_DEVID_EXTMUXNUM_Msk (0x1FUL << ETB_DEVID_EXTMUXNUM_Pos) /*!< Bit mask of EXTMUXNUM field. */

/* Register: ETB_DEVTYPE */
/* Description: Device Type Identifier Register */

/* Bits 7..4 : Sub-classification within the major category */
#define ETB_DEVTYPE_SUB_TYPE_Pos (4UL) /*!< Position of SUB_TYPE field. */
#define ETB_DEVTYPE_SUB_TYPE_Msk (0xFUL << ETB_DEVTYPE_SUB_TYPE_Pos) /*!< Bit mask of SUB_TYPE field. */

/* Bits 3..0 : Major classification grouping for this debug/trace component */
#define ETB_DEVTYPE_MAJOR_TYPE_Pos (0UL) /*!< Position of MAJOR_TYPE field. */
#define ETB_DEVTYPE_MAJOR_TYPE_Msk (0xFUL << ETB_DEVTYPE_MAJOR_TYPE_Pos) /*!< Bit mask of MAJOR_TYPE field. */

/* Register: ETB_PERIPHID4 */
/* Description: Peripheral ID4 Register */

/* Bits 7..4 : This is a 4-bit value that indicates the total contiguous size of the memory window used by this component in powers of 2 from the standard 4KB. If a component only requires the standard 4KB then this should read as 0x0, 4KB only, for 8KB set to 0x1, 16KB == 0x2, 32KB == 0x3, and so on. */
#define ETB_PERIPHID4_SIZE_Pos (4UL) /*!< Position of SIZE field. */
#define ETB_PERIPHID4_SIZE_Msk (0xFUL << ETB_PERIPHID4_SIZE_Pos) /*!< Bit mask of SIZE field. */

/* Bits 3..0 : JEDEC continuation code indicating the designer of the component (along with the identity code) */
#define ETB_PERIPHID4_DES_2_Pos (0UL) /*!< Position of DES_2 field. */
#define ETB_PERIPHID4_DES_2_Msk (0xFUL << ETB_PERIPHID4_DES_2_Pos) /*!< Bit mask of DES_2 field. */

/* Register: ETB_PERIPHID0 */
/* Description: Peripheral ID0 Register */

/* Bits 7..0 : Bits [7:0] of the component's part number. This is selected by the designer of the component. */
#define ETB_PERIPHID0_PART_0_Pos (0UL) /*!< Position of PART_0 field. */
#define ETB_PERIPHID0_PART_0_Msk (0xFFUL << ETB_PERIPHID0_PART_0_Pos) /*!< Bit mask of PART_0 field. */

/* Register: ETB_PERIPHID1 */
/* Description: Peripheral ID1 Register */

/* Bits 7..4 : Bits 3:0 of the JEDEC identity code indicating the designer of the component (along with the continuation code) */
#define ETB_PERIPHID1_DES_0_Pos (4UL) /*!< Position of DES_0 field. */
#define ETB_PERIPHID1_DES_0_Msk (0xFUL << ETB_PERIPHID1_DES_0_Pos) /*!< Bit mask of DES_0 field. */

/* Bits 3..0 : Bits [11:8] of the component's part number. This is selected by the designer of the component. */
#define ETB_PERIPHID1_PART_1_Pos (0UL) /*!< Position of PART_1 field. */
#define ETB_PERIPHID1_PART_1_Msk (0xFUL << ETB_PERIPHID1_PART_1_Pos) /*!< Bit mask of PART_1 field. */

/* Register: ETB_PERIPHID2 */
/* Description: Peripheral ID2 Register */

/* Bits 7..4 : The Revision field is an incremental value starting at 0x0 for the first design of this component. This only increases by 1 for both major and minor revisions and is simply used as a look-up to establish the exact major/minor revision. */
#define ETB_PERIPHID2_REVISION_Pos (4UL) /*!< Position of REVISION field. */
#define ETB_PERIPHID2_REVISION_Msk (0xFUL << ETB_PERIPHID2_REVISION_Pos) /*!< Bit mask of REVISION field. */

/* Bit 3 : Always set. Indicates that a JEDEC assigned value is used */
#define ETB_PERIPHID2_JEDEC_Pos (3UL) /*!< Position of JEDEC field. */
#define ETB_PERIPHID2_JEDEC_Msk (0x1UL << ETB_PERIPHID2_JEDEC_Pos) /*!< Bit mask of JEDEC field. */

/* Bits 2..0 : Bits 6:4 of the JEDEC identity code indicating the designer of the component (along with the continuation code) */
#define ETB_PERIPHID2_DES_1_Pos (0UL) /*!< Position of DES_1 field. */
#define ETB_PERIPHID2_DES_1_Msk (0x7UL << ETB_PERIPHID2_DES_1_Pos) /*!< Bit mask of DES_1 field. */

/* Register: ETB_PERIPHID3 */
/* Description: Peripheral ID3 Register */

/* Bits 7..4 : This field indicates minor errata fixes specific to this design, for example metal fixes after implementation. In most cases this field is zero. It is recommended that component designers ensure this field can be changed by a metal fix if required, for example by driving it from registers that reset to zero. */
#define ETB_PERIPHID3_REVAND_Pos (4UL) /*!< Position of REVAND field. */
#define ETB_PERIPHID3_REVAND_Msk (0xFUL << ETB_PERIPHID3_REVAND_Pos) /*!< Bit mask of REVAND field. */

/* Bits 3..0 : Where the component is reusable IP, this value indicates if the customer has modified the behavior of the component. In most cases this field is zero. */
#define ETB_PERIPHID3_CMOD_Pos (0UL) /*!< Position of CMOD field. */
#define ETB_PERIPHID3_CMOD_Msk (0xFUL << ETB_PERIPHID3_CMOD_Pos) /*!< Bit mask of CMOD field. */

/* Register: ETB_COMPID0 */
/* Description: Component ID0 Register */

