NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bits 7..0 : Contains bits [7:0] of the component identification */
#define ETB_COMPID0_PRMBL_0_Pos (0UL) /*!< Position of PRMBL_0 field. */
#define ETB_COMPID0_PRMBL_0_Msk (0xFFUL << ETB_COMPID0_PRMBL_0_Pos) /*!< Bit mask of PRMBL_0 field. */

/* Register: ETB_COMPID1 */
/* Description: Component ID1 Register */

/* Bits 7..4 : Class of the component. E. g. ROM table, CoreSight component etc. Constitutes bits [15:12] of the component identification. */
#define ETB_COMPID1_CLASS_Pos (4UL) /*!< Position of CLASS field. */
#define ETB_COMPID1_CLASS_Msk (0xFUL << ETB_COMPID1_CLASS_Pos) /*!< Bit mask of CLASS field. */

/* Bits 3..0 : Contains bits [11:8] of the component identification */
#define ETB_COMPID1_PRMBL_1_Pos (0UL) /*!< Position of PRMBL_1 field. */
#define ETB_COMPID1_PRMBL_1_Msk (0xFUL << ETB_COMPID1_PRMBL_1_Pos) /*!< Bit mask of PRMBL_1 field. */

/* Register: ETB_COMPID2 */
/* Description: Component ID2 Register */

/* Bits 7..0 : Contains bits [23:16] of the component identification */
#define ETB_COMPID2_PRMBL_2_Pos (0UL) /*!< Position of PRMBL_2 field. */
#define ETB_COMPID2_PRMBL_2_Msk (0xFFUL << ETB_COMPID2_PRMBL_2_Pos) /*!< Bit mask of PRMBL_2 field. */

/* Register: ETB_COMPID3 */
/* Description: Component ID3 Register */

/* Bits 7..0 : Contains bits [31:24] of the component identification */
#define ETB_COMPID3_PRMBL_3_Pos (0UL) /*!< Position of PRMBL_3 field. */
#define ETB_COMPID3_PRMBL_3_Msk (0xFFUL << ETB_COMPID3_PRMBL_3_Pos) /*!< Bit mask of PRMBL_3 field. */


/* Peripheral: ETM */
/* Description: Embedded Trace Macrocell */

/* Register: ETM_TRCPRGCTLR */
/* Description: Enables the trace unit. */

/* Bit 0 : Trace unit enable bit */
#define ETM_TRCPRGCTLR_EN_Pos (0UL) /*!< Position of EN field. */
#define ETM_TRCPRGCTLR_EN_Msk (0x1UL << ETM_TRCPRGCTLR_EN_Pos) /*!< Bit mask of EN field. */
#define ETM_TRCPRGCTLR_EN_Disabled (0x0UL) /*!< The trace unit is disabled. All trace resources are inactive and no trace is generated. */
#define ETM_TRCPRGCTLR_EN_Enabled (0x1UL) /*!< The trace unit is enabled. */

/* Register: ETM_TRCPROCSELR */
/* Description: Controls which PE to trace. Might ignore writes when the trace unit is enabled or not idle. Before writing to this register, ensure that TRCSTATR.IDLE == 1 so that the trace unit can synchronize with the chosen PE. Implemented if TRCIDR3.NUMPROC is greater than zero. */

/* Bits 4..0 : PE select bits that select the PE to trace. */
#define ETM_TRCPROCSELR_PROCSEL_Pos (0UL) /*!< Position of PROCSEL field. */
#define ETM_TRCPROCSELR_PROCSEL_Msk (0x1FUL << ETM_TRCPROCSELR_PROCSEL_Pos) /*!< Bit mask of PROCSEL field. */

/* Register: ETM_TRCSTATR */
/* Description: Idle status bit */

/* Bit 1 : Programmers' model stable bit */
#define ETM_TRCSTATR_PMSTABLE_Pos (1UL) /*!< Position of PMSTABLE field. */
#define ETM_TRCSTATR_PMSTABLE_Msk (0x1UL << ETM_TRCSTATR_PMSTABLE_Pos) /*!< Bit mask of PMSTABLE field. */
#define ETM_TRCSTATR_PMSTABLE_NotStable (0x0UL) /*!< The programmers' model is not stable. */
#define ETM_TRCSTATR_PMSTABLE_Stable (0x1UL) /*!< The programmers' model is stable. */

/* Bit 0 : Trace unit enable bit */
#define ETM_TRCSTATR_IDLE_Pos (0UL) /*!< Position of IDLE field. */
#define ETM_TRCSTATR_IDLE_Msk (0x1UL << ETM_TRCSTATR_IDLE_Pos) /*!< Bit mask of IDLE field. */
#define ETM_TRCSTATR_IDLE_NotIdle (0x0UL) /*!< The trace unit is not idle. */
#define ETM_TRCSTATR_IDLE_Idle (0x1UL) /*!< The trace unit is idle. */

/* Register: ETM_TRCCONFIGR */
/* Description: Controls the tracing options This register must always be programmed as part of trace unit initialization. Might ignore writes when the trace unit is enabled or not idle. */

/* Bit 17 : Data value tracing bit. */
#define ETM_TRCCONFIGR_DV_Pos (17UL) /*!< Position of DV field. */
#define ETM_TRCCONFIGR_DV_Msk (0x1UL << ETM_TRCCONFIGR_DV_Pos) /*!< Bit mask of DV field. */
#define ETM_TRCCONFIGR_DV_Disabled (0x0UL) /*!< Data value tracing is disabled. */
#define ETM_TRCCONFIGR_DV_Enabled (0x1UL) /*!< Data value tracing is enabled. */

/* Bit 16 : Data address tracing bit. */
#define ETM_TRCCONFIGR_DA_Pos (16UL) /*!< Position of DA field. */
#define ETM_TRCCONFIGR_DA_Msk (0x1UL << ETM_TRCCONFIGR_DA_Pos) /*!< Bit mask of DA field. */
#define ETM_TRCCONFIGR_DA_Disabled (0x0UL) /*!< Data address tracing is disabled. */
#define ETM_TRCCONFIGR_DA_Enabled (0x1UL) /*!< Data address tracing is enabled. */

/* Bit 15 : Control bit to select the Virtual context identifier value used by the trace unit, both for trace generation and in the Virtual context identifier comparators. */
#define ETM_TRCCONFIGR_VMIDOPT_Pos (15UL) /*!< Position of VMIDOPT field. */
#define ETM_TRCCONFIGR_VMIDOPT_Msk (0x1UL << ETM_TRCCONFIGR_VMIDOPT_Pos) /*!< Bit mask of VMIDOPT field. */
#define ETM_TRCCONFIGR_VMIDOPT_VTTBR_EL2 (0x0UL) /*!< VTTBR_EL2.VMID is used. If the trace unit supports a Virtual context
identifier larger than the VTTBR_EL2.VMID, the upper unused bits are always
zero. If the trace unit supports a Virtual context identifier larger than 8 bits and
if the VTCR_EL2.VS bit forces use of an 8-bit Virtual context identifier, bits
[15:8] of the trace unit Virtual context identifier are always zero. */
#define ETM_TRCCONFIGR_VMIDOPT_CONTEXTIDR_EL2 (0x1UL) /*!< CONTEXTIDR_EL2 is used. */

/* Bits 14..13 : Q element enable field. */
#define ETM_TRCCONFIGR_QE_Pos (13UL) /*!< Position of QE field. */
#define ETM_TRCCONFIGR_QE_Msk (0x3UL << ETM_TRCCONFIGR_QE_Pos) /*!< Bit mask of QE field. */
#define ETM_TRCCONFIGR_QE_Disabled (0x0UL) /*!< Q elements are disabled. */
#define ETM_TRCCONFIGR_QE_OnlyWithoutInstCounts (0x1UL) /*!< Q elements with instruction counts are enabled. Q elements without instruction counts are disabled. */
#define ETM_TRCCONFIGR_QE_Enabled (0x3UL) /*!< Q elements with and without instruction counts are enabled. */

/* Bit 12 : Return stack enable bit. */
#define ETM_TRCCONFIGR_RS_Pos (12UL) /*!< Position of RS field. */
#define ETM_TRCCONFIGR_RS_Msk (0x1UL << ETM_TRCCONFIGR_RS_Pos) /*!< Bit mask of RS field. */
#define ETM_TRCCONFIGR_RS_Disabled (0x0UL) /*!< Return stack is disabled. */
#define ETM_TRCCONFIGR_RS_Enabled (0x1UL) /*!< Return stack is enabled. */

/* Bit 11 : Global timestamp tracing bit. */
#define ETM_TRCCONFIGR_TS_Pos (11UL) /*!< Position of TS field. */
#define ETM_TRCCONFIGR_TS_Msk (0x1UL << ETM_TRCCONFIGR_TS_Pos) /*!< Bit mask of TS field. */
#define ETM_TRCCONFIGR_TS_Disabled (0x0UL) /*!< Global timestamp tracing is disabled. */
#define ETM_TRCCONFIGR_TS_Enabled (0x1UL) /*!< Global timestamp tracing is enabled. */

/* Bits 10..8 : Conditional instruction tracing bit. */
#define ETM_TRCCONFIGR_COND_Pos (8UL) /*!< Position of COND field. */
#define ETM_TRCCONFIGR_COND_Msk (0x7UL << ETM_TRCCONFIGR_COND_Pos) /*!< Bit mask of COND field. */
#define ETM_TRCCONFIGR_COND_Disabled (0x0UL) /*!< Conditional instruction tracing is disabled. */
#define ETM_TRCCONFIGR_COND_LoadOnly (0x1UL) /*!< Conditional load instructions are traced. */
#define ETM_TRCCONFIGR_COND_StoreOnly (0x2UL) /*!< Conditional store instructions are traced. */
#define ETM_TRCCONFIGR_COND_LoadAndStore (0x3UL) /*!< Conditional load and store instructions are traced. */
#define ETM_TRCCONFIGR_COND_All (0x7UL) /*!< All conditional instructions are traced. */

/* Bit 7 : Virtual context identifier tracing bit. */
#define ETM_TRCCONFIGR_VMID_Pos (7UL) /*!< Position of VMID field. */
#define ETM_TRCCONFIGR_VMID_Msk (0x1UL << ETM_TRCCONFIGR_VMID_Pos) /*!< Bit mask of VMID field. */
#define ETM_TRCCONFIGR_VMID_Disabled (0x0UL) /*!< Virtual context identifier tracing is disabled. */
#define ETM_TRCCONFIGR_VMID_Enabled (0x1UL) /*!< Virtual context identifier tracing is enabled. */

/* Bit 6 : Context ID tracing bit. */
#define ETM_TRCCONFIGR_CID_Pos (6UL) /*!< Position of CID field. */
#define ETM_TRCCONFIGR_CID_Msk (0x1UL << ETM_TRCCONFIGR_CID_Pos) /*!< Bit mask of CID field. */
#define ETM_TRCCONFIGR_CID_Disabled (0x0UL) /*!< Context ID tracing is disabled. */
#define ETM_TRCCONFIGR_CID_Enabled (0x1UL) /*!< Context ID tracing is enabled. */

