NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 4 : Cycle counting instruction trace bit. */
#define ETM_TRCCONFIGR_CCI_Pos (4UL) /*!< Position of CCI field. */
#define ETM_TRCCONFIGR_CCI_Msk (0x1UL << ETM_TRCCONFIGR_CCI_Pos) /*!< Bit mask of CCI field. */
#define ETM_TRCCONFIGR_CCI_Disabled (0x0UL) /*!< Cycle counting in the instruction trace is disabled. */
#define ETM_TRCCONFIGR_CCI_Enabled (0x1UL) /*!< Cycle counting in the instruction trace is enabled. */

/* Bit 3 : Branch broadcast mode bit. */
#define ETM_TRCCONFIGR_BB_Pos (3UL) /*!< Position of BB field. */
#define ETM_TRCCONFIGR_BB_Msk (0x1UL << ETM_TRCCONFIGR_BB_Pos) /*!< Bit mask of BB field. */
#define ETM_TRCCONFIGR_BB_Disabled (0x0UL) /*!< Branch broadcast mode is disabled. */
#define ETM_TRCCONFIGR_BB_Enabled (0x1UL) /*!< Branch broadcast mode is enabled. */

/* Bit 2 : Instruction P0 field. This field controls whether store instructions are traced as P0 instructions. */
#define ETM_TRCCONFIGR_STOREASP0INST_Pos (2UL) /*!< Position of STOREASP0INST field. */
#define ETM_TRCCONFIGR_STOREASP0INST_Msk (0x1UL << ETM_TRCCONFIGR_STOREASP0INST_Pos) /*!< Bit mask of STOREASP0INST field. */
#define ETM_TRCCONFIGR_STOREASP0INST_No (0x0UL) /*!< Do not trace store instructions as P0 instructions. */
#define ETM_TRCCONFIGR_STOREASP0INST_Yes (0x1UL) /*!< Trace store instructions as P0 instructions. */

/* Bit 1 : Instruction P0 load field. This field controls whether load instructions are traced as P0 instructions. */
#define ETM_TRCCONFIGR_LOADASP0INST_Pos (1UL) /*!< Position of LOADASP0INST field. */
#define ETM_TRCCONFIGR_LOADASP0INST_Msk (0x1UL << ETM_TRCCONFIGR_LOADASP0INST_Pos) /*!< Bit mask of LOADASP0INST field. */
#define ETM_TRCCONFIGR_LOADASP0INST_No (0x0UL) /*!< Do not trace load instructions as P0 instructions. */
#define ETM_TRCCONFIGR_LOADASP0INST_Yes (0x1UL) /*!< Trace load instructions as P0 instructions. */

/* Register: ETM_TRCEVENTCTL0R */
/* Description: Controls the tracing of arbitrary events. If the selected event occurs a trace element is generated in the trace stream according to the settings in TRCEVENTCTL1R.DATAEN and TRCEVENTCTL1R.INSTEN. */

/* Bits 7..0 : Select which event should generate trace elements. */
#define ETM_TRCEVENTCTL0R_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define ETM_TRCEVENTCTL0R_EVENT_Msk (0xFFUL << ETM_TRCEVENTCTL0R_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: ETM_TRCEVENTCTL1R */
/* Description: Controls the behavior of the events that TRCEVENTCTL0R selects. This register must always be programmed as part of trace unit initialization. Might ignore writes when the trace unit is enabled or not idle. */

/* Bit 12 : Low-power state behavior override bit. Controls how a trace unit behaves in low-power state. */
#define ETM_TRCEVENTCTL1R_LPOVERRIDE_Pos (12UL) /*!< Position of LPOVERRIDE field. */
#define ETM_TRCEVENTCTL1R_LPOVERRIDE_Msk (0x1UL << ETM_TRCEVENTCTL1R_LPOVERRIDE_Pos) /*!< Bit mask of LPOVERRIDE field. */
#define ETM_TRCEVENTCTL1R_LPOVERRIDE_Disabled (0x0UL) /*!< Trace unit low-power state behavior is not affected. That is, the trace unit is enabled to enter low-power state. */
#define ETM_TRCEVENTCTL1R_LPOVERRIDE_Enabled (0x1UL) /*!< Trace unit low-power state behavior is overridden. That is, entry to a low-power state does not affect the trace unit resources or trace generation. */

/* Bit 11 : AMBA Trace Bus (ATB) trigger enable bit. */
#define ETM_TRCEVENTCTL1R_ATB_Pos (11UL) /*!< Position of ATB field. */
#define ETM_TRCEVENTCTL1R_ATB_Msk (0x1UL << ETM_TRCEVENTCTL1R_ATB_Pos) /*!< Bit mask of ATB field. */
#define ETM_TRCEVENTCTL1R_ATB_Disabled (0x0UL) /*!< ATB trigger is disabled. */
#define ETM_TRCEVENTCTL1R_ATB_Enabled (0x1UL) /*!< ATB trigger is enabled. If a CoreSight ATB interface is implemented then when event 0 occurs the trace unit generates an ATB event. */

/* Bit 4 : Data event enable bit. */
#define ETM_TRCEVENTCTL1R_DATAEN_Pos (4UL) /*!< Position of DATAEN field. */
#define ETM_TRCEVENTCTL1R_DATAEN_Msk (0x1UL << ETM_TRCEVENTCTL1R_DATAEN_Pos) /*!< Bit mask of DATAEN field. */
#define ETM_TRCEVENTCTL1R_DATAEN_Disabled (0x0UL) /*!< The trace unit does not generate an Event element if event 0 occurs. */
#define ETM_TRCEVENTCTL1R_DATAEN_Enabled (0x1UL) /*!< The trace unit generates an Event element in the data trace stream if event 0 occurs. */

/* Bit 3 : Instruction event enable field. */
#define ETM_TRCEVENTCTL1R_INSTEN_3_Pos (3UL) /*!< Position of INSTEN_3 field. */
#define ETM_TRCEVENTCTL1R_INSTEN_3_Msk (0x1UL << ETM_TRCEVENTCTL1R_INSTEN_3_Pos) /*!< Bit mask of INSTEN_3 field. */
#define ETM_TRCEVENTCTL1R_INSTEN_3_Disabled (0x0UL) /*!< The trace unit does not generate an Event element. */
#define ETM_TRCEVENTCTL1R_INSTEN_3_Enabled (0x1UL) /*!< The trace unit generates an Event element for event 3, in the instruction trace stream. */

/* Bit 2 : Instruction event enable field. */
#define ETM_TRCEVENTCTL1R_INSTEN_2_Pos (2UL) /*!< Position of INSTEN_2 field. */
#define ETM_TRCEVENTCTL1R_INSTEN_2_Msk (0x1UL << ETM_TRCEVENTCTL1R_INSTEN_2_Pos) /*!< Bit mask of INSTEN_2 field. */
#define ETM_TRCEVENTCTL1R_INSTEN_2_Disabled (0x0UL) /*!< The trace unit does not generate an Event element. */
#define ETM_TRCEVENTCTL1R_INSTEN_2_Enabled (0x1UL) /*!< The trace unit generates an Event element for event 2, in the instruction trace stream. */

/* Bit 1 : Instruction event enable field. */
#define ETM_TRCEVENTCTL1R_INSTEN_1_Pos (1UL) /*!< Position of INSTEN_1 field. */
#define ETM_TRCEVENTCTL1R_INSTEN_1_Msk (0x1UL << ETM_TRCEVENTCTL1R_INSTEN_1_Pos) /*!< Bit mask of INSTEN_1 field. */
#define ETM_TRCEVENTCTL1R_INSTEN_1_Disabled (0x0UL) /*!< The trace unit does not generate an Event element. */
#define ETM_TRCEVENTCTL1R_INSTEN_1_Enabled (0x1UL) /*!< The trace unit generates an Event element for event 1, in the instruction trace stream. */

/* Bit 0 : Instruction event enable field. */
#define ETM_TRCEVENTCTL1R_INSTEN_0_Pos (0UL) /*!< Position of INSTEN_0 field. */
#define ETM_TRCEVENTCTL1R_INSTEN_0_Msk (0x1UL << ETM_TRCEVENTCTL1R_INSTEN_0_Pos) /*!< Bit mask of INSTEN_0 field. */
#define ETM_TRCEVENTCTL1R_INSTEN_0_Disabled (0x0UL) /*!< The trace unit does not generate an Event element. */
#define ETM_TRCEVENTCTL1R_INSTEN_0_Enabled (0x1UL) /*!< The trace unit generates an Event element for event 0, in the instruction trace stream. */

/* Register: ETM_TRCSTALLCTLR */
/* Description: Enables trace unit functionality that prevents trace unit buffer overflows. Might ignore writes when the trace unit is enabled or not idle. Must be programmed if TRCIDR3.STALLCTL == 1. */

