NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 7 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. 
        Each field represents an address range comparator pair, so field[7] controls the selection of address range comparator pair 7. */
#define ETM_TRCBBCTLR_RANGE_7_Pos (7UL) /*!< Position of RANGE_7 field. */
#define ETM_TRCBBCTLR_RANGE_7_Msk (0x1UL << ETM_TRCBBCTLR_RANGE_7_Pos) /*!< Bit mask of RANGE_7 field. */
#define ETM_TRCBBCTLR_RANGE_7_Disabled (0x0UL) /*!< The address range that address range comparator pair 7 defines, is not selected. */
#define ETM_TRCBBCTLR_RANGE_7_Enabled (0x1UL) /*!< The address range that address range comparator pair n defines, is selected. */

/* Bit 6 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. 
        Each field represents an address range comparator pair, so field[6] controls the selection of address range comparator pair 6. */
#define ETM_TRCBBCTLR_RANGE_6_Pos (6UL) /*!< Position of RANGE_6 field. */
#define ETM_TRCBBCTLR_RANGE_6_Msk (0x1UL << ETM_TRCBBCTLR_RANGE_6_Pos) /*!< Bit mask of RANGE_6 field. */
#define ETM_TRCBBCTLR_RANGE_6_Disabled (0x0UL) /*!< The address range that address range comparator pair 6 defines, is not selected. */
#define ETM_TRCBBCTLR_RANGE_6_Enabled (0x1UL) /*!< The address range that address range comparator pair n defines, is selected. */

/* Bit 5 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. 
        Each field represents an address range comparator pair, so field[5] controls the selection of address range comparator pair 5. */
#define ETM_TRCBBCTLR_RANGE_5_Pos (5UL) /*!< Position of RANGE_5 field. */
#define ETM_TRCBBCTLR_RANGE_5_Msk (0x1UL << ETM_TRCBBCTLR_RANGE_5_Pos) /*!< Bit mask of RANGE_5 field. */
#define ETM_TRCBBCTLR_RANGE_5_Disabled (0x0UL) /*!< The address range that address range comparator pair 5 defines, is not selected. */
#define ETM_TRCBBCTLR_RANGE_5_Enabled (0x1UL) /*!< The address range that address range comparator pair n defines, is selected. */

/* Bit 4 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. 
        Each field represents an address range comparator pair, so field[4] controls the selection of address range comparator pair 4. */
#define ETM_TRCBBCTLR_RANGE_4_Pos (4UL) /*!< Position of RANGE_4 field. */
#define ETM_TRCBBCTLR_RANGE_4_Msk (0x1UL << ETM_TRCBBCTLR_RANGE_4_Pos) /*!< Bit mask of RANGE_4 field. */
#define ETM_TRCBBCTLR_RANGE_4_Disabled (0x0UL) /*!< The address range that address range comparator pair 4 defines, is not selected. */
#define ETM_TRCBBCTLR_RANGE_4_Enabled (0x1UL) /*!< The address range that address range comparator pair n defines, is selected. */

/* Bit 3 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. 
        Each field represents an address range comparator pair, so field[3] controls the selection of address range comparator pair 3. */
#define ETM_TRCBBCTLR_RANGE_3_Pos (3UL) /*!< Position of RANGE_3 field. */
#define ETM_TRCBBCTLR_RANGE_3_Msk (0x1UL << ETM_TRCBBCTLR_RANGE_3_Pos) /*!< Bit mask of RANGE_3 field. */
#define ETM_TRCBBCTLR_RANGE_3_Disabled (0x0UL) /*!< The address range that address range comparator pair 3 defines, is not selected. */
#define ETM_TRCBBCTLR_RANGE_3_Enabled (0x1UL) /*!< The address range that address range comparator pair n defines, is selected. */

/* Bit 2 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. 
        Each field represents an address range comparator pair, so field[2] controls the selection of address range comparator pair 2. */
#define ETM_TRCBBCTLR_RANGE_2_Pos (2UL) /*!< Position of RANGE_2 field. */
#define ETM_TRCBBCTLR_RANGE_2_Msk (0x1UL << ETM_TRCBBCTLR_RANGE_2_Pos) /*!< Bit mask of RANGE_2 field. */
#define ETM_TRCBBCTLR_RANGE_2_Disabled (0x0UL) /*!< The address range that address range comparator pair 2 defines, is not selected. */
#define ETM_TRCBBCTLR_RANGE_2_Enabled (0x1UL) /*!< The address range that address range comparator pair n defines, is selected. */

/* Bit 1 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. 
        Each field represents an address range comparator pair, so field[1] controls the selection of address range comparator pair 1. */
#define ETM_TRCBBCTLR_RANGE_1_Pos (1UL) /*!< Position of RANGE_1 field. */
#define ETM_TRCBBCTLR_RANGE_1_Msk (0x1UL << ETM_TRCBBCTLR_RANGE_1_Pos) /*!< Bit mask of RANGE_1 field. */
#define ETM_TRCBBCTLR_RANGE_1_Disabled (0x0UL) /*!< The address range that address range comparator pair 1 defines, is not selected. */
#define ETM_TRCBBCTLR_RANGE_1_Enabled (0x1UL) /*!< The address range that address range comparator pair n defines, is selected. */

/* Bit 0 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. 
        Each field represents an address range comparator pair, so field[0] controls the selection of address range comparator pair 0. */
#define ETM_TRCBBCTLR_RANGE_0_Pos (0UL) /*!< Position of RANGE_0 field. */
#define ETM_TRCBBCTLR_RANGE_0_Msk (0x1UL << ETM_TRCBBCTLR_RANGE_0_Pos) /*!< Bit mask of RANGE_0 field. */
#define ETM_TRCBBCTLR_RANGE_0_Disabled (0x0UL) /*!< The address range that address range comparator pair 0 defines, is not selected. */
#define ETM_TRCBBCTLR_RANGE_0_Enabled (0x1UL) /*!< The address range that address range comparator pair n defines, is selected. */

/* Register: ETM_TRCTRACEIDR */
/* Description: Sets the trace ID for instruction trace. If data trace is enabled then it also sets the trace ID for data trace, to (trace ID for instruction trace) + 1. This register must always be programmed as part of trace unit initialization. Might ignore writes when the trace unit is enabled or not idle. */

/* Bits 6..0 : Trace ID field. Sets the trace ID value for instruction trace. Bit[0] must be zero if data trace is enabled. If data trace is enabled then a trace unit sets the trace ID for data trace, to TRACEID+1. */
#define ETM_TRCTRACEIDR_TRACEID_Pos (0UL) /*!< Position of TRACEID field. */
#define ETM_TRCTRACEIDR_TRACEID_Msk (0x7FUL << ETM_TRCTRACEIDR_TRACEID_Pos) /*!< Bit mask of TRACEID field. */

/* Register: ETM_TRCQCTLR */
/* Description: Controls when Q elements are enabled. Might ignore writes when the trace unit is enabled or not idle. This register must be programmed if it is implemented and TRCCONFIGR.QE is set to any value other than 0b00. */

/* Bit 8 : Selects whether the address range comparators selected by the RANGE field indicate
address ranges where the trace unit is permitted to generate Q elements or address ranges
where the trace unit is not permitted to generate Q elements: */
#define ETM_TRCQCTLR_MODE_Pos (8UL) /*!< Position of MODE field. */
#define ETM_TRCQCTLR_MODE_Msk (0x1UL << ETM_TRCQCTLR_MODE_Pos) /*!< Bit mask of MODE field. */
#define ETM_TRCQCTLR_MODE_Exclude (0x0UL) /*!< Exclude mode. The address range comparators selected by the RANGE field
indicate address ranges where the trace unit cannot generate Q elements. If no
ranges are selected, Q elements are permitted across the entire memory map. */
#define ETM_TRCQCTLR_MODE_Include (0x1UL) /*!< Include mode. The address range comparators selected by the RANGE field
indicate address ranges where the trace unit can generate Q elements. If all the
implemented bits in RANGE are set to 0 then Q elements are disabled. */

/* Bit 7 : Specifies the address range comparators to be used for controlling Q elements. */
#define ETM_TRCQCTLR_RANGE_7_Pos (7UL) /*!< Position of RANGE_7 field. */
#define ETM_TRCQCTLR_RANGE_7_Msk (0x1UL << ETM_TRCQCTLR_RANGE_7_Pos) /*!< Bit mask of RANGE_7 field. */
#define ETM_TRCQCTLR_RANGE_7_Disabled (0x0UL) /*!< Address range comparator 7 is disabled. */
#define ETM_TRCQCTLR_RANGE_7_Enabled (0x1UL) /*!< Address range comparator 7 is selected for use. */

/* Bit 6 : Specifies the address range comparators to be used for controlling Q elements. */
#define ETM_TRCQCTLR_RANGE_6_Pos (6UL) /*!< Position of RANGE_6 field. */
#define ETM_TRCQCTLR_RANGE_6_Msk (0x1UL << ETM_TRCQCTLR_RANGE_6_Pos) /*!< Bit mask of RANGE_6 field. */
#define ETM_TRCQCTLR_RANGE_6_Disabled (0x0UL) /*!< Address range comparator 6 is disabled. */
#define ETM_TRCQCTLR_RANGE_6_Enabled (0x1UL) /*!< Address range comparator 6 is selected for use. */

