NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 5 : Specifies the address range comparators to be used for controlling Q elements. */
#define ETM_TRCQCTLR_RANGE_5_Pos (5UL) /*!< Position of RANGE_5 field. */
#define ETM_TRCQCTLR_RANGE_5_Msk (0x1UL << ETM_TRCQCTLR_RANGE_5_Pos) /*!< Bit mask of RANGE_5 field. */
#define ETM_TRCQCTLR_RANGE_5_Disabled (0x0UL) /*!< Address range comparator 5 is disabled. */
#define ETM_TRCQCTLR_RANGE_5_Enabled (0x1UL) /*!< Address range comparator 5 is selected for use. */

/* Bit 4 : Specifies the address range comparators to be used for controlling Q elements. */
#define ETM_TRCQCTLR_RANGE_4_Pos (4UL) /*!< Position of RANGE_4 field. */
#define ETM_TRCQCTLR_RANGE_4_Msk (0x1UL << ETM_TRCQCTLR_RANGE_4_Pos) /*!< Bit mask of RANGE_4 field. */
#define ETM_TRCQCTLR_RANGE_4_Disabled (0x0UL) /*!< Address range comparator 4 is disabled. */
#define ETM_TRCQCTLR_RANGE_4_Enabled (0x1UL) /*!< Address range comparator 4 is selected for use. */

/* Bit 3 : Specifies the address range comparators to be used for controlling Q elements. */
#define ETM_TRCQCTLR_RANGE_3_Pos (3UL) /*!< Position of RANGE_3 field. */
#define ETM_TRCQCTLR_RANGE_3_Msk (0x1UL << ETM_TRCQCTLR_RANGE_3_Pos) /*!< Bit mask of RANGE_3 field. */
#define ETM_TRCQCTLR_RANGE_3_Disabled (0x0UL) /*!< Address range comparator 3 is disabled. */
#define ETM_TRCQCTLR_RANGE_3_Enabled (0x1UL) /*!< Address range comparator 3 is selected for use. */

/* Bit 2 : Specifies the address range comparators to be used for controlling Q elements. */
#define ETM_TRCQCTLR_RANGE_2_Pos (2UL) /*!< Position of RANGE_2 field. */
#define ETM_TRCQCTLR_RANGE_2_Msk (0x1UL << ETM_TRCQCTLR_RANGE_2_Pos) /*!< Bit mask of RANGE_2 field. */
#define ETM_TRCQCTLR_RANGE_2_Disabled (0x0UL) /*!< Address range comparator 2 is disabled. */
#define ETM_TRCQCTLR_RANGE_2_Enabled (0x1UL) /*!< Address range comparator 2 is selected for use. */

/* Bit 1 : Specifies the address range comparators to be used for controlling Q elements. */
#define ETM_TRCQCTLR_RANGE_1_Pos (1UL) /*!< Position of RANGE_1 field. */
#define ETM_TRCQCTLR_RANGE_1_Msk (0x1UL << ETM_TRCQCTLR_RANGE_1_Pos) /*!< Bit mask of RANGE_1 field. */
#define ETM_TRCQCTLR_RANGE_1_Disabled (0x0UL) /*!< Address range comparator 1 is disabled. */
#define ETM_TRCQCTLR_RANGE_1_Enabled (0x1UL) /*!< Address range comparator 1 is selected for use. */

/* Bit 0 : Specifies the address range comparators to be used for controlling Q elements. */
#define ETM_TRCQCTLR_RANGE_0_Pos (0UL) /*!< Position of RANGE_0 field. */
#define ETM_TRCQCTLR_RANGE_0_Msk (0x1UL << ETM_TRCQCTLR_RANGE_0_Pos) /*!< Bit mask of RANGE_0 field. */
#define ETM_TRCQCTLR_RANGE_0_Disabled (0x0UL) /*!< Address range comparator 0 is disabled. */
#define ETM_TRCQCTLR_RANGE_0_Enabled (0x1UL) /*!< Address range comparator 0 is selected for use. */

/* Register: ETM_TRCVICTLR */
/* Description: Controls instruction trace filtering. Might ignore writes when the trace unit is enabled or not idle. Only returns stable data when TRCSTATR.PMSTABLE == 1. Must be programmed, particularly to set the value of the SSSTATUS bit, which sets the state of the start/stop logic. */

/* Bit 23 : In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 3. */
#define ETM_TRCVICTLR_EXLEVEL3_NS_Pos (23UL) /*!< Position of EXLEVEL3_NS field. */
#define ETM_TRCVICTLR_EXLEVEL3_NS_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL3_NS_Pos) /*!< Bit mask of EXLEVEL3_NS field. */
#define ETM_TRCVICTLR_EXLEVEL3_NS_Enabled (0x0UL) /*!< The trace unit generates instruction trace, in Non-secure state, for Exception level 3. */
#define ETM_TRCVICTLR_EXLEVEL3_NS_Disabled (0x1UL) /*!< The trace unit does not generate instruction trace, in Non-secure state, for Exception level 3. */

/* Bit 22 : In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 2. */
#define ETM_TRCVICTLR_EXLEVEL2_NS_Pos (22UL) /*!< Position of EXLEVEL2_NS field. */
#define ETM_TRCVICTLR_EXLEVEL2_NS_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL2_NS_Pos) /*!< Bit mask of EXLEVEL2_NS field. */
#define ETM_TRCVICTLR_EXLEVEL2_NS_Enabled (0x0UL) /*!< The trace unit generates instruction trace, in Non-secure state, for Exception level 2. */
#define ETM_TRCVICTLR_EXLEVEL2_NS_Disabled (0x1UL) /*!< The trace unit does not generate instruction trace, in Non-secure state, for Exception level 2. */

/* Bit 21 : In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 1. */
#define ETM_TRCVICTLR_EXLEVEL1_NS_Pos (21UL) /*!< Position of EXLEVEL1_NS field. */
#define ETM_TRCVICTLR_EXLEVEL1_NS_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL1_NS_Pos) /*!< Bit mask of EXLEVEL1_NS field. */
#define ETM_TRCVICTLR_EXLEVEL1_NS_Enabled (0x0UL) /*!< The trace unit generates instruction trace, in Non-secure state, for Exception level 1. */
#define ETM_TRCVICTLR_EXLEVEL1_NS_Disabled (0x1UL) /*!< The trace unit does not generate instruction trace, in Non-secure state, for Exception level 1. */

/* Bit 20 : In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 0. */
#define ETM_TRCVICTLR_EXLEVEL0_NS_Pos (20UL) /*!< Position of EXLEVEL0_NS field. */
#define ETM_TRCVICTLR_EXLEVEL0_NS_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL0_NS_Pos) /*!< Bit mask of EXLEVEL0_NS field. */
#define ETM_TRCVICTLR_EXLEVEL0_NS_Enabled (0x0UL) /*!< The trace unit generates instruction trace, in Non-secure state, for Exception level 0. */
#define ETM_TRCVICTLR_EXLEVEL0_NS_Disabled (0x1UL) /*!< The trace unit does not generate instruction trace, in Non-secure state, for Exception level 0. */

/* Bit 19 : In Secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 3. */
#define ETM_TRCVICTLR_EXLEVEL3_S_Pos (19UL) /*!< Position of EXLEVEL3_S field. */
#define ETM_TRCVICTLR_EXLEVEL3_S_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL3_S_Pos) /*!< Bit mask of EXLEVEL3_S field. */
#define ETM_TRCVICTLR_EXLEVEL3_S_Enabled (0x0UL) /*!< The trace unit generates instruction trace, in Secure state, for Exception level 3. */
#define ETM_TRCVICTLR_EXLEVEL3_S_Disabled (0x1UL) /*!< The trace unit does not generate instruction trace, in Secure state, for Exception level 3. */

/* Bit 18 : In Secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 2. */
#define ETM_TRCVICTLR_EXLEVEL2_S_Pos (18UL) /*!< Position of EXLEVEL2_S field. */
#define ETM_TRCVICTLR_EXLEVEL2_S_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL2_S_Pos) /*!< Bit mask of EXLEVEL2_S field. */
#define ETM_TRCVICTLR_EXLEVEL2_S_Enabled (0x0UL) /*!< The trace unit generates instruction trace, in Secure state, for Exception level 2. */
#define ETM_TRCVICTLR_EXLEVEL2_S_Disabled (0x1UL) /*!< The trace unit does not generate instruction trace, in Secure state, for Exception level 2. */

/* Bit 17 : In Secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 1. */
#define ETM_TRCVICTLR_EXLEVEL1_S_Pos (17UL) /*!< Position of EXLEVEL1_S field. */
#define ETM_TRCVICTLR_EXLEVEL1_S_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL1_S_Pos) /*!< Bit mask of EXLEVEL1_S field. */
#define ETM_TRCVICTLR_EXLEVEL1_S_Enabled (0x0UL) /*!< The trace unit generates instruction trace, in Secure state, for Exception level 1. */
#define ETM_TRCVICTLR_EXLEVEL1_S_Disabled (0x1UL) /*!< The trace unit does not generate instruction trace, in Secure state, for Exception level 1. */

/* Bit 16 : In Secure state, each bit controls whether instruction tracing is enabled for the corresponding Exception level 0. */
#define ETM_TRCVICTLR_EXLEVEL0_S_Pos (16UL) /*!< Position of EXLEVEL0_S field. */
#define ETM_TRCVICTLR_EXLEVEL0_S_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL0_S_Pos) /*!< Bit mask of EXLEVEL0_S field. */
#define ETM_TRCVICTLR_EXLEVEL0_S_Enabled (0x0UL) /*!< The trace unit generates instruction trace, in Secure state, for Exception level 0. */
#define ETM_TRCVICTLR_EXLEVEL0_S_Disabled (0x1UL) /*!< The trace unit does not generate instruction trace, in Secure state, for Exception level 0. */

