NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 11 : When TRCIDR3.TRCERR==1, this bit controls whether a trace unit must trace a System error exception. */
#define ETM_TRCVICTLR_TRCERR_Pos (11UL) /*!< Position of TRCERR field. */
#define ETM_TRCVICTLR_TRCERR_Msk (0x1UL << ETM_TRCVICTLR_TRCERR_Pos) /*!< Bit mask of TRCERR field. */
#define ETM_TRCVICTLR_TRCERR_Disabled (0x0UL) /*!< The trace unit does not trace a System error exception unless it traces the exception or instruction immediately prior to the System error exception. */
#define ETM_TRCVICTLR_TRCERR_Enabled (0x1UL) /*!< The trace unit always traces a System error exception, regardless of the value of ViewInst. */

/* Bit 10 : Controls whether a trace unit must trace a Reset exception. */
#define ETM_TRCVICTLR_TRCRESET_Pos (10UL) /*!< Position of TRCRESET field. */
#define ETM_TRCVICTLR_TRCRESET_Msk (0x1UL << ETM_TRCVICTLR_TRCRESET_Pos) /*!< Bit mask of TRCRESET field. */
#define ETM_TRCVICTLR_TRCRESET_Disabled (0x0UL) /*!< The trace unit does not trace a Reset exception unless it traces the exception or instruction immediately prior to the Reset exception. */
#define ETM_TRCVICTLR_TRCRESET_Enabled (0x1UL) /*!< The trace unit always traces a Reset exception. */

/* Bit 9 : When TRCIDR4.NUMACPAIRS &gt; 0 or TRCIDR4.NUMPC &gt; 0, this bit returns the status of the start/stop logic. */
#define ETM_TRCVICTLR_SSSTATUS_Pos (9UL) /*!< Position of SSSTATUS field. */
#define ETM_TRCVICTLR_SSSTATUS_Msk (0x1UL << ETM_TRCVICTLR_SSSTATUS_Pos) /*!< Bit mask of SSSTATUS field. */
#define ETM_TRCVICTLR_SSSTATUS_Stopped (0x0UL) /*!< The start/stop logic is in the stopped state. */
#define ETM_TRCVICTLR_SSSTATUS_Started (0x1UL) /*!< The start/stop logic is in the started state. */

/* Bits 4..0 : Select which resource number should be filtered. */
#define ETM_TRCVICTLR_EVENT_SEL_Pos (0UL) /*!< Position of EVENT_SEL field. */
#define ETM_TRCVICTLR_EVENT_SEL_Msk (0x1FUL << ETM_TRCVICTLR_EVENT_SEL_Pos) /*!< Bit mask of EVENT_SEL field. */
#define ETM_TRCVICTLR_EVENT_SEL_Disabled (0x00UL) /*!< This event is not filtered. */
#define ETM_TRCVICTLR_EVENT_SEL_Enabled (0x01UL) /*!< This event is filtered. */

/* Register: ETM_TRCVIIECTLR */
/* Description: ViewInst exclude control. Might ignore writes when the trace unit is enabled or not idle. This register must be programmed when one or more address comparators are implemented. */

/* Bit 23 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude control. */
#define ETM_TRCVIIECTLR_EXCLUDE_7_Pos (23UL) /*!< Position of EXCLUDE_7 field. */
#define ETM_TRCVIIECTLR_EXCLUDE_7_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE_7_Pos) /*!< Bit mask of EXCLUDE_7 field. */
#define ETM_TRCVIIECTLR_EXCLUDE_7_Disabled (0x0UL) /*!< The address range that address range comparator pair 7 defines, is not selected for ViewInst exclude control. */
#define ETM_TRCVIIECTLR_EXCLUDE_7_Enabled (0x1UL) /*!< The address range that address range comparator pair 7 defines, is selected for ViewInst exclude control. */

/* Bit 22 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude control. */
#define ETM_TRCVIIECTLR_EXCLUDE_6_Pos (22UL) /*!< Position of EXCLUDE_6 field. */
#define ETM_TRCVIIECTLR_EXCLUDE_6_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE_6_Pos) /*!< Bit mask of EXCLUDE_6 field. */
#define ETM_TRCVIIECTLR_EXCLUDE_6_Disabled (0x0UL) /*!< The address range that address range comparator pair 6 defines, is not selected for ViewInst exclude control. */
#define ETM_TRCVIIECTLR_EXCLUDE_6_Enabled (0x1UL) /*!< The address range that address range comparator pair 6 defines, is selected for ViewInst exclude control. */

/* Bit 21 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude control. */
#define ETM_TRCVIIECTLR_EXCLUDE_5_Pos (21UL) /*!< Position of EXCLUDE_5 field. */
#define ETM_TRCVIIECTLR_EXCLUDE_5_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE_5_Pos) /*!< Bit mask of EXCLUDE_5 field. */
#define ETM_TRCVIIECTLR_EXCLUDE_5_Disabled (0x0UL) /*!< The address range that address range comparator pair 5 defines, is not selected for ViewInst exclude control. */
#define ETM_TRCVIIECTLR_EXCLUDE_5_Enabled (0x1UL) /*!< The address range that address range comparator pair 5 defines, is selected for ViewInst exclude control. */

/* Bit 20 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude control. */
#define ETM_TRCVIIECTLR_EXCLUDE_4_Pos (20UL) /*!< Position of EXCLUDE_4 field. */
#define ETM_TRCVIIECTLR_EXCLUDE_4_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE_4_Pos) /*!< Bit mask of EXCLUDE_4 field. */
#define ETM_TRCVIIECTLR_EXCLUDE_4_Disabled (0x0UL) /*!< The address range that address range comparator pair 4 defines, is not selected for ViewInst exclude control. */
#define ETM_TRCVIIECTLR_EXCLUDE_4_Enabled (0x1UL) /*!< The address range that address range comparator pair 4 defines, is selected for ViewInst exclude control. */

/* Bit 19 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude control. */
#define ETM_TRCVIIECTLR_EXCLUDE_3_Pos (19UL) /*!< Position of EXCLUDE_3 field. */
#define ETM_TRCVIIECTLR_EXCLUDE_3_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE_3_Pos) /*!< Bit mask of EXCLUDE_3 field. */
#define ETM_TRCVIIECTLR_EXCLUDE_3_Disabled (0x0UL) /*!< The address range that address range comparator pair 3 defines, is not selected for ViewInst exclude control. */
#define ETM_TRCVIIECTLR_EXCLUDE_3_Enabled (0x1UL) /*!< The address range that address range comparator pair 3 defines, is selected for ViewInst exclude control. */

/* Bit 18 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude control. */
#define ETM_TRCVIIECTLR_EXCLUDE_2_Pos (18UL) /*!< Position of EXCLUDE_2 field. */
#define ETM_TRCVIIECTLR_EXCLUDE_2_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE_2_Pos) /*!< Bit mask of EXCLUDE_2 field. */
#define ETM_TRCVIIECTLR_EXCLUDE_2_Disabled (0x0UL) /*!< The address range that address range comparator pair 2 defines, is not selected for ViewInst exclude control. */
#define ETM_TRCVIIECTLR_EXCLUDE_2_Enabled (0x1UL) /*!< The address range that address range comparator pair 2 defines, is selected for ViewInst exclude control. */

/* Bit 17 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude control. */
#define ETM_TRCVIIECTLR_EXCLUDE_1_Pos (17UL) /*!< Position of EXCLUDE_1 field. */
#define ETM_TRCVIIECTLR_EXCLUDE_1_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE_1_Pos) /*!< Bit mask of EXCLUDE_1 field. */
#define ETM_TRCVIIECTLR_EXCLUDE_1_Disabled (0x0UL) /*!< The address range that address range comparator pair 1 defines, is not selected for ViewInst exclude control. */
#define ETM_TRCVIIECTLR_EXCLUDE_1_Enabled (0x1UL) /*!< The address range that address range comparator pair 1 defines, is selected for ViewInst exclude control. */

/* Bit 16 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude control. */
#define ETM_TRCVIIECTLR_EXCLUDE_0_Pos (16UL) /*!< Position of EXCLUDE_0 field. */
#define ETM_TRCVIIECTLR_EXCLUDE_0_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE_0_Pos) /*!< Bit mask of EXCLUDE_0 field. */
#define ETM_TRCVIIECTLR_EXCLUDE_0_Disabled (0x0UL) /*!< The address range that address range comparator pair 0 defines, is not selected for ViewInst exclude control. */
#define ETM_TRCVIIECTLR_EXCLUDE_0_Enabled (0x1UL) /*!< The address range that address range comparator pair 0 defines, is selected for ViewInst exclude control. */

/* Bit 7 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control. */
#define ETM_TRCVIIECTLR_INCLUDE_7_Pos (7UL) /*!< Position of INCLUDE_7 field. */
#define ETM_TRCVIIECTLR_INCLUDE_7_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE_7_Pos) /*!< Bit mask of INCLUDE_7 field. */
#define ETM_TRCVIIECTLR_INCLUDE_7_Disabled (0x0UL) /*!< The address range that address range comparator pair 7 defines, is not selected for ViewInst include control. */
#define ETM_TRCVIIECTLR_INCLUDE_7_Enabled (0x1UL) /*!< The address range that address range comparator pair 7 defines, is selected for ViewInst include control. */

/* Bit 6 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control. */
#define ETM_TRCVIIECTLR_INCLUDE_6_Pos (6UL) /*!< Position of INCLUDE_6 field. */
#define ETM_TRCVIIECTLR_INCLUDE_6_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE_6_Pos) /*!< Bit mask of INCLUDE_6 field. */
#define ETM_TRCVIIECTLR_INCLUDE_6_Disabled (0x0UL) /*!< The address range that address range comparator pair 6 defines, is not selected for ViewInst include control. */
#define ETM_TRCVIIECTLR_INCLUDE_6_Enabled (0x1UL) /*!< The address range that address range comparator pair 6 defines, is selected for ViewInst include control. */

/* Bit 5 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control. */
#define ETM_TRCVIIECTLR_INCLUDE_5_Pos (5UL) /*!< Position of INCLUDE_5 field. */
#define ETM_TRCVIIECTLR_INCLUDE_5_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE_5_Pos) /*!< Bit mask of INCLUDE_5 field. */
#define ETM_TRCVIIECTLR_INCLUDE_5_Disabled (0x0UL) /*!< The address range that address range comparator pair 5 defines, is not selected for ViewInst include control. */
#define ETM_TRCVIIECTLR_INCLUDE_5_Enabled (0x1UL) /*!< The address range that address range comparator pair 5 defines, is selected for ViewInst include control. */

/* Bit 4 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control. */
#define ETM_TRCVIIECTLR_INCLUDE_4_Pos (4UL) /*!< Position of INCLUDE_4 field. */
#define ETM_TRCVIIECTLR_INCLUDE_4_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE_4_Pos) /*!< Bit mask of INCLUDE_4 field. */
#define ETM_TRCVIIECTLR_INCLUDE_4_Disabled (0x0UL) /*!< The address range that address range comparator pair 4 defines, is not selected for ViewInst include control. */
#define ETM_TRCVIIECTLR_INCLUDE_4_Enabled (0x1UL) /*!< The address range that address range comparator pair 4 defines, is selected for ViewInst include control. */

/* Bit 3 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control. */
#define ETM_TRCVIIECTLR_INCLUDE_3_Pos (3UL) /*!< Position of INCLUDE_3 field. */
#define ETM_TRCVIIECTLR_INCLUDE_3_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE_3_Pos) /*!< Bit mask of INCLUDE_3 field. */
#define ETM_TRCVIIECTLR_INCLUDE_3_Disabled (0x0UL) /*!< The address range that address range comparator pair 3 defines, is not selected for ViewInst include control. */
#define ETM_TRCVIIECTLR_INCLUDE_3_Enabled (0x1UL) /*!< The address range that address range comparator pair 3 defines, is selected for ViewInst include control. */

/* Bit 2 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control. */
#define ETM_TRCVIIECTLR_INCLUDE_2_Pos (2UL) /*!< Position of INCLUDE_2 field. */
#define ETM_TRCVIIECTLR_INCLUDE_2_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE_2_Pos) /*!< Bit mask of INCLUDE_2 field. */
#define ETM_TRCVIIECTLR_INCLUDE_2_Disabled (0x0UL) /*!< The address range that address range comparator pair 2 defines, is not selected for ViewInst include control. */
#define ETM_TRCVIIECTLR_INCLUDE_2_Enabled (0x1UL) /*!< The address range that address range comparator pair 2 defines, is selected for ViewInst include control. */

/* Bit 1 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control. */
#define ETM_TRCVIIECTLR_INCLUDE_1_Pos (1UL) /*!< Position of INCLUDE_1 field. */
#define ETM_TRCVIIECTLR_INCLUDE_1_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE_1_Pos) /*!< Bit mask of INCLUDE_1 field. */
#define ETM_TRCVIIECTLR_INCLUDE_1_Disabled (0x0UL) /*!< The address range that address range comparator pair 1 defines, is not selected for ViewInst include control. */
#define ETM_TRCVIIECTLR_INCLUDE_1_Enabled (0x1UL) /*!< The address range that address range comparator pair 1 defines, is selected for ViewInst include control. */

/* Bit 0 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control. */
#define ETM_TRCVIIECTLR_INCLUDE_0_Pos (0UL) /*!< Position of INCLUDE_0 field. */
#define ETM_TRCVIIECTLR_INCLUDE_0_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE_0_Pos) /*!< Bit mask of INCLUDE_0 field. */
#define ETM_TRCVIIECTLR_INCLUDE_0_Disabled (0x0UL) /*!< The address range that address range comparator pair 0 defines, is not selected for ViewInst include control. */
#define ETM_TRCVIIECTLR_INCLUDE_0_Enabled (0x1UL) /*!< The address range that address range comparator pair 0 defines, is selected for ViewInst include control. */

/* Register: ETM_TRCVISSCTLR */
/* Description: Use this to set, or read, the single address comparators that control the ViewInst start/stop
logic. The start/stop logic is active for an instruction which causes a start and remains active
up to and including an instruction which causes a stop, and then the start/stop logic becomes
inactive. Might ignore writes when the trace unit is enabled or not idle. If implemented then this register must be programmed. */

/* Bit 23 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of stopping trace */
#define ETM_TRCVISSCTLR_STOP_7_Pos (23UL) /*!< Position of STOP_7 field. */
#define ETM_TRCVISSCTLR_STOP_7_Msk (0x1UL << ETM_TRCVISSCTLR_STOP_7_Pos) /*!< Bit mask of STOP_7 field. */
#define ETM_TRCVISSCTLR_STOP_7_Disabled (0x0UL) /*!< The single address comparator 7, is not selected as a stop resource. */
#define ETM_TRCVISSCTLR_STOP_7_Enabled (0x1UL) /*!< The single address comparator 7, is selected as a stop resource. */

/* Bit 22 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of stopping trace */
#define ETM_TRCVISSCTLR_STOP_6_Pos (22UL) /*!< Position of STOP_6 field. */
#define ETM_TRCVISSCTLR_STOP_6_Msk (0x1UL << ETM_TRCVISSCTLR_STOP_6_Pos) /*!< Bit mask of STOP_6 field. */
#define ETM_TRCVISSCTLR_STOP_6_Disabled (0x0UL) /*!< The single address comparator 6, is not selected as a stop resource. */
#define ETM_TRCVISSCTLR_STOP_6_Enabled (0x1UL) /*!< The single address comparator 6, is selected as a stop resource. */

/* Bit 21 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of stopping trace */
#define ETM_TRCVISSCTLR_STOP_5_Pos (21UL) /*!< Position of STOP_5 field. */
#define ETM_TRCVISSCTLR_STOP_5_Msk (0x1UL << ETM_TRCVISSCTLR_STOP_5_Pos) /*!< Bit mask of STOP_5 field. */
#define ETM_TRCVISSCTLR_STOP_5_Disabled (0x0UL) /*!< The single address comparator 5, is not selected as a stop resource. */
#define ETM_TRCVISSCTLR_STOP_5_Enabled (0x1UL) /*!< The single address comparator 5, is selected as a stop resource. */

