NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 0 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of starting trace. */
#define ETM_TRCVISSCTLR_START_0_Pos (0UL) /*!< Position of START_0 field. */
#define ETM_TRCVISSCTLR_START_0_Msk (0x1UL << ETM_TRCVISSCTLR_START_0_Pos) /*!< Bit mask of START_0 field. */
#define ETM_TRCVISSCTLR_START_0_Disabled (0x0UL) /*!< The single address comparator 0, is not selected as a start resource. */
#define ETM_TRCVISSCTLR_START_0_Enabled (0x1UL) /*!< The single address comparator 0, is selected as a start resource. */

/* Register: ETM_TRCVIPCSSCTLR */
/* Description: Use this to set, or read, which PE comparator inputs can control the ViewInst start/stop logic. Might ignore writes when the trace unit is enabled or not idle. If implemented then this register must be programmed. */

/* Bit 23 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping trace. */
#define ETM_TRCVIPCSSCTLR_STOP_7_Pos (23UL) /*!< Position of STOP_7 field. */
#define ETM_TRCVIPCSSCTLR_STOP_7_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP_7_Pos) /*!< Bit mask of STOP_7 field. */
#define ETM_TRCVIPCSSCTLR_STOP_7_Disabled (0x0UL) /*!< The single PE comparator input 7, is not selected as a stop resource. */
#define ETM_TRCVIPCSSCTLR_STOP_7_Enabled (0x1UL) /*!< The single PE comparator input 7, is selected as a stop resource. */

/* Bit 22 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping trace. */
#define ETM_TRCVIPCSSCTLR_STOP_6_Pos (22UL) /*!< Position of STOP_6 field. */
#define ETM_TRCVIPCSSCTLR_STOP_6_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP_6_Pos) /*!< Bit mask of STOP_6 field. */
#define ETM_TRCVIPCSSCTLR_STOP_6_Disabled (0x0UL) /*!< The single PE comparator input 6, is not selected as a stop resource. */
#define ETM_TRCVIPCSSCTLR_STOP_6_Enabled (0x1UL) /*!< The single PE comparator input 6, is selected as a stop resource. */

/* Bit 21 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping trace. */
#define ETM_TRCVIPCSSCTLR_STOP_5_Pos (21UL) /*!< Position of STOP_5 field. */
#define ETM_TRCVIPCSSCTLR_STOP_5_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP_5_Pos) /*!< Bit mask of STOP_5 field. */
#define ETM_TRCVIPCSSCTLR_STOP_5_Disabled (0x0UL) /*!< The single PE comparator input 5, is not selected as a stop resource. */
#define ETM_TRCVIPCSSCTLR_STOP_5_Enabled (0x1UL) /*!< The single PE comparator input 5, is selected as a stop resource. */

/* Bit 20 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping trace. */
#define ETM_TRCVIPCSSCTLR_STOP_4_Pos (20UL) /*!< Position of STOP_4 field. */
#define ETM_TRCVIPCSSCTLR_STOP_4_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP_4_Pos) /*!< Bit mask of STOP_4 field. */
#define ETM_TRCVIPCSSCTLR_STOP_4_Disabled (0x0UL) /*!< The single PE comparator input 4, is not selected as a stop resource. */
#define ETM_TRCVIPCSSCTLR_STOP_4_Enabled (0x1UL) /*!< The single PE comparator input 4, is selected as a stop resource. */

/* Bit 19 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping trace. */
#define ETM_TRCVIPCSSCTLR_STOP_3_Pos (19UL) /*!< Position of STOP_3 field. */
#define ETM_TRCVIPCSSCTLR_STOP_3_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP_3_Pos) /*!< Bit mask of STOP_3 field. */
#define ETM_TRCVIPCSSCTLR_STOP_3_Disabled (0x0UL) /*!< The single PE comparator input 3, is not selected as a stop resource. */
#define ETM_TRCVIPCSSCTLR_STOP_3_Enabled (0x1UL) /*!< The single PE comparator input 3, is selected as a stop resource. */

/* Bit 18 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping trace. */
#define ETM_TRCVIPCSSCTLR_STOP_2_Pos (18UL) /*!< Position of STOP_2 field. */
#define ETM_TRCVIPCSSCTLR_STOP_2_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP_2_Pos) /*!< Bit mask of STOP_2 field. */
#define ETM_TRCVIPCSSCTLR_STOP_2_Disabled (0x0UL) /*!< The single PE comparator input 2, is not selected as a stop resource. */
#define ETM_TRCVIPCSSCTLR_STOP_2_Enabled (0x1UL) /*!< The single PE comparator input 2, is selected as a stop resource. */

/* Bit 17 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping trace. */
#define ETM_TRCVIPCSSCTLR_STOP_1_Pos (17UL) /*!< Position of STOP_1 field. */
#define ETM_TRCVIPCSSCTLR_STOP_1_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP_1_Pos) /*!< Bit mask of STOP_1 field. */
#define ETM_TRCVIPCSSCTLR_STOP_1_Disabled (0x0UL) /*!< The single PE comparator input 1, is not selected as a stop resource. */
#define ETM_TRCVIPCSSCTLR_STOP_1_Enabled (0x1UL) /*!< The single PE comparator input 1, is selected as a stop resource. */

/* Bit 16 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping trace. */
#define ETM_TRCVIPCSSCTLR_STOP_0_Pos (16UL) /*!< Position of STOP_0 field. */
#define ETM_TRCVIPCSSCTLR_STOP_0_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP_0_Pos) /*!< Bit mask of STOP_0 field. */
#define ETM_TRCVIPCSSCTLR_STOP_0_Disabled (0x0UL) /*!< The single PE comparator input 0, is not selected as a stop resource. */
#define ETM_TRCVIPCSSCTLR_STOP_0_Enabled (0x1UL) /*!< The single PE comparator input 0, is selected as a stop resource. */

/* Bit 7 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting trace */
#define ETM_TRCVIPCSSCTLR_START_7_Pos (7UL) /*!< Position of START_7 field. */
#define ETM_TRCVIPCSSCTLR_START_7_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START_7_Pos) /*!< Bit mask of START_7 field. */
#define ETM_TRCVIPCSSCTLR_START_7_Disabled (0x0UL) /*!< The single PE comparator input 7, is not selected as a start resource. */
#define ETM_TRCVIPCSSCTLR_START_7_Enabled (0x1UL) /*!< The single PE comparator input 7, is selected as a start resource. */

/* Bit 6 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting trace */
#define ETM_TRCVIPCSSCTLR_START_6_Pos (6UL) /*!< Position of START_6 field. */
#define ETM_TRCVIPCSSCTLR_START_6_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START_6_Pos) /*!< Bit mask of START_6 field. */
#define ETM_TRCVIPCSSCTLR_START_6_Disabled (0x0UL) /*!< The single PE comparator input 6, is not selected as a start resource. */
#define ETM_TRCVIPCSSCTLR_START_6_Enabled (0x1UL) /*!< The single PE comparator input 6, is selected as a start resource. */

/* Bit 5 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting trace */
#define ETM_TRCVIPCSSCTLR_START_5_Pos (5UL) /*!< Position of START_5 field. */
#define ETM_TRCVIPCSSCTLR_START_5_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START_5_Pos) /*!< Bit mask of START_5 field. */
#define ETM_TRCVIPCSSCTLR_START_5_Disabled (0x0UL) /*!< The single PE comparator input 5, is not selected as a start resource. */
#define ETM_TRCVIPCSSCTLR_START_5_Enabled (0x1UL) /*!< The single PE comparator input 5, is selected as a start resource. */

