NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 4 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting trace */
#define ETM_TRCVIPCSSCTLR_START_4_Pos (4UL) /*!< Position of START_4 field. */
#define ETM_TRCVIPCSSCTLR_START_4_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START_4_Pos) /*!< Bit mask of START_4 field. */
#define ETM_TRCVIPCSSCTLR_START_4_Disabled (0x0UL) /*!< The single PE comparator input 4, is not selected as a start resource. */
#define ETM_TRCVIPCSSCTLR_START_4_Enabled (0x1UL) /*!< The single PE comparator input 4, is selected as a start resource. */

/* Bit 3 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting trace */
#define ETM_TRCVIPCSSCTLR_START_3_Pos (3UL) /*!< Position of START_3 field. */
#define ETM_TRCVIPCSSCTLR_START_3_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START_3_Pos) /*!< Bit mask of START_3 field. */
#define ETM_TRCVIPCSSCTLR_START_3_Disabled (0x0UL) /*!< The single PE comparator input 3, is not selected as a start resource. */
#define ETM_TRCVIPCSSCTLR_START_3_Enabled (0x1UL) /*!< The single PE comparator input 3, is selected as a start resource. */

/* Bit 2 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting trace */
#define ETM_TRCVIPCSSCTLR_START_2_Pos (2UL) /*!< Position of START_2 field. */
#define ETM_TRCVIPCSSCTLR_START_2_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START_2_Pos) /*!< Bit mask of START_2 field. */
#define ETM_TRCVIPCSSCTLR_START_2_Disabled (0x0UL) /*!< The single PE comparator input 2, is not selected as a start resource. */
#define ETM_TRCVIPCSSCTLR_START_2_Enabled (0x1UL) /*!< The single PE comparator input 2, is selected as a start resource. */

/* Bit 1 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting trace */
#define ETM_TRCVIPCSSCTLR_START_1_Pos (1UL) /*!< Position of START_1 field. */
#define ETM_TRCVIPCSSCTLR_START_1_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START_1_Pos) /*!< Bit mask of START_1 field. */
#define ETM_TRCVIPCSSCTLR_START_1_Disabled (0x0UL) /*!< The single PE comparator input 1, is not selected as a start resource. */
#define ETM_TRCVIPCSSCTLR_START_1_Enabled (0x1UL) /*!< The single PE comparator input 1, is selected as a start resource. */

/* Bit 0 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting trace */
#define ETM_TRCVIPCSSCTLR_START_0_Pos (0UL) /*!< Position of START_0 field. */
#define ETM_TRCVIPCSSCTLR_START_0_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START_0_Pos) /*!< Bit mask of START_0 field. */
#define ETM_TRCVIPCSSCTLR_START_0_Disabled (0x0UL) /*!< The single PE comparator input 0, is not selected as a start resource. */
#define ETM_TRCVIPCSSCTLR_START_0_Enabled (0x1UL) /*!< The single PE comparator input 0, is selected as a start resource. */

/* Register: ETM_TRCVDCTLR */
/* Description: Controls data trace filtering. Might ignore writes when the trace unit is enabled or not idle. This register must be programmed when data tracing is enabled, that is, when either TRCCONFIGR.DA == 1 or TRCCONFIGR.DV == 1. */

/* Bit 12 : Controls the tracing of data transfers for exceptions and exception returns on Armv6-M, Armv7-M, and Armv8-M PEs. */
#define ETM_TRCVDCTLR_TRCEXDATA_Pos (12UL) /*!< Position of TRCEXDATA field. */
#define ETM_TRCVDCTLR_TRCEXDATA_Msk (0x1UL << ETM_TRCVDCTLR_TRCEXDATA_Pos) /*!< Bit mask of TRCEXDATA field. */
#define ETM_TRCVDCTLR_TRCEXDATA_Disabled (0x0UL) /*!< Exception and exception return data transfers are not traced. */
#define ETM_TRCVDCTLR_TRCEXDATA_Enabled (0x1UL) /*!< Exception and exception return data transfers are traced if the other aspects of ViewData indicate that the data transfers must be traced. */

/* Bit 11 : Controls which information a trace unit populates in bits[63:56] of the data address. */
#define ETM_TRCVDCTLR_TBI_Pos (11UL) /*!< Position of TBI field. */
#define ETM_TRCVDCTLR_TBI_Msk (0x1UL << ETM_TRCVDCTLR_TBI_Pos) /*!< Bit mask of TBI field. */
#define ETM_TRCVDCTLR_TBI_SignExtend (0x0UL) /*!< The trace unit assigns bits[63:56] to have the same value as bit[55] of the data address, that is, it sign-extends the value. */
#define ETM_TRCVDCTLR_TBI_Copy (0x1UL) /*!< The trace unit assigns bits[63:56] to have the same value as bits[63:56] of the data address. */

/* Bit 10 : Controls whether a trace unit traces data for transfers that are relative to the Program Counter (PC). */
#define ETM_TRCVDCTLR_PCREL_Pos (10UL) /*!< Position of PCREL field. */
#define ETM_TRCVDCTLR_PCREL_Msk (0x1UL << ETM_TRCVDCTLR_PCREL_Pos) /*!< Bit mask of PCREL field. */
#define ETM_TRCVDCTLR_PCREL_Enabled (0x0UL) /*!< The trace unit does not affect the tracing of PC-relative transfers. */
#define ETM_TRCVDCTLR_PCREL_Disabled (0x1UL) /*!< The trace unit does not trace the address or value portions of PC-relative transfers. */

/* Bits 9..8 : Controls whether a trace unit traces data for transfers that are relative to the Stack Pointer (SP). */
#define ETM_TRCVDCTLR_SPREL_Pos (8UL) /*!< Position of SPREL field. */
#define ETM_TRCVDCTLR_SPREL_Msk (0x3UL << ETM_TRCVDCTLR_SPREL_Pos) /*!< Bit mask of SPREL field. */
#define ETM_TRCVDCTLR_SPREL_Enabled (0x0UL) /*!< The trace unit does not affect the tracing of SP-relative transfers. */
#define ETM_TRCVDCTLR_SPREL_DataOnly (0x2UL) /*!< The trace unit does not trace the address portion of SP-relative transfers. If data value tracing is enabled then the trace unit generates a P1 data address element. */
#define ETM_TRCVDCTLR_SPREL_Disabled (0x3UL) /*!< The trace unit does not trace the address or value portions of SP-relative transfers. */

/* Bit 7 : Event unit enable bit. */
#define ETM_TRCVDCTLR_EVENT_7_Pos (7UL) /*!< Position of EVENT_7 field. */
#define ETM_TRCVDCTLR_EVENT_7_Msk (0x1UL << ETM_TRCVDCTLR_EVENT_7_Pos) /*!< Bit mask of EVENT_7 field. */
#define ETM_TRCVDCTLR_EVENT_7_Disabled (0x0UL) /*!< The trace event is not selected for trace filtering. */
#define ETM_TRCVDCTLR_EVENT_7_Enabled (0x1UL) /*!< The trace event is selected for trace filtering. */

/* Bit 6 : Event unit enable bit. */
#define ETM_TRCVDCTLR_EVENT_6_Pos (6UL) /*!< Position of EVENT_6 field. */
#define ETM_TRCVDCTLR_EVENT_6_Msk (0x1UL << ETM_TRCVDCTLR_EVENT_6_Pos) /*!< Bit mask of EVENT_6 field. */
#define ETM_TRCVDCTLR_EVENT_6_Disabled (0x0UL) /*!< The trace event is not selected for trace filtering. */
#define ETM_TRCVDCTLR_EVENT_6_Enabled (0x1UL) /*!< The trace event is selected for trace filtering. */

/* Bit 5 : Event unit enable bit. */
#define ETM_TRCVDCTLR_EVENT_5_Pos (5UL) /*!< Position of EVENT_5 field. */
#define ETM_TRCVDCTLR_EVENT_5_Msk (0x1UL << ETM_TRCVDCTLR_EVENT_5_Pos) /*!< Bit mask of EVENT_5 field. */
#define ETM_TRCVDCTLR_EVENT_5_Disabled (0x0UL) /*!< The trace event is not selected for trace filtering. */
#define ETM_TRCVDCTLR_EVENT_5_Enabled (0x1UL) /*!< The trace event is selected for trace filtering. */

/* Bit 4 : Event unit enable bit. */
#define ETM_TRCVDCTLR_EVENT_4_Pos (4UL) /*!< Position of EVENT_4 field. */
#define ETM_TRCVDCTLR_EVENT_4_Msk (0x1UL << ETM_TRCVDCTLR_EVENT_4_Pos) /*!< Bit mask of EVENT_4 field. */
#define ETM_TRCVDCTLR_EVENT_4_Disabled (0x0UL) /*!< The trace event is not selected for trace filtering. */
#define ETM_TRCVDCTLR_EVENT_4_Enabled (0x1UL) /*!< The trace event is selected for trace filtering. */

