NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 3 : Event unit enable bit. */
#define ETM_TRCVDCTLR_EVENT_3_Pos (3UL) /*!< Position of EVENT_3 field. */
#define ETM_TRCVDCTLR_EVENT_3_Msk (0x1UL << ETM_TRCVDCTLR_EVENT_3_Pos) /*!< Bit mask of EVENT_3 field. */
#define ETM_TRCVDCTLR_EVENT_3_Disabled (0x0UL) /*!< The trace event is not selected for trace filtering. */
#define ETM_TRCVDCTLR_EVENT_3_Enabled (0x1UL) /*!< The trace event is selected for trace filtering. */

/* Bit 2 : Event unit enable bit. */
#define ETM_TRCVDCTLR_EVENT_2_Pos (2UL) /*!< Position of EVENT_2 field. */
#define ETM_TRCVDCTLR_EVENT_2_Msk (0x1UL << ETM_TRCVDCTLR_EVENT_2_Pos) /*!< Bit mask of EVENT_2 field. */
#define ETM_TRCVDCTLR_EVENT_2_Disabled (0x0UL) /*!< The trace event is not selected for trace filtering. */
#define ETM_TRCVDCTLR_EVENT_2_Enabled (0x1UL) /*!< The trace event is selected for trace filtering. */

/* Bit 1 : Event unit enable bit. */
#define ETM_TRCVDCTLR_EVENT_1_Pos (1UL) /*!< Position of EVENT_1 field. */
#define ETM_TRCVDCTLR_EVENT_1_Msk (0x1UL << ETM_TRCVDCTLR_EVENT_1_Pos) /*!< Bit mask of EVENT_1 field. */
#define ETM_TRCVDCTLR_EVENT_1_Disabled (0x0UL) /*!< The trace event is not selected for trace filtering. */
#define ETM_TRCVDCTLR_EVENT_1_Enabled (0x1UL) /*!< The trace event is selected for trace filtering. */

/* Bit 0 : Event unit enable bit. */
#define ETM_TRCVDCTLR_EVENT_0_Pos (0UL) /*!< Position of EVENT_0 field. */
#define ETM_TRCVDCTLR_EVENT_0_Msk (0x1UL << ETM_TRCVDCTLR_EVENT_0_Pos) /*!< Bit mask of EVENT_0 field. */
#define ETM_TRCVDCTLR_EVENT_0_Disabled (0x0UL) /*!< The trace event is not selected for trace filtering. */
#define ETM_TRCVDCTLR_EVENT_0_Enabled (0x1UL) /*!< The trace event is selected for trace filtering. */

/* Register: ETM_TRCVDSACCTLR */
/* Description: ViewData include / exclude control. Might ignore writes when the trace unit is enabled or not idle. This register must be programmed when one or more address comparators are implemented. */

/* Bit 23 : Selects which single address comparators are in use with ViewData exclude control. */
#define ETM_TRCVDSACCTLR_EXCLUDE_7_Pos (23UL) /*!< Position of EXCLUDE_7 field. */
#define ETM_TRCVDSACCTLR_EXCLUDE_7_Msk (0x1UL << ETM_TRCVDSACCTLR_EXCLUDE_7_Pos) /*!< Bit mask of EXCLUDE_7 field. */
#define ETM_TRCVDSACCTLR_EXCLUDE_7_Disabled (0x0UL) /*!< The single address comparator 7, is not selected for ViewData exclude control. */
#define ETM_TRCVDSACCTLR_EXCLUDE_7_Enabled (0x1UL) /*!< The single address comparator 7, s selected for ViewData exclude control. */

/* Bit 22 : Selects which single address comparators are in use with ViewData exclude control. */
#define ETM_TRCVDSACCTLR_EXCLUDE_6_Pos (22UL) /*!< Position of EXCLUDE_6 field. */
#define ETM_TRCVDSACCTLR_EXCLUDE_6_Msk (0x1UL << ETM_TRCVDSACCTLR_EXCLUDE_6_Pos) /*!< Bit mask of EXCLUDE_6 field. */
#define ETM_TRCVDSACCTLR_EXCLUDE_6_Disabled (0x0UL) /*!< The single address comparator 6, is not selected for ViewData exclude control. */
#define ETM_TRCVDSACCTLR_EXCLUDE_6_Enabled (0x1UL) /*!< The single address comparator 6, s selected for ViewData exclude control. */

/* Bit 21 : Selects which single address comparators are in use with ViewData exclude control. */
#define ETM_TRCVDSACCTLR_EXCLUDE_5_Pos (21UL) /*!< Position of EXCLUDE_5 field. */
#define ETM_TRCVDSACCTLR_EXCLUDE_5_Msk (0x1UL << ETM_TRCVDSACCTLR_EXCLUDE_5_Pos) /*!< Bit mask of EXCLUDE_5 field. */
#define ETM_TRCVDSACCTLR_EXCLUDE_5_Disabled (0x0UL) /*!< The single address comparator 5, is not selected for ViewData exclude control. */
#define ETM_TRCVDSACCTLR_EXCLUDE_5_Enabled (0x1UL) /*!< The single address comparator 5, s selected for ViewData exclude control. */

/* Bit 20 : Selects which single address comparators are in use with ViewData exclude control. */
#define ETM_TRCVDSACCTLR_EXCLUDE_4_Pos (20UL) /*!< Position of EXCLUDE_4 field. */
#define ETM_TRCVDSACCTLR_EXCLUDE_4_Msk (0x1UL << ETM_TRCVDSACCTLR_EXCLUDE_4_Pos) /*!< Bit mask of EXCLUDE_4 field. */
#define ETM_TRCVDSACCTLR_EXCLUDE_4_Disabled (0x0UL) /*!< The single address comparator 4, is not selected for ViewData exclude control. */
#define ETM_TRCVDSACCTLR_EXCLUDE_4_Enabled (0x1UL) /*!< The single address comparator 4, s selected for ViewData exclude control. */

/* Bit 19 : Selects which single address comparators are in use with ViewData exclude control. */
#define ETM_TRCVDSACCTLR_EXCLUDE_3_Pos (19UL) /*!< Position of EXCLUDE_3 field. */
#define ETM_TRCVDSACCTLR_EXCLUDE_3_Msk (0x1UL << ETM_TRCVDSACCTLR_EXCLUDE_3_Pos) /*!< Bit mask of EXCLUDE_3 field. */
#define ETM_TRCVDSACCTLR_EXCLUDE_3_Disabled (0x0UL) /*!< The single address comparator 3, is not selected for ViewData exclude control. */
#define ETM_TRCVDSACCTLR_EXCLUDE_3_Enabled (0x1UL) /*!< The single address comparator 3, s selected for ViewData exclude control. */

/* Bit 18 : Selects which single address comparators are in use with ViewData exclude control. */
#define ETM_TRCVDSACCTLR_EXCLUDE_2_Pos (18UL) /*!< Position of EXCLUDE_2 field. */
#define ETM_TRCVDSACCTLR_EXCLUDE_2_Msk (0x1UL << ETM_TRCVDSACCTLR_EXCLUDE_2_Pos) /*!< Bit mask of EXCLUDE_2 field. */
#define ETM_TRCVDSACCTLR_EXCLUDE_2_Disabled (0x0UL) /*!< The single address comparator 2, is not selected for ViewData exclude control. */
#define ETM_TRCVDSACCTLR_EXCLUDE_2_Enabled (0x1UL) /*!< The single address comparator 2, s selected for ViewData exclude control. */

/* Bit 17 : Selects which single address comparators are in use with ViewData exclude control. */
#define ETM_TRCVDSACCTLR_EXCLUDE_1_Pos (17UL) /*!< Position of EXCLUDE_1 field. */
#define ETM_TRCVDSACCTLR_EXCLUDE_1_Msk (0x1UL << ETM_TRCVDSACCTLR_EXCLUDE_1_Pos) /*!< Bit mask of EXCLUDE_1 field. */
#define ETM_TRCVDSACCTLR_EXCLUDE_1_Disabled (0x0UL) /*!< The single address comparator 1, is not selected for ViewData exclude control. */
#define ETM_TRCVDSACCTLR_EXCLUDE_1_Enabled (0x1UL) /*!< The single address comparator 1, s selected for ViewData exclude control. */

/* Bit 16 : Selects which single address comparators are in use with ViewData exclude control. */
#define ETM_TRCVDSACCTLR_EXCLUDE_0_Pos (16UL) /*!< Position of EXCLUDE_0 field. */
#define ETM_TRCVDSACCTLR_EXCLUDE_0_Msk (0x1UL << ETM_TRCVDSACCTLR_EXCLUDE_0_Pos) /*!< Bit mask of EXCLUDE_0 field. */
#define ETM_TRCVDSACCTLR_EXCLUDE_0_Disabled (0x0UL) /*!< The single address comparator 0, is not selected for ViewData exclude control. */
#define ETM_TRCVDSACCTLR_EXCLUDE_0_Enabled (0x1UL) /*!< The single address comparator 0, s selected for ViewData exclude control. */

/* Bit 7 : Selects which single address comparators are in use with ViewData include control. */
#define ETM_TRCVDSACCTLR_INCLUDE_7_Pos (7UL) /*!< Position of INCLUDE_7 field. */
#define ETM_TRCVDSACCTLR_INCLUDE_7_Msk (0x1UL << ETM_TRCVDSACCTLR_INCLUDE_7_Pos) /*!< Bit mask of INCLUDE_7 field. */
#define ETM_TRCVDSACCTLR_INCLUDE_7_Disabled (0x0UL) /*!< The single address comparator 7, is not selected for ViewData include control. */
#define ETM_TRCVDSACCTLR_INCLUDE_7_Enabled (0x1UL) /*!< The single address comparator 7, is selected for ViewData include control. */

/* Bit 6 : Selects which single address comparators are in use with ViewData include control. */
#define ETM_TRCVDSACCTLR_INCLUDE_6_Pos (6UL) /*!< Position of INCLUDE_6 field. */
#define ETM_TRCVDSACCTLR_INCLUDE_6_Msk (0x1UL << ETM_TRCVDSACCTLR_INCLUDE_6_Pos) /*!< Bit mask of INCLUDE_6 field. */
#define ETM_TRCVDSACCTLR_INCLUDE_6_Disabled (0x0UL) /*!< The single address comparator 6, is not selected for ViewData include control. */
#define ETM_TRCVDSACCTLR_INCLUDE_6_Enabled (0x1UL) /*!< The single address comparator 6, is selected for ViewData include control. */

/* Bit 5 : Selects which single address comparators are in use with ViewData include control. */
#define ETM_TRCVDSACCTLR_INCLUDE_5_Pos (5UL) /*!< Position of INCLUDE_5 field. */
#define ETM_TRCVDSACCTLR_INCLUDE_5_Msk (0x1UL << ETM_TRCVDSACCTLR_INCLUDE_5_Pos) /*!< Bit mask of INCLUDE_5 field. */
#define ETM_TRCVDSACCTLR_INCLUDE_5_Disabled (0x0UL) /*!< The single address comparator 5, is not selected for ViewData include control. */
#define ETM_TRCVDSACCTLR_INCLUDE_5_Enabled (0x1UL) /*!< The single address comparator 5, is selected for ViewData include control. */

/* Bit 4 : Selects which single address comparators are in use with ViewData include control. */
#define ETM_TRCVDSACCTLR_INCLUDE_4_Pos (4UL) /*!< Position of INCLUDE_4 field. */
#define ETM_TRCVDSACCTLR_INCLUDE_4_Msk (0x1UL << ETM_TRCVDSACCTLR_INCLUDE_4_Pos) /*!< Bit mask of INCLUDE_4 field. */
#define ETM_TRCVDSACCTLR_INCLUDE_4_Disabled (0x0UL) /*!< The single address comparator 4, is not selected for ViewData include control. */
#define ETM_TRCVDSACCTLR_INCLUDE_4_Enabled (0x1UL) /*!< The single address comparator 4, is selected for ViewData include control. */

/* Bit 3 : Selects which single address comparators are in use with ViewData include control. */
#define ETM_TRCVDSACCTLR_INCLUDE_3_Pos (3UL) /*!< Position of INCLUDE_3 field. */
#define ETM_TRCVDSACCTLR_INCLUDE_3_Msk (0x1UL << ETM_TRCVDSACCTLR_INCLUDE_3_Pos) /*!< Bit mask of INCLUDE_3 field. */
#define ETM_TRCVDSACCTLR_INCLUDE_3_Disabled (0x0UL) /*!< The single address comparator 3, is not selected for ViewData include control. */
#define ETM_TRCVDSACCTLR_INCLUDE_3_Enabled (0x1UL) /*!< The single address comparator 3, is selected for ViewData include control. */

/* Bit 2 : Selects which single address comparators are in use with ViewData include control. */
#define ETM_TRCVDSACCTLR_INCLUDE_2_Pos (2UL) /*!< Position of INCLUDE_2 field. */
#define ETM_TRCVDSACCTLR_INCLUDE_2_Msk (0x1UL << ETM_TRCVDSACCTLR_INCLUDE_2_Pos) /*!< Bit mask of INCLUDE_2 field. */
#define ETM_TRCVDSACCTLR_INCLUDE_2_Disabled (0x0UL) /*!< The single address comparator 2, is not selected for ViewData include control. */
#define ETM_TRCVDSACCTLR_INCLUDE_2_Enabled (0x1UL) /*!< The single address comparator 2, is selected for ViewData include control. */

/* Bit 1 : Selects which single address comparators are in use with ViewData include control. */
#define ETM_TRCVDSACCTLR_INCLUDE_1_Pos (1UL) /*!< Position of INCLUDE_1 field. */
#define ETM_TRCVDSACCTLR_INCLUDE_1_Msk (0x1UL << ETM_TRCVDSACCTLR_INCLUDE_1_Pos) /*!< Bit mask of INCLUDE_1 field. */
#define ETM_TRCVDSACCTLR_INCLUDE_1_Disabled (0x0UL) /*!< The single address comparator 1, is not selected for ViewData include control. */
#define ETM_TRCVDSACCTLR_INCLUDE_1_Enabled (0x1UL) /*!< The single address comparator 1, is selected for ViewData include control. */

/* Bit 0 : Selects which single address comparators are in use with ViewData include control. */
#define ETM_TRCVDSACCTLR_INCLUDE_0_Pos (0UL) /*!< Position of INCLUDE_0 field. */
#define ETM_TRCVDSACCTLR_INCLUDE_0_Msk (0x1UL << ETM_TRCVDSACCTLR_INCLUDE_0_Pos) /*!< Bit mask of INCLUDE_0 field. */
#define ETM_TRCVDSACCTLR_INCLUDE_0_Disabled (0x0UL) /*!< The single address comparator 0, is not selected for ViewData include control. */
#define ETM_TRCVDSACCTLR_INCLUDE_0_Enabled (0x1UL) /*!< The single address comparator 0, is selected for ViewData include control. */

/* Register: ETM_TRCVDARCCTLR */
/* Description: ViewData include / exclude control. Might ignore writes when the trace unit is enabled or not idle. This register must be programmed when one or more address comparators are implemented. */

