NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 23 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude control. */
#define ETM_TRCVDARCCTLR_EXCLUDE_7_Pos (23UL) /*!< Position of EXCLUDE_7 field. */
#define ETM_TRCVDARCCTLR_EXCLUDE_7_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE_7_Pos) /*!< Bit mask of EXCLUDE_7 field. */
#define ETM_TRCVDARCCTLR_EXCLUDE_7_Disabled (0x0UL) /*!< The address range that address range comparator 7 defines, is not selected for ViewData exclude control. */
#define ETM_TRCVDARCCTLR_EXCLUDE_7_Enabled (0x1UL) /*!< The address range that address range comparator 7 defines, s selected for ViewData exclude control. */

/* Bit 22 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude control. */
#define ETM_TRCVDARCCTLR_EXCLUDE_6_Pos (22UL) /*!< Position of EXCLUDE_6 field. */
#define ETM_TRCVDARCCTLR_EXCLUDE_6_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE_6_Pos) /*!< Bit mask of EXCLUDE_6 field. */
#define ETM_TRCVDARCCTLR_EXCLUDE_6_Disabled (0x0UL) /*!< The address range that address range comparator 6 defines, is not selected for ViewData exclude control. */
#define ETM_TRCVDARCCTLR_EXCLUDE_6_Enabled (0x1UL) /*!< The address range that address range comparator 6 defines, s selected for ViewData exclude control. */

/* Bit 21 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude control. */
#define ETM_TRCVDARCCTLR_EXCLUDE_5_Pos (21UL) /*!< Position of EXCLUDE_5 field. */
#define ETM_TRCVDARCCTLR_EXCLUDE_5_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE_5_Pos) /*!< Bit mask of EXCLUDE_5 field. */
#define ETM_TRCVDARCCTLR_EXCLUDE_5_Disabled (0x0UL) /*!< The address range that address range comparator 5 defines, is not selected for ViewData exclude control. */
#define ETM_TRCVDARCCTLR_EXCLUDE_5_Enabled (0x1UL) /*!< The address range that address range comparator 5 defines, s selected for ViewData exclude control. */

/* Bit 20 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude control. */
#define ETM_TRCVDARCCTLR_EXCLUDE_4_Pos (20UL) /*!< Position of EXCLUDE_4 field. */
#define ETM_TRCVDARCCTLR_EXCLUDE_4_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE_4_Pos) /*!< Bit mask of EXCLUDE_4 field. */
#define ETM_TRCVDARCCTLR_EXCLUDE_4_Disabled (0x0UL) /*!< The address range that address range comparator 4 defines, is not selected for ViewData exclude control. */
#define ETM_TRCVDARCCTLR_EXCLUDE_4_Enabled (0x1UL) /*!< The address range that address range comparator 4 defines, s selected for ViewData exclude control. */

/* Bit 19 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude control. */
#define ETM_TRCVDARCCTLR_EXCLUDE_3_Pos (19UL) /*!< Position of EXCLUDE_3 field. */
#define ETM_TRCVDARCCTLR_EXCLUDE_3_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE_3_Pos) /*!< Bit mask of EXCLUDE_3 field. */
#define ETM_TRCVDARCCTLR_EXCLUDE_3_Disabled (0x0UL) /*!< The address range that address range comparator 3 defines, is not selected for ViewData exclude control. */
#define ETM_TRCVDARCCTLR_EXCLUDE_3_Enabled (0x1UL) /*!< The address range that address range comparator 3 defines, s selected for ViewData exclude control. */

/* Bit 18 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude control. */
#define ETM_TRCVDARCCTLR_EXCLUDE_2_Pos (18UL) /*!< Position of EXCLUDE_2 field. */
#define ETM_TRCVDARCCTLR_EXCLUDE_2_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE_2_Pos) /*!< Bit mask of EXCLUDE_2 field. */
#define ETM_TRCVDARCCTLR_EXCLUDE_2_Disabled (0x0UL) /*!< The address range that address range comparator 2 defines, is not selected for ViewData exclude control. */
#define ETM_TRCVDARCCTLR_EXCLUDE_2_Enabled (0x1UL) /*!< The address range that address range comparator 2 defines, s selected for ViewData exclude control. */

/* Bit 17 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude control. */
#define ETM_TRCVDARCCTLR_EXCLUDE_1_Pos (17UL) /*!< Position of EXCLUDE_1 field. */
#define ETM_TRCVDARCCTLR_EXCLUDE_1_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE_1_Pos) /*!< Bit mask of EXCLUDE_1 field. */
#define ETM_TRCVDARCCTLR_EXCLUDE_1_Disabled (0x0UL) /*!< The address range that address range comparator 1 defines, is not selected for ViewData exclude control. */
#define ETM_TRCVDARCCTLR_EXCLUDE_1_Enabled (0x1UL) /*!< The address range that address range comparator 1 defines, s selected for ViewData exclude control. */

/* Bit 16 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude control. */
#define ETM_TRCVDARCCTLR_EXCLUDE_0_Pos (16UL) /*!< Position of EXCLUDE_0 field. */
#define ETM_TRCVDARCCTLR_EXCLUDE_0_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE_0_Pos) /*!< Bit mask of EXCLUDE_0 field. */
#define ETM_TRCVDARCCTLR_EXCLUDE_0_Disabled (0x0UL) /*!< The address range that address range comparator 0 defines, is not selected for ViewData exclude control. */
#define ETM_TRCVDARCCTLR_EXCLUDE_0_Enabled (0x1UL) /*!< The address range that address range comparator 0 defines, s selected for ViewData exclude control. */

/* Bit 7 : Include range field. Selects which address range comparator pairs are in use with ViewData include control. */
#define ETM_TRCVDARCCTLR_INCLUDE_7_Pos (7UL) /*!< Position of INCLUDE_7 field. */
#define ETM_TRCVDARCCTLR_INCLUDE_7_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE_7_Pos) /*!< Bit mask of INCLUDE_7 field. */
#define ETM_TRCVDARCCTLR_INCLUDE_7_Disabled (0x0UL) /*!< The address range that address range comparator 7 defines, is not selected for ViewData include control. */
#define ETM_TRCVDARCCTLR_INCLUDE_7_Enabled (0x1UL) /*!< The address range that address range comparator 7 defines, is selected for ViewData include control. */

/* Bit 6 : Include range field. Selects which address range comparator pairs are in use with ViewData include control. */
#define ETM_TRCVDARCCTLR_INCLUDE_6_Pos (6UL) /*!< Position of INCLUDE_6 field. */
#define ETM_TRCVDARCCTLR_INCLUDE_6_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE_6_Pos) /*!< Bit mask of INCLUDE_6 field. */
#define ETM_TRCVDARCCTLR_INCLUDE_6_Disabled (0x0UL) /*!< The address range that address range comparator 6 defines, is not selected for ViewData include control. */
#define ETM_TRCVDARCCTLR_INCLUDE_6_Enabled (0x1UL) /*!< The address range that address range comparator 6 defines, is selected for ViewData include control. */

/* Bit 5 : Include range field. Selects which address range comparator pairs are in use with ViewData include control. */
#define ETM_TRCVDARCCTLR_INCLUDE_5_Pos (5UL) /*!< Position of INCLUDE_5 field. */
#define ETM_TRCVDARCCTLR_INCLUDE_5_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE_5_Pos) /*!< Bit mask of INCLUDE_5 field. */
#define ETM_TRCVDARCCTLR_INCLUDE_5_Disabled (0x0UL) /*!< The address range that address range comparator 5 defines, is not selected for ViewData include control. */
#define ETM_TRCVDARCCTLR_INCLUDE_5_Enabled (0x1UL) /*!< The address range that address range comparator 5 defines, is selected for ViewData include control. */

/* Bit 4 : Include range field. Selects which address range comparator pairs are in use with ViewData include control. */
#define ETM_TRCVDARCCTLR_INCLUDE_4_Pos (4UL) /*!< Position of INCLUDE_4 field. */
#define ETM_TRCVDARCCTLR_INCLUDE_4_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE_4_Pos) /*!< Bit mask of INCLUDE_4 field. */
#define ETM_TRCVDARCCTLR_INCLUDE_4_Disabled (0x0UL) /*!< The address range that address range comparator 4 defines, is not selected for ViewData include control. */
#define ETM_TRCVDARCCTLR_INCLUDE_4_Enabled (0x1UL) /*!< The address range that address range comparator 4 defines, is selected for ViewData include control. */

