NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 3 : Include range field. Selects which address range comparator pairs are in use with ViewData include control. */
#define ETM_TRCVDARCCTLR_INCLUDE_3_Pos (3UL) /*!< Position of INCLUDE_3 field. */
#define ETM_TRCVDARCCTLR_INCLUDE_3_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE_3_Pos) /*!< Bit mask of INCLUDE_3 field. */
#define ETM_TRCVDARCCTLR_INCLUDE_3_Disabled (0x0UL) /*!< The address range that address range comparator 3 defines, is not selected for ViewData include control. */
#define ETM_TRCVDARCCTLR_INCLUDE_3_Enabled (0x1UL) /*!< The address range that address range comparator 3 defines, is selected for ViewData include control. */

/* Bit 2 : Include range field. Selects which address range comparator pairs are in use with ViewData include control. */
#define ETM_TRCVDARCCTLR_INCLUDE_2_Pos (2UL) /*!< Position of INCLUDE_2 field. */
#define ETM_TRCVDARCCTLR_INCLUDE_2_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE_2_Pos) /*!< Bit mask of INCLUDE_2 field. */
#define ETM_TRCVDARCCTLR_INCLUDE_2_Disabled (0x0UL) /*!< The address range that address range comparator 2 defines, is not selected for ViewData include control. */
#define ETM_TRCVDARCCTLR_INCLUDE_2_Enabled (0x1UL) /*!< The address range that address range comparator 2 defines, is selected for ViewData include control. */

/* Bit 1 : Include range field. Selects which address range comparator pairs are in use with ViewData include control. */
#define ETM_TRCVDARCCTLR_INCLUDE_1_Pos (1UL) /*!< Position of INCLUDE_1 field. */
#define ETM_TRCVDARCCTLR_INCLUDE_1_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE_1_Pos) /*!< Bit mask of INCLUDE_1 field. */
#define ETM_TRCVDARCCTLR_INCLUDE_1_Disabled (0x0UL) /*!< The address range that address range comparator 1 defines, is not selected for ViewData include control. */
#define ETM_TRCVDARCCTLR_INCLUDE_1_Enabled (0x1UL) /*!< The address range that address range comparator 1 defines, is selected for ViewData include control. */

/* Bit 0 : Include range field. Selects which address range comparator pairs are in use with ViewData include control. */
#define ETM_TRCVDARCCTLR_INCLUDE_0_Pos (0UL) /*!< Position of INCLUDE_0 field. */
#define ETM_TRCVDARCCTLR_INCLUDE_0_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE_0_Pos) /*!< Bit mask of INCLUDE_0 field. */
#define ETM_TRCVDARCCTLR_INCLUDE_0_Disabled (0x0UL) /*!< The address range that address range comparator 0 defines, is not selected for ViewData include control. */
#define ETM_TRCVDARCCTLR_INCLUDE_0_Enabled (0x1UL) /*!< The address range that address range comparator 0 defines, is selected for ViewData include control. */

/* Register: ETM_TRCSEQEVR */
/* Description: Description collection: Moves the sequencer state according to programmed events. Might ignore writes when the trace unit is enabled or not idle. When the sequencer is used, all sequencer state transitions must be programmed with a valid event. */

/* Bit 15 : Backward field. */
#define ETM_TRCSEQEVR_B_7_Pos (15UL) /*!< Position of B_7 field. */
#define ETM_TRCSEQEVR_B_7_Msk (0x1UL << ETM_TRCSEQEVR_B_7_Pos) /*!< Bit mask of B_7 field. */
#define ETM_TRCSEQEVR_B_7_Disabled (0x0UL) /*!< The trace event does not affect the sequencer. */
#define ETM_TRCSEQEVR_B_7_Enabled (0x1UL) /*!< When the event occurs then the sequencer state moves from state n+1 to state n. */

/* Bit 14 : Backward field. */
#define ETM_TRCSEQEVR_B_6_Pos (14UL) /*!< Position of B_6 field. */
#define ETM_TRCSEQEVR_B_6_Msk (0x1UL << ETM_TRCSEQEVR_B_6_Pos) /*!< Bit mask of B_6 field. */
#define ETM_TRCSEQEVR_B_6_Disabled (0x0UL) /*!< The trace event does not affect the sequencer. */
#define ETM_TRCSEQEVR_B_6_Enabled (0x1UL) /*!< When the event occurs then the sequencer state moves from state n+1 to state n. */

/* Bit 13 : Backward field. */
#define ETM_TRCSEQEVR_B_5_Pos (13UL) /*!< Position of B_5 field. */
#define ETM_TRCSEQEVR_B_5_Msk (0x1UL << ETM_TRCSEQEVR_B_5_Pos) /*!< Bit mask of B_5 field. */
#define ETM_TRCSEQEVR_B_5_Disabled (0x0UL) /*!< The trace event does not affect the sequencer. */
#define ETM_TRCSEQEVR_B_5_Enabled (0x1UL) /*!< When the event occurs then the sequencer state moves from state n+1 to state n. */

/* Bit 12 : Backward field. */
#define ETM_TRCSEQEVR_B_4_Pos (12UL) /*!< Position of B_4 field. */
#define ETM_TRCSEQEVR_B_4_Msk (0x1UL << ETM_TRCSEQEVR_B_4_Pos) /*!< Bit mask of B_4 field. */
#define ETM_TRCSEQEVR_B_4_Disabled (0x0UL) /*!< The trace event does not affect the sequencer. */
#define ETM_TRCSEQEVR_B_4_Enabled (0x1UL) /*!< When the event occurs then the sequencer state moves from state n+1 to state n. */

/* Bit 11 : Backward field. */
#define ETM_TRCSEQEVR_B_3_Pos (11UL) /*!< Position of B_3 field. */
#define ETM_TRCSEQEVR_B_3_Msk (0x1UL << ETM_TRCSEQEVR_B_3_Pos) /*!< Bit mask of B_3 field. */
#define ETM_TRCSEQEVR_B_3_Disabled (0x0UL) /*!< The trace event does not affect the sequencer. */
#define ETM_TRCSEQEVR_B_3_Enabled (0x1UL) /*!< When the event occurs then the sequencer state moves from state n+1 to state n. */

/* Bit 10 : Backward field. */
#define ETM_TRCSEQEVR_B_2_Pos (10UL) /*!< Position of B_2 field. */
#define ETM_TRCSEQEVR_B_2_Msk (0x1UL << ETM_TRCSEQEVR_B_2_Pos) /*!< Bit mask of B_2 field. */
#define ETM_TRCSEQEVR_B_2_Disabled (0x0UL) /*!< The trace event does not affect the sequencer. */
#define ETM_TRCSEQEVR_B_2_Enabled (0x1UL) /*!< When the event occurs then the sequencer state moves from state n+1 to state n. */

/* Bit 9 : Backward field. */
#define ETM_TRCSEQEVR_B_1_Pos (9UL) /*!< Position of B_1 field. */
#define ETM_TRCSEQEVR_B_1_Msk (0x1UL << ETM_TRCSEQEVR_B_1_Pos) /*!< Bit mask of B_1 field. */
#define ETM_TRCSEQEVR_B_1_Disabled (0x0UL) /*!< The trace event does not affect the sequencer. */
#define ETM_TRCSEQEVR_B_1_Enabled (0x1UL) /*!< When the event occurs then the sequencer state moves from state n+1 to state n. */

/* Bit 8 : Backward field. */
#define ETM_TRCSEQEVR_B_0_Pos (8UL) /*!< Position of B_0 field. */
#define ETM_TRCSEQEVR_B_0_Msk (0x1UL << ETM_TRCSEQEVR_B_0_Pos) /*!< Bit mask of B_0 field. */
#define ETM_TRCSEQEVR_B_0_Disabled (0x0UL) /*!< The trace event does not affect the sequencer. */
#define ETM_TRCSEQEVR_B_0_Enabled (0x1UL) /*!< When the event occurs then the sequencer state moves from state n+1 to state n. */

/* Bit 7 : Forward field. */
#define ETM_TRCSEQEVR_F_7_Pos (7UL) /*!< Position of F_7 field. */
#define ETM_TRCSEQEVR_F_7_Msk (0x1UL << ETM_TRCSEQEVR_F_7_Pos) /*!< Bit mask of F_7 field. */
#define ETM_TRCSEQEVR_F_7_Disabled (0x0UL) /*!< The trace event does not affect the sequencer. */
#define ETM_TRCSEQEVR_F_7_Enabled (0x1UL) /*!< When the event occurs then the sequencer state moves from state n to state n+1. */

/* Bit 6 : Forward field. */
#define ETM_TRCSEQEVR_F_6_Pos (6UL) /*!< Position of F_6 field. */
#define ETM_TRCSEQEVR_F_6_Msk (0x1UL << ETM_TRCSEQEVR_F_6_Pos) /*!< Bit mask of F_6 field. */
#define ETM_TRCSEQEVR_F_6_Disabled (0x0UL) /*!< The trace event does not affect the sequencer. */
#define ETM_TRCSEQEVR_F_6_Enabled (0x1UL) /*!< When the event occurs then the sequencer state moves from state n to state n+1. */

