NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 5 : Forward field. */
#define ETM_TRCSEQEVR_F_5_Pos (5UL) /*!< Position of F_5 field. */
#define ETM_TRCSEQEVR_F_5_Msk (0x1UL << ETM_TRCSEQEVR_F_5_Pos) /*!< Bit mask of F_5 field. */
#define ETM_TRCSEQEVR_F_5_Disabled (0x0UL) /*!< The trace event does not affect the sequencer. */
#define ETM_TRCSEQEVR_F_5_Enabled (0x1UL) /*!< When the event occurs then the sequencer state moves from state n to state n+1. */

/* Bit 4 : Forward field. */
#define ETM_TRCSEQEVR_F_4_Pos (4UL) /*!< Position of F_4 field. */
#define ETM_TRCSEQEVR_F_4_Msk (0x1UL << ETM_TRCSEQEVR_F_4_Pos) /*!< Bit mask of F_4 field. */
#define ETM_TRCSEQEVR_F_4_Disabled (0x0UL) /*!< The trace event does not affect the sequencer. */
#define ETM_TRCSEQEVR_F_4_Enabled (0x1UL) /*!< When the event occurs then the sequencer state moves from state n to state n+1. */

/* Bit 3 : Forward field. */
#define ETM_TRCSEQEVR_F_3_Pos (3UL) /*!< Position of F_3 field. */
#define ETM_TRCSEQEVR_F_3_Msk (0x1UL << ETM_TRCSEQEVR_F_3_Pos) /*!< Bit mask of F_3 field. */
#define ETM_TRCSEQEVR_F_3_Disabled (0x0UL) /*!< The trace event does not affect the sequencer. */
#define ETM_TRCSEQEVR_F_3_Enabled (0x1UL) /*!< When the event occurs then the sequencer state moves from state n to state n+1. */

/* Bit 2 : Forward field. */
#define ETM_TRCSEQEVR_F_2_Pos (2UL) /*!< Position of F_2 field. */
#define ETM_TRCSEQEVR_F_2_Msk (0x1UL << ETM_TRCSEQEVR_F_2_Pos) /*!< Bit mask of F_2 field. */
#define ETM_TRCSEQEVR_F_2_Disabled (0x0UL) /*!< The trace event does not affect the sequencer. */
#define ETM_TRCSEQEVR_F_2_Enabled (0x1UL) /*!< When the event occurs then the sequencer state moves from state n to state n+1. */

/* Bit 1 : Forward field. */
#define ETM_TRCSEQEVR_F_1_Pos (1UL) /*!< Position of F_1 field. */
#define ETM_TRCSEQEVR_F_1_Msk (0x1UL << ETM_TRCSEQEVR_F_1_Pos) /*!< Bit mask of F_1 field. */
#define ETM_TRCSEQEVR_F_1_Disabled (0x0UL) /*!< The trace event does not affect the sequencer. */
#define ETM_TRCSEQEVR_F_1_Enabled (0x1UL) /*!< When the event occurs then the sequencer state moves from state n to state n+1. */

/* Bit 0 : Forward field. */
#define ETM_TRCSEQEVR_F_0_Pos (0UL) /*!< Position of F_0 field. */
#define ETM_TRCSEQEVR_F_0_Msk (0x1UL << ETM_TRCSEQEVR_F_0_Pos) /*!< Bit mask of F_0 field. */
#define ETM_TRCSEQEVR_F_0_Disabled (0x0UL) /*!< The trace event does not affect the sequencer. */
#define ETM_TRCSEQEVR_F_0_Enabled (0x1UL) /*!< When the event occurs then the sequencer state moves from state n to state n+1. */

/* Register: ETM_TRCSEQRSTEVR */
/* Description: Moves the sequencer to state 0 when a programmed event occurs. Might ignore writes when the trace unit is enabled or not idle. When the sequencer is used, all sequencer state transitions must be programmed with a valid event. */

/* Bits 7..0 : Select which event should reset the sequencer. */
#define ETM_TRCSEQRSTEVR_EVENT_Pos (0UL) /*!< Position of EVENT field. */
#define ETM_TRCSEQRSTEVR_EVENT_Msk (0xFFUL << ETM_TRCSEQRSTEVR_EVENT_Pos) /*!< Bit mask of EVENT field. */

/* Register: ETM_TRCSEQSTR */
/* Description: Use this to set, or read, the sequencer state. Might ignore writes when the trace unit is enabled or not idle. Only returns stable data when TRCSTATR.PMSTABLE == 1. When the sequencer is used, all sequencer state transitions must be programmed with a valid event. */

/* Bits 1..0 : Sets or returns the state of the sequencer. */
#define ETM_TRCSEQSTR_STATE_Pos (0UL) /*!< Position of STATE field. */
#define ETM_TRCSEQSTR_STATE_Msk (0x3UL << ETM_TRCSEQSTR_STATE_Pos) /*!< Bit mask of STATE field. */
#define ETM_TRCSEQSTR_STATE_State0 (0x0UL) /*!< The sequencer is in state 0. */
#define ETM_TRCSEQSTR_STATE_State1 (0x1UL) /*!< The sequencer is in state 1. */
#define ETM_TRCSEQSTR_STATE_State2 (0x2UL) /*!< The sequencer is in state 2. */
#define ETM_TRCSEQSTR_STATE_State3 (0x3UL) /*!< The sequencer is in state 3. */

/* Register: ETM_TRCEXTINSELR */
/* Description: Use this to set, or read, which external inputs are resources to the trace unit. Might ignore writes when the trace unit is enabled or not idle. Only returns stable data when TRCSTATR.PMSTABLE == 1. When the sequencer is used, all sequencer state transitions must be programmed with a valid event. */

/* Bits 31..24 : Each field in this collection selects an external input as a resource for the trace unit. */
#define ETM_TRCEXTINSELR_SEL_3_Pos (24UL) /*!< Position of SEL_3 field. */
#define ETM_TRCEXTINSELR_SEL_3_Msk (0xFFUL << ETM_TRCEXTINSELR_SEL_3_Pos) /*!< Bit mask of SEL_3 field. */

/* Bits 23..16 : Each field in this collection selects an external input as a resource for the trace unit. */
#define ETM_TRCEXTINSELR_SEL_2_Pos (16UL) /*!< Position of SEL_2 field. */
#define ETM_TRCEXTINSELR_SEL_2_Msk (0xFFUL << ETM_TRCEXTINSELR_SEL_2_Pos) /*!< Bit mask of SEL_2 field. */

/* Bits 15..8 : Each field in this collection selects an external input as a resource for the trace unit. */
#define ETM_TRCEXTINSELR_SEL_1_Pos (8UL) /*!< Position of SEL_1 field. */
#define ETM_TRCEXTINSELR_SEL_1_Msk (0xFFUL << ETM_TRCEXTINSELR_SEL_1_Pos) /*!< Bit mask of SEL_1 field. */

/* Bits 7..0 : Each field in this collection selects an external input as a resource for the trace unit. */
#define ETM_TRCEXTINSELR_SEL_0_Pos (0UL) /*!< Position of SEL_0 field. */
#define ETM_TRCEXTINSELR_SEL_0_Msk (0xFFUL << ETM_TRCEXTINSELR_SEL_0_Pos) /*!< Bit mask of SEL_0 field. */

/* Register: ETM_TRCCNTRLDVR */
/* Description: Description collection: This sets or returns the reload count value for counter n. Might ignore writes when the trace unit is enabled or not idle. */

/* Bits 15..0 : Contains the reload value for counter n. When a reload event occurs for counter n then the trace unit copies the VALUEn field into counter n. */
#define ETM_TRCCNTRLDVR_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define ETM_TRCCNTRLDVR_VALUE_Msk (0xFFFFUL << ETM_TRCCNTRLDVR_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: ETM_TRCCNTCTLR */
/* Description: Description collection: Controls the operation of counter n. Might ignore writes when the trace unit is enabled or not idle. */

/* Bit 17 : For TRCCNTCTLR3 and TRCCNTCTLR1, this bit controls whether counter n decrements when a reload event occurs for counter n-1. */
#define ETM_TRCCNTCTLR_CNTCHAIN_Pos (17UL) /*!< Position of CNTCHAIN field. */
#define ETM_TRCCNTCTLR_CNTCHAIN_Msk (0x1UL << ETM_TRCCNTCTLR_CNTCHAIN_Pos) /*!< Bit mask of CNTCHAIN field. */
#define ETM_TRCCNTCTLR_CNTCHAIN_Disabled (0x0UL) /*!< Counter n does not decrement when a reload event for counter n-1 occurs. */
#define ETM_TRCCNTCTLR_CNTCHAIN_Enabled (0x1UL) /*!< Counter n decrements when a reload event for counter n-1 occurs. This concatenates counter n and counter n-1, to provide a larger count value. */

