NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 16 : Controls whether a reload event occurs for counter n, when counter n reaches zero. */
#define ETM_TRCCNTCTLR_RLDSELF_Pos (16UL) /*!< Position of RLDSELF field. */
#define ETM_TRCCNTCTLR_RLDSELF_Msk (0x1UL << ETM_TRCCNTCTLR_RLDSELF_Pos) /*!< Bit mask of RLDSELF field. */
#define ETM_TRCCNTCTLR_RLDSELF_Disabled (0x0UL) /*!< The counter is in Normal mode. */
#define ETM_TRCCNTCTLR_RLDSELF_Enabled (0x1UL) /*!< The counter is in Self-reload mode. */

/* Bits 15..8 : Selects an event, that when it occurs causes a reload event for counter n. */
#define ETM_TRCCNTCTLR_RLDEVENT_Pos (8UL) /*!< Position of RLDEVENT field. */
#define ETM_TRCCNTCTLR_RLDEVENT_Msk (0xFFUL << ETM_TRCCNTCTLR_RLDEVENT_Pos) /*!< Bit mask of RLDEVENT field. */

/* Bits 7..0 : Selects an event, that when it occurs causes counter n to decrement. */
#define ETM_TRCCNTCTLR_CNTEVENT_Pos (0UL) /*!< Position of CNTEVENT field. */
#define ETM_TRCCNTCTLR_CNTEVENT_Msk (0xFFUL << ETM_TRCCNTCTLR_CNTEVENT_Pos) /*!< Bit mask of CNTEVENT field. */

/* Register: ETM_TRCCNTVR */
/* Description: Description collection: This sets or returns the value of counter n. The count value is only stable when TRCSTATR.PMSTABLE == 1. If software uses counter n then it must write to this register to set the initial counter value. Might ignore writes when the trace unit is enabled or not idle. */

/* Bits 15..0 : Contains the count value of counter n. */
#define ETM_TRCCNTVR_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define ETM_TRCCNTVR_VALUE_Msk (0xFFFFUL << ETM_TRCCNTVR_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: ETM_TRCRSCTLR */
/* Description: Description collection: Controls the selection of the resources in the trace unit. Might ignore writes when the trace unit is enabled or not idle. If software selects a non-implemented resource then CONSTRAINED UNPREDICTABLE
behavior of the resource selector occurs, so the resource selector might fire
unexpectedly or might not fire. Reads of the TRCRSCTLRn might return UNKNOWN. */

/* Bit 0 : Trace unit enable bit */
#define ETM_TRCRSCTLR_EN_Pos (0UL) /*!< Position of EN field. */
#define ETM_TRCRSCTLR_EN_Msk (0x1UL << ETM_TRCRSCTLR_EN_Pos) /*!< Bit mask of EN field. */
#define ETM_TRCRSCTLR_EN_Disabled (0x0UL) /*!< The trace unit is disabled. All trace resources are inactive and no trace is generated. */
#define ETM_TRCRSCTLR_EN_Enabled (0x1UL) /*!< The trace unit is enabled. */

/* Register: ETM_TRCSSCCR0 */
/* Description: Controls the single-shot comparator. */

/* Bit 24 : Enables the single-shot comparator resource to be reset when it occurs, to enable another comparator match to be detected */
#define ETM_TRCSSCCR0_RST_Pos (24UL) /*!< Position of RST field. */
#define ETM_TRCSSCCR0_RST_Msk (0x1UL << ETM_TRCSSCCR0_RST_Pos) /*!< Bit mask of RST field. */
#define ETM_TRCSSCCR0_RST_Disabled (0x0UL) /*!< Multiple matches can not be detected. */
#define ETM_TRCSSCCR0_RST_Enabled (0x1UL) /*!< Multiple matches can occur. */

/* Register: ETM_TRCSSCSR0 */
/* Description: Indicates the status of the single-shot comparators. TRCSSCSR0 is sensitive toinstruction addresses. */

/* Bit 31 : Single-shot status. This indicates whether any of the selected comparators have matched. */
#define ETM_TRCSSCSR0_STATUS_Pos (31UL) /*!< Position of STATUS field. */
#define ETM_TRCSSCSR0_STATUS_Msk (0x1UL << ETM_TRCSSCSR0_STATUS_Pos) /*!< Bit mask of STATUS field. */
#define ETM_TRCSSCSR0_STATUS_NoMatch (0x0UL) /*!< Match has not occurred. */
#define ETM_TRCSSCSR0_STATUS_Match (0x1UL) /*!< Match has occurred at least once. */

/* Bit 3 : Process counter value comparator support */
#define ETM_TRCSSCSR0_PC_Pos (3UL) /*!< Position of PC field. */
#define ETM_TRCSSCSR0_PC_Msk (0x1UL << ETM_TRCSSCSR0_PC_Pos) /*!< Bit mask of PC field. */
#define ETM_TRCSSCSR0_PC_False (0x0UL) /*!< Process counter value comparisons not supported. */
#define ETM_TRCSSCSR0_PC_True (0x1UL) /*!< Process counter value comparisons supported. */

/* Bit 2 : Data value comparator support */
#define ETM_TRCSSCSR0_DV_Pos (2UL) /*!< Position of DV field. */
#define ETM_TRCSSCSR0_DV_Msk (0x1UL << ETM_TRCSSCSR0_DV_Pos) /*!< Bit mask of DV field. */
#define ETM_TRCSSCSR0_DV_False (0x0UL) /*!< Data value comparisons not supported. */
#define ETM_TRCSSCSR0_DV_True (0x1UL) /*!< Data value comparisons supported. */

/* Bit 1 : Data address comparator support */
#define ETM_TRCSSCSR0_DA_Pos (1UL) /*!< Position of DA field. */
#define ETM_TRCSSCSR0_DA_Msk (0x1UL << ETM_TRCSSCSR0_DA_Pos) /*!< Bit mask of DA field. */
#define ETM_TRCSSCSR0_DA_False (0x0UL) /*!< Data address comparisons not supported. */
#define ETM_TRCSSCSR0_DA_True (0x1UL) /*!< Data address comparisons supported. */

/* Bit 0 : Instruction address comparator support */
#define ETM_TRCSSCSR0_INST_Pos (0UL) /*!< Position of INST field. */
#define ETM_TRCSSCSR0_INST_Msk (0x1UL << ETM_TRCSSCSR0_INST_Pos) /*!< Bit mask of INST field. */
#define ETM_TRCSSCSR0_INST_False (0x0UL) /*!< Single-shot instruction address comparisons not supported. */
#define ETM_TRCSSCSR0_INST_True (0x1UL) /*!< Single-shot instruction address comparisons supported. */

/* Register: ETM_TRCSSPCICR0 */
/* Description: Selects the processor comparator inputs for Single-shot control. */

/* Bit 3 : Selects processor comparator 3 inputs for Single-shot control */
#define ETM_TRCSSPCICR0_PC_3_Pos (3UL) /*!< Position of PC_3 field. */
#define ETM_TRCSSPCICR0_PC_3_Msk (0x1UL << ETM_TRCSSPCICR0_PC_3_Pos) /*!< Bit mask of PC_3 field. */
#define ETM_TRCSSPCICR0_PC_3_Disabled (0x0UL) /*!< Processor comparator 3 is not selected for Single-shot control. */
#define ETM_TRCSSPCICR0_PC_3_Enabled (0x1UL) /*!< Processor comparator 3 is selected for Single-shot control. */

/* Bit 2 : Selects processor comparator 2 inputs for Single-shot control */
#define ETM_TRCSSPCICR0_PC_2_Pos (2UL) /*!< Position of PC_2 field. */
#define ETM_TRCSSPCICR0_PC_2_Msk (0x1UL << ETM_TRCSSPCICR0_PC_2_Pos) /*!< Bit mask of PC_2 field. */
#define ETM_TRCSSPCICR0_PC_2_Disabled (0x0UL) /*!< Processor comparator 2 is not selected for Single-shot control. */
#define ETM_TRCSSPCICR0_PC_2_Enabled (0x1UL) /*!< Processor comparator 2 is selected for Single-shot control. */

