NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 1 : Selects processor comparator 1 inputs for Single-shot control */
#define ETM_TRCSSPCICR0_PC_1_Pos (1UL) /*!< Position of PC_1 field. */
#define ETM_TRCSSPCICR0_PC_1_Msk (0x1UL << ETM_TRCSSPCICR0_PC_1_Pos) /*!< Bit mask of PC_1 field. */
#define ETM_TRCSSPCICR0_PC_1_Disabled (0x0UL) /*!< Processor comparator 1 is not selected for Single-shot control. */
#define ETM_TRCSSPCICR0_PC_1_Enabled (0x1UL) /*!< Processor comparator 1 is selected for Single-shot control. */

/* Bit 0 : Selects processor comparator 0 inputs for Single-shot control */
#define ETM_TRCSSPCICR0_PC_0_Pos (0UL) /*!< Position of PC_0 field. */
#define ETM_TRCSSPCICR0_PC_0_Msk (0x1UL << ETM_TRCSSPCICR0_PC_0_Pos) /*!< Bit mask of PC_0 field. */
#define ETM_TRCSSPCICR0_PC_0_Disabled (0x0UL) /*!< Processor comparator 0 is not selected for Single-shot control. */
#define ETM_TRCSSPCICR0_PC_0_Enabled (0x1UL) /*!< Processor comparator 0 is selected for Single-shot control. */

/* Register: ETM_TRCPDCR */
/* Description: Controls the single-shot comparator. */

/* Bit 24 : Power up request, to request that power to ETM and access to the trace registers is maintained. */
#define ETM_TRCPDCR_PU_Pos (24UL) /*!< Position of PU field. */
#define ETM_TRCPDCR_PU_Msk (0x1UL << ETM_TRCPDCR_PU_Pos) /*!< Bit mask of PU field. */
#define ETM_TRCPDCR_PU_Disabled (0x0UL) /*!< Power not requested. */
#define ETM_TRCPDCR_PU_Enabled (0x1UL) /*!< Power requested. */

/* Register: ETM_TRCPDSR */
/* Description: Indicates the power down status of the ETM. */

/* Bit 1 : Sticky power down state. This bit is set to 1 when power to the ETM registers is removed, to indicate that programming state has been lost. It is cleared after a read of the TRCPDSR */
#define ETM_TRCPDSR_STICKYPD_Pos (1UL) /*!< Position of STICKYPD field. */
#define ETM_TRCPDSR_STICKYPD_Msk (0x1UL << ETM_TRCPDSR_STICKYPD_Pos) /*!< Bit mask of STICKYPD field. */
#define ETM_TRCPDSR_STICKYPD_NotPoweredDown (0x0UL) /*!< Trace register power has not been removed since the TRCPDSR was last read. */
#define ETM_TRCPDSR_STICKYPD_PoweredDown (0x1UL) /*!< Trace register power has been removed since the TRCPDSR was last read. */

/* Bit 0 : Indicates ETM is powered up */
#define ETM_TRCPDSR_POWER_Pos (0UL) /*!< Position of POWER field. */
#define ETM_TRCPDSR_POWER_Msk (0x1UL << ETM_TRCPDSR_POWER_Pos) /*!< Bit mask of POWER field. */
#define ETM_TRCPDSR_POWER_NotPoweredUp (0x0UL) /*!< ETM is not powered up. All registers are not accessible. */
#define ETM_TRCPDSR_POWER_PoweredUp (0x1UL) /*!< ETM is powered up. All registers are accessible. */

/* Register: ETM_TRCITATBIDR */
/* Description: Sets the state of output pins. */

/* Bit 6 : Drives the ATIDMI[6] output pin. */
#define ETM_TRCITATBIDR_ID_6_Pos (6UL) /*!< Position of ID_6 field. */
#define ETM_TRCITATBIDR_ID_6_Msk (0x1UL << ETM_TRCITATBIDR_ID_6_Pos) /*!< Bit mask of ID_6 field. */

/* Bit 5 : Drives the ATIDMI[5] output pin. */
#define ETM_TRCITATBIDR_ID_5_Pos (5UL) /*!< Position of ID_5 field. */
#define ETM_TRCITATBIDR_ID_5_Msk (0x1UL << ETM_TRCITATBIDR_ID_5_Pos) /*!< Bit mask of ID_5 field. */

/* Bit 4 : Drives the ATIDMI[4] output pin. */
#define ETM_TRCITATBIDR_ID_4_Pos (4UL) /*!< Position of ID_4 field. */
#define ETM_TRCITATBIDR_ID_4_Msk (0x1UL << ETM_TRCITATBIDR_ID_4_Pos) /*!< Bit mask of ID_4 field. */

/* Bit 3 : Drives the ATIDMI[3] output pin. */
#define ETM_TRCITATBIDR_ID_3_Pos (3UL) /*!< Position of ID_3 field. */
#define ETM_TRCITATBIDR_ID_3_Msk (0x1UL << ETM_TRCITATBIDR_ID_3_Pos) /*!< Bit mask of ID_3 field. */

/* Bit 2 : Drives the ATIDMI[2] output pin. */
#define ETM_TRCITATBIDR_ID_2_Pos (2UL) /*!< Position of ID_2 field. */
#define ETM_TRCITATBIDR_ID_2_Msk (0x1UL << ETM_TRCITATBIDR_ID_2_Pos) /*!< Bit mask of ID_2 field. */

/* Bit 1 : Drives the ATIDMI[1] output pin. */
#define ETM_TRCITATBIDR_ID_1_Pos (1UL) /*!< Position of ID_1 field. */
#define ETM_TRCITATBIDR_ID_1_Msk (0x1UL << ETM_TRCITATBIDR_ID_1_Pos) /*!< Bit mask of ID_1 field. */

/* Bit 0 : Drives the ATIDMI[0] output pin. */
#define ETM_TRCITATBIDR_ID_0_Pos (0UL) /*!< Position of ID_0 field. */
#define ETM_TRCITATBIDR_ID_0_Msk (0x1UL << ETM_TRCITATBIDR_ID_0_Pos) /*!< Bit mask of ID_0 field. */

/* Register: ETM_TRCITIATBINR */
/* Description: Reads the state of the input pins. */

/* Bit 1 : Returns the value of the AFREADYMI input pin. */
#define ETM_TRCITIATBINR_AFREADY_Pos (1UL) /*!< Position of AFREADY field. */
#define ETM_TRCITIATBINR_AFREADY_Msk (0x1UL << ETM_TRCITIATBINR_AFREADY_Pos) /*!< Bit mask of AFREADY field. */

/* Bit 0 : Returns the value of the ATVALIDMI input pin. */
#define ETM_TRCITIATBINR_ATVALID_Pos (0UL) /*!< Position of ATVALID field. */
#define ETM_TRCITIATBINR_ATVALID_Msk (0x1UL << ETM_TRCITIATBINR_ATVALID_Pos) /*!< Bit mask of ATVALID field. */

/* Register: ETM_TRCITIATBOUTR */
/* Description: Sets the state of the output pins. */

/* Bit 1 : Drives the AFREADYMI output pin. */
#define ETM_TRCITIATBOUTR_AFREADY_Pos (1UL) /*!< Position of AFREADY field. */
#define ETM_TRCITIATBOUTR_AFREADY_Msk (0x1UL << ETM_TRCITIATBOUTR_AFREADY_Pos) /*!< Bit mask of AFREADY field. */

/* Bit 0 : Drives the ATVALIDMI output pin. */
#define ETM_TRCITIATBOUTR_ATVALID_Pos (0UL) /*!< Position of ATVALID field. */
#define ETM_TRCITIATBOUTR_ATVALID_Msk (0x1UL << ETM_TRCITIATBOUTR_ATVALID_Pos) /*!< Bit mask of ATVALID field. */

/* Register: ETM_TRCITCTRL */
/* Description: Enables topology detection or integration testing, by putting ETM-M33 into integration mode. */

/* Bit 0 : Integration mode enable */
#define ETM_TRCITCTRL_IME_Pos (0UL) /*!< Position of IME field. */
#define ETM_TRCITCTRL_IME_Msk (0x1UL << ETM_TRCITCTRL_IME_Pos) /*!< Bit mask of IME field. */
#define ETM_TRCITCTRL_IME_Disabled (0x0UL) /*!< ETM is not in integration mode. */
#define ETM_TRCITCTRL_IME_Enabled (0x1UL) /*!< ETM is in integration mode. */

/* Register: ETM_TRCCLAIMSET */
/* Description: Sets bits in the claim tag and determines the number of claim tag bits implemented. */

/* Bit 3 : Claim tag set register */
#define ETM_TRCCLAIMSET_SET_3_Pos (3UL) /*!< Position of SET_3 field. */
#define ETM_TRCCLAIMSET_SET_3_Msk (0x1UL << ETM_TRCCLAIMSET_SET_3_Pos) /*!< Bit mask of SET_3 field. */
#define ETM_TRCCLAIMSET_SET_3_NotSet (0x0UL) /*!< Claim tag 3 is not set. */
#define ETM_TRCCLAIMSET_SET_3_Set (0x1UL) /*!< Claim tag 3 is set. */
#define ETM_TRCCLAIMSET_SET_3_Claim (0x1UL) /*!< Set claim tag 3. */

/* Bit 2 : Claim tag set register */
#define ETM_TRCCLAIMSET_SET_2_Pos (2UL) /*!< Position of SET_2 field. */
#define ETM_TRCCLAIMSET_SET_2_Msk (0x1UL << ETM_TRCCLAIMSET_SET_2_Pos) /*!< Bit mask of SET_2 field. */
#define ETM_TRCCLAIMSET_SET_2_NotSet (0x0UL) /*!< Claim tag 2 is not set. */
#define ETM_TRCCLAIMSET_SET_2_Set (0x1UL) /*!< Claim tag 2 is set. */
#define ETM_TRCCLAIMSET_SET_2_Claim (0x1UL) /*!< Set claim tag 2. */

/* Bit 1 : Claim tag set register */
#define ETM_TRCCLAIMSET_SET_1_Pos (1UL) /*!< Position of SET_1 field. */
#define ETM_TRCCLAIMSET_SET_1_Msk (0x1UL << ETM_TRCCLAIMSET_SET_1_Pos) /*!< Bit mask of SET_1 field. */
#define ETM_TRCCLAIMSET_SET_1_NotSet (0x0UL) /*!< Claim tag 1 is not set. */
#define ETM_TRCCLAIMSET_SET_1_Set (0x1UL) /*!< Claim tag 1 is set. */
#define ETM_TRCCLAIMSET_SET_1_Claim (0x1UL) /*!< Set claim tag 1. */

/* Bit 0 : Claim tag set register */
#define ETM_TRCCLAIMSET_SET_0_Pos (0UL) /*!< Position of SET_0 field. */
#define ETM_TRCCLAIMSET_SET_0_Msk (0x1UL << ETM_TRCCLAIMSET_SET_0_Pos) /*!< Bit mask of SET_0 field. */
#define ETM_TRCCLAIMSET_SET_0_NotSet (0x0UL) /*!< Claim tag 0 is not set. */
#define ETM_TRCCLAIMSET_SET_0_Set (0x1UL) /*!< Claim tag 0 is set. */
#define ETM_TRCCLAIMSET_SET_0_Claim (0x1UL) /*!< Set claim tag 0. */

