NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Register: ETM_TRCCLAIMCLR */
/* Description: Clears bits in the claim tag and determines the current value of the claim tag. */

/* Bit 3 : Claim tag clear register */
#define ETM_TRCCLAIMCLR_CLR_3_Pos (3UL) /*!< Position of CLR_3 field. */
#define ETM_TRCCLAIMCLR_CLR_3_Msk (0x1UL << ETM_TRCCLAIMCLR_CLR_3_Pos) /*!< Bit mask of CLR_3 field. */
#define ETM_TRCCLAIMCLR_CLR_3_NotSet (0x0UL) /*!< Claim tag 3 is not set. */
#define ETM_TRCCLAIMCLR_CLR_3_Set (0x1UL) /*!< Claim tag 3 is set. */
#define ETM_TRCCLAIMCLR_CLR_3_Clear (0x1UL) /*!< Clear claim tag 3. */

/* Bit 2 : Claim tag clear register */
#define ETM_TRCCLAIMCLR_CLR_2_Pos (2UL) /*!< Position of CLR_2 field. */
#define ETM_TRCCLAIMCLR_CLR_2_Msk (0x1UL << ETM_TRCCLAIMCLR_CLR_2_Pos) /*!< Bit mask of CLR_2 field. */
#define ETM_TRCCLAIMCLR_CLR_2_NotSet (0x0UL) /*!< Claim tag 2 is not set. */
#define ETM_TRCCLAIMCLR_CLR_2_Set (0x1UL) /*!< Claim tag 2 is set. */
#define ETM_TRCCLAIMCLR_CLR_2_Clear (0x1UL) /*!< Clear claim tag 2. */

/* Bit 1 : Claim tag clear register */
#define ETM_TRCCLAIMCLR_CLR_1_Pos (1UL) /*!< Position of CLR_1 field. */
#define ETM_TRCCLAIMCLR_CLR_1_Msk (0x1UL << ETM_TRCCLAIMCLR_CLR_1_Pos) /*!< Bit mask of CLR_1 field. */
#define ETM_TRCCLAIMCLR_CLR_1_NotSet (0x0UL) /*!< Claim tag 1 is not set. */
#define ETM_TRCCLAIMCLR_CLR_1_Set (0x1UL) /*!< Claim tag 1 is set. */
#define ETM_TRCCLAIMCLR_CLR_1_Clear (0x1UL) /*!< Clear claim tag 1. */

/* Bit 0 : Claim tag clear register */
#define ETM_TRCCLAIMCLR_CLR_0_Pos (0UL) /*!< Position of CLR_0 field. */
#define ETM_TRCCLAIMCLR_CLR_0_Msk (0x1UL << ETM_TRCCLAIMCLR_CLR_0_Pos) /*!< Bit mask of CLR_0 field. */
#define ETM_TRCCLAIMCLR_CLR_0_NotSet (0x0UL) /*!< Claim tag 0 is not set. */
#define ETM_TRCCLAIMCLR_CLR_0_Set (0x1UL) /*!< Claim tag 0 is set. */
#define ETM_TRCCLAIMCLR_CLR_0_Clear (0x1UL) /*!< Clear claim tag 0. */

/* Register: ETM_TRCAUTHSTATUS */
/* Description: Indicates the current level of tracing permitted by the system */

/* Bits 7..6 : Secure Non-Invasive Debug */
#define ETM_TRCAUTHSTATUS_SNID_Pos (6UL) /*!< Position of SNID field. */
#define ETM_TRCAUTHSTATUS_SNID_Msk (0x3UL << ETM_TRCAUTHSTATUS_SNID_Pos) /*!< Bit mask of SNID field. */
#define ETM_TRCAUTHSTATUS_SNID_NotImplemented (0x0UL) /*!< The feature is not implemented. */
#define ETM_TRCAUTHSTATUS_SNID_Implemented (0x1UL) /*!< The feature is implemented. */

/* Bits 5..4 : Secure Invasive Debug */
#define ETM_TRCAUTHSTATUS_SID_Pos (4UL) /*!< Position of SID field. */
#define ETM_TRCAUTHSTATUS_SID_Msk (0x3UL << ETM_TRCAUTHSTATUS_SID_Pos) /*!< Bit mask of SID field. */
#define ETM_TRCAUTHSTATUS_SID_NotImplemented (0x0UL) /*!< The feature is not implemented. */
#define ETM_TRCAUTHSTATUS_SID_Implemented (0x1UL) /*!< The feature is implemented. */

/* Bits 3..2 : Non-secure Non-Invasive Debug */
#define ETM_TRCAUTHSTATUS_NSNID_Pos (2UL) /*!< Position of NSNID field. */
#define ETM_TRCAUTHSTATUS_NSNID_Msk (0x3UL << ETM_TRCAUTHSTATUS_NSNID_Pos) /*!< Bit mask of NSNID field. */
#define ETM_TRCAUTHSTATUS_NSNID_NotImplemented (0x0UL) /*!< The feature is not implemented. */
#define ETM_TRCAUTHSTATUS_NSNID_Implemented (0x1UL) /*!< The feature is implemented. */

/* Bits 1..0 : Non-secure Invasive Debug */
#define ETM_TRCAUTHSTATUS_NSID_Pos (0UL) /*!< Position of NSID field. */
#define ETM_TRCAUTHSTATUS_NSID_Msk (0x3UL << ETM_TRCAUTHSTATUS_NSID_Pos) /*!< Bit mask of NSID field. */
#define ETM_TRCAUTHSTATUS_NSID_NotImplemented (0x0UL) /*!< The feature is not implemented. */
#define ETM_TRCAUTHSTATUS_NSID_Implemented (0x1UL) /*!< The feature is implemented. */

/* Register: ETM_TRCDEVARCH */
/* Description: The TRCDEVARCH identifies ETM-M33 as an ETMv4.2 component */

/* Bits 31..21 : Defines the architect of the component */
#define ETM_TRCDEVARCH_ARCHITECT_Pos (21UL) /*!< Position of ARCHITECT field. */
#define ETM_TRCDEVARCH_ARCHITECT_Msk (0x7FFUL << ETM_TRCDEVARCH_ARCHITECT_Pos) /*!< Bit mask of ARCHITECT field. */
#define ETM_TRCDEVARCH_ARCHITECT_Arm (0x23BUL) /*!< This peripheral was architected by Arm. */

/* Bit 20 : This register is implemented */
#define ETM_TRCDEVARCH_PRESENT_Pos (20UL) /*!< Position of PRESENT field. */
#define ETM_TRCDEVARCH_PRESENT_Msk (0x1UL << ETM_TRCDEVARCH_PRESENT_Pos) /*!< Bit mask of PRESENT field. */
#define ETM_TRCDEVARCH_PRESENT_Absent (0x0UL) /*!< The register is not implemented. */
#define ETM_TRCDEVARCH_PRESENT_Present (0x1UL) /*!< The register is implemented. */

/* Bits 19..16 : Architecture revision */
#define ETM_TRCDEVARCH_REVISION_Pos (16UL) /*!< Position of REVISION field. */
#define ETM_TRCDEVARCH_REVISION_Msk (0xFUL << ETM_TRCDEVARCH_REVISION_Pos) /*!< Bit mask of REVISION field. */
#define ETM_TRCDEVARCH_REVISION_v2 (0x2UL) /*!< Component is part of architecture 4.2 */

/* Bits 15..0 : Architecture ID */
#define ETM_TRCDEVARCH_ARCHID_Pos (0UL) /*!< Position of ARCHID field. */
#define ETM_TRCDEVARCH_ARCHID_Msk (0xFFFFUL << ETM_TRCDEVARCH_ARCHID_Pos) /*!< Bit mask of ARCHID field. */
#define ETM_TRCDEVARCH_ARCHID_ETMv42 (0x4A13UL) /*!< Component is an ETMv4 component */

/* Register: ETM_TRCDEVTYPE */
/* Description: Controls the single-shot comparator. */

/* Bits 7..4 : The sub-type of the component */
#define ETM_TRCDEVTYPE_SUB_Pos (4UL) /*!< Position of SUB field. */
#define ETM_TRCDEVTYPE_SUB_Msk (0xFUL << ETM_TRCDEVTYPE_SUB_Pos) /*!< Bit mask of SUB field. */
#define ETM_TRCDEVTYPE_SUB_ProcessorTrace (0x1UL) /*!< Peripheral is a processor trace source. */

/* Bits 3..0 : The main type of the component */
#define ETM_TRCDEVTYPE_MAJOR_Pos (0UL) /*!< Position of MAJOR field. */
#define ETM_TRCDEVTYPE_MAJOR_Msk (0xFUL << ETM_TRCDEVTYPE_MAJOR_Pos) /*!< Bit mask of MAJOR field. */
#define ETM_TRCDEVTYPE_MAJOR_TraceSource (0x3UL) /*!< Peripheral is a trace source. */


/* Peripheral: FICR */
/* Description: Factory Information Configuration Registers */

/* Register: FICR_INFO_DEVICEID */
/* Description: Description collection: Device identifier */

/* Bits 31..0 : 64 bit unique device identifier */
#define FICR_INFO_DEVICEID_DEVICEID_Pos (0UL) /*!< Position of DEVICEID field. */
#define FICR_INFO_DEVICEID_DEVICEID_Msk (0xFFFFFFFFUL << FICR_INFO_DEVICEID_DEVICEID_Pos) /*!< Bit mask of DEVICEID field. */

/* Register: FICR_INFO_PART */
/* Description: Part code */

/* Bits 31..0 : Part code */
#define FICR_INFO_PART_PART_Pos (0UL) /*!< Position of PART field. */
#define FICR_INFO_PART_PART_Msk (0xFFFFFFFFUL << FICR_INFO_PART_PART_Pos) /*!< Bit mask of PART field. */
#define FICR_INFO_PART_PART_N9120 (0x00009120UL) /*!< nRF9120 */
#define FICR_INFO_PART_PART_N9131 (0x00009131UL) /*!< nRF9131 */
#define FICR_INFO_PART_PART_N9151 (0x00009151UL) /*!< nRF9151 */
#define FICR_INFO_PART_PART_N9160 (0x00009160UL) /*!< nRF9160 */
#define FICR_INFO_PART_PART_N9161 (0x00009161UL) /*!< nRF9161 */

