NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 3 : Indicates whether multiplying the trigger counter by 2^(3+1) is supported. */
#define TPIU_SUPPORTEDTRIGGERMODES_MULT_3_Pos (3UL) /*!< Position of MULT_3 field. */
#define TPIU_SUPPORTEDTRIGGERMODES_MULT_3_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_MULT_3_Pos) /*!< Bit mask of MULT_3 field. */
#define TPIU_SUPPORTEDTRIGGERMODES_MULT_3_NotSelected (0x0UL) /*!< Multiplying the trigger counter by 2^(3+1) is supported. */
#define TPIU_SUPPORTEDTRIGGERMODES_MULT_3_Selected (0x1UL) /*!< Multiplying the trigger counter by 2^(3+1) is supported. */

/* Bit 2 : Indicates whether multiplying the trigger counter by 2^(2+1) is supported. */
#define TPIU_SUPPORTEDTRIGGERMODES_MULT_2_Pos (2UL) /*!< Position of MULT_2 field. */
#define TPIU_SUPPORTEDTRIGGERMODES_MULT_2_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_MULT_2_Pos) /*!< Bit mask of MULT_2 field. */
#define TPIU_SUPPORTEDTRIGGERMODES_MULT_2_NotSelected (0x0UL) /*!< Multiplying the trigger counter by 2^(2+1) is supported. */
#define TPIU_SUPPORTEDTRIGGERMODES_MULT_2_Selected (0x1UL) /*!< Multiplying the trigger counter by 2^(2+1) is supported. */

/* Bit 1 : Indicates whether multiplying the trigger counter by 2^(1+1) is supported. */
#define TPIU_SUPPORTEDTRIGGERMODES_MULT_1_Pos (1UL) /*!< Position of MULT_1 field. */
#define TPIU_SUPPORTEDTRIGGERMODES_MULT_1_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_MULT_1_Pos) /*!< Bit mask of MULT_1 field. */
#define TPIU_SUPPORTEDTRIGGERMODES_MULT_1_NotSelected (0x0UL) /*!< Multiplying the trigger counter by 2^(1+1) is supported. */
#define TPIU_SUPPORTEDTRIGGERMODES_MULT_1_Selected (0x1UL) /*!< Multiplying the trigger counter by 2^(1+1) is supported. */

/* Bit 0 : Indicates whether multiplying the trigger counter by 2^(0+1) is supported. */
#define TPIU_SUPPORTEDTRIGGERMODES_MULT_0_Pos (0UL) /*!< Position of MULT_0 field. */
#define TPIU_SUPPORTEDTRIGGERMODES_MULT_0_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_MULT_0_Pos) /*!< Bit mask of MULT_0 field. */
#define TPIU_SUPPORTEDTRIGGERMODES_MULT_0_NotSelected (0x0UL) /*!< Multiplying the trigger counter by 2^(0+1) is supported. */
#define TPIU_SUPPORTEDTRIGGERMODES_MULT_0_Selected (0x1UL) /*!< Multiplying the trigger counter by 2^(0+1) is supported. */

/* Register: TPIU_TRIGGERCOUNTERVALUE */
/* Description: The Trigger_counter_value register enables delaying the indication of triggers to any external connected trace capture or storage devices. */

/* Bits 7..0 : 8-bit counter value for the number of words to be output from the formatter before a trigger is inserted. */
#define TPIU_TRIGGERCOUNTERVALUE_TrigCount_Pos (0UL) /*!< Position of TrigCount field. */
#define TPIU_TRIGGERCOUNTERVALUE_TrigCount_Msk (0xFFUL << TPIU_TRIGGERCOUNTERVALUE_TrigCount_Pos) /*!< Bit mask of TrigCount field. */

/* Register: TPIU_TRIGGERMULTIPLIER */
/* Description: The Trigger_multiplier register contains the selectors for the trigger counter multiplier. */

/* Bit 4 : Multiply the Trigger Counter by 2^n. */
#define TPIU_TRIGGERMULTIPLIER_MULT_4_Pos (4UL) /*!< Position of MULT_4 field. */
#define TPIU_TRIGGERMULTIPLIER_MULT_4_Msk (0x1UL << TPIU_TRIGGERMULTIPLIER_MULT_4_Pos) /*!< Bit mask of MULT_4 field. */
#define TPIU_TRIGGERMULTIPLIER_MULT_4_Disabled (0x0UL) /*!< Multiplier disabled. */
#define TPIU_TRIGGERMULTIPLIER_MULT_4_Enabled (0x1UL) /*!< Multiplier enabled. */

/* Bit 3 : Multiply the Trigger Counter by 2^n. */
#define TPIU_TRIGGERMULTIPLIER_MULT_3_Pos (3UL) /*!< Position of MULT_3 field. */
#define TPIU_TRIGGERMULTIPLIER_MULT_3_Msk (0x1UL << TPIU_TRIGGERMULTIPLIER_MULT_3_Pos) /*!< Bit mask of MULT_3 field. */
#define TPIU_TRIGGERMULTIPLIER_MULT_3_Disabled (0x0UL) /*!< Multiplier disabled. */
#define TPIU_TRIGGERMULTIPLIER_MULT_3_Enabled (0x1UL) /*!< Multiplier enabled. */

/* Bit 2 : Multiply the Trigger Counter by 2^n. */
#define TPIU_TRIGGERMULTIPLIER_MULT_2_Pos (2UL) /*!< Position of MULT_2 field. */
#define TPIU_TRIGGERMULTIPLIER_MULT_2_Msk (0x1UL << TPIU_TRIGGERMULTIPLIER_MULT_2_Pos) /*!< Bit mask of MULT_2 field. */
#define TPIU_TRIGGERMULTIPLIER_MULT_2_Disabled (0x0UL) /*!< Multiplier disabled. */
#define TPIU_TRIGGERMULTIPLIER_MULT_2_Enabled (0x1UL) /*!< Multiplier enabled. */

/* Bit 1 : Multiply the Trigger Counter by 2^n. */
#define TPIU_TRIGGERMULTIPLIER_MULT_1_Pos (1UL) /*!< Position of MULT_1 field. */
#define TPIU_TRIGGERMULTIPLIER_MULT_1_Msk (0x1UL << TPIU_TRIGGERMULTIPLIER_MULT_1_Pos) /*!< Bit mask of MULT_1 field. */
#define TPIU_TRIGGERMULTIPLIER_MULT_1_Disabled (0x0UL) /*!< Multiplier disabled. */
#define TPIU_TRIGGERMULTIPLIER_MULT_1_Enabled (0x1UL) /*!< Multiplier enabled. */

/* Bit 0 : Multiply the Trigger Counter by 2^n. */
#define TPIU_TRIGGERMULTIPLIER_MULT_0_Pos (0UL) /*!< Position of MULT_0 field. */
#define TPIU_TRIGGERMULTIPLIER_MULT_0_Msk (0x1UL << TPIU_TRIGGERMULTIPLIER_MULT_0_Pos) /*!< Bit mask of MULT_0 field. */
#define TPIU_TRIGGERMULTIPLIER_MULT_0_Disabled (0x0UL) /*!< Multiplier disabled. */
#define TPIU_TRIGGERMULTIPLIER_MULT_0_Enabled (0x1UL) /*!< Multiplier enabled. */

/* Register: TPIU_SUPPPORTEDTESTPATTERNMODES */
/* Description: The Supported_test_pattern_modes register provides a set of known bit sequences or patterns that can be output over the trace port and can be detected by the TPA or other associated trace capture device. */

/* Bit 17 : Indicates whether continuous mode is supported. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PCONTEN_Pos (17UL) /*!< Position of PCONTEN field. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PCONTEN_Msk (0x1UL << TPIU_SUPPPORTEDTESTPATTERNMODES_PCONTEN_Pos) /*!< Bit mask of PCONTEN field. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PCONTEN_NotSupported (0x0UL) /*!< Mode is not supported. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PCONTEN_Supported (0x1UL) /*!< Mode is supported. */

/* Bit 16 : Indicates whether timed mode is supported. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PTIMEEN_Pos (16UL) /*!< Position of PTIMEEN field. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PTIMEEN_Msk (0x1UL << TPIU_SUPPPORTEDTESTPATTERNMODES_PTIMEEN_Pos) /*!< Bit mask of PTIMEEN field. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PTIMEEN_NotSupported (0x0UL) /*!< Mode is not supported. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PTIMEEN_Supported (0x1UL) /*!< Mode is supported. */

/* Bit 3 : Indicates whether the FF/00 pattern is supported as output over the trace port. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PATF0_Pos (3UL) /*!< Position of PATF0 field. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PATF0_Msk (0x1UL << TPIU_SUPPPORTEDTESTPATTERNMODES_PATF0_Pos) /*!< Bit mask of PATF0 field. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PATF0_NotSupported (0x0UL) /*!< Test pattern is not supported. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PATF0_Supported (0x1UL) /*!< Test pattern is supported. */

/* Bit 2 : Indicates whether the AA/55 pattern is supported as output over the trace port. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PATA5_Pos (2UL) /*!< Position of PATA5 field. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PATA5_Msk (0x1UL << TPIU_SUPPPORTEDTESTPATTERNMODES_PATA5_Pos) /*!< Bit mask of PATA5 field. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PATA5_NotSupported (0x0UL) /*!< Test pattern is not supported. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PATA5_Supported (0x1UL) /*!< Test pattern is supported. */

