NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 1 : Indicates whether the walking 0s pattern is supported as output over the trace port. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW0_Pos (1UL) /*!< Position of PATW0 field. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW0_Msk (0x1UL << TPIU_SUPPPORTEDTESTPATTERNMODES_PATW0_Pos) /*!< Bit mask of PATW0 field. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW0_NotSupported (0x0UL) /*!< Test pattern is not supported. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW0_Supported (0x1UL) /*!< Test pattern is supported. */

/* Bit 0 : Indicates whether the walking 1s pattern is supported as output over the trace port. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW1_Pos (0UL) /*!< Position of PATW1 field. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW1_Msk (0x1UL << TPIU_SUPPPORTEDTESTPATTERNMODES_PATW1_Pos) /*!< Bit mask of PATW1 field. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW1_NotSupported (0x0UL) /*!< Test pattern is not supported. */
#define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW1_Supported (0x1UL) /*!< Test pattern is supported. */

/* Register: TPIU_CURRENTTESTPATTERNMODES */
/* Description: Current_test_pattern_mode indicates the current test pattern or mode selected. */

/* Bit 17 : Indicates whether continuous mode is supported. */
#define TPIU_CURRENTTESTPATTERNMODES_PCONTEN_Pos (17UL) /*!< Position of PCONTEN field. */
#define TPIU_CURRENTTESTPATTERNMODES_PCONTEN_Msk (0x1UL << TPIU_CURRENTTESTPATTERNMODES_PCONTEN_Pos) /*!< Bit mask of PCONTEN field. */
#define TPIU_CURRENTTESTPATTERNMODES_PCONTEN_Disabled (0x0UL) /*!< Mode is disabled. */
#define TPIU_CURRENTTESTPATTERNMODES_PCONTEN_Enabled (0x1UL) /*!< Mode is enabled. */

/* Bit 16 : Indicates whether timed mode is supported. */
#define TPIU_CURRENTTESTPATTERNMODES_PTIMEEN_Pos (16UL) /*!< Position of PTIMEEN field. */
#define TPIU_CURRENTTESTPATTERNMODES_PTIMEEN_Msk (0x1UL << TPIU_CURRENTTESTPATTERNMODES_PTIMEEN_Pos) /*!< Bit mask of PTIMEEN field. */
#define TPIU_CURRENTTESTPATTERNMODES_PTIMEEN_Disabled (0x0UL) /*!< Mode is disabled. */
#define TPIU_CURRENTTESTPATTERNMODES_PTIMEEN_Enabled (0x1UL) /*!< Mode is enabled. */

/* Bit 3 : Indicates whether the FF/00 pattern is supported as output over the trace port. */
#define TPIU_CURRENTTESTPATTERNMODES_PATF0_Pos (3UL) /*!< Position of PATF0 field. */
#define TPIU_CURRENTTESTPATTERNMODES_PATF0_Msk (0x1UL << TPIU_CURRENTTESTPATTERNMODES_PATF0_Pos) /*!< Bit mask of PATF0 field. */
#define TPIU_CURRENTTESTPATTERNMODES_PATF0_Disabled (0x0UL) /*!< Test pattern is disabled. */
#define TPIU_CURRENTTESTPATTERNMODES_PATF0_Enabled (0x1UL) /*!< Test pattern is enabled. */

/* Bit 2 : Indicates whether the AA/55 pattern is supported as output over the trace port. */
#define TPIU_CURRENTTESTPATTERNMODES_PATA5_Pos (2UL) /*!< Position of PATA5 field. */
#define TPIU_CURRENTTESTPATTERNMODES_PATA5_Msk (0x1UL << TPIU_CURRENTTESTPATTERNMODES_PATA5_Pos) /*!< Bit mask of PATA5 field. */
#define TPIU_CURRENTTESTPATTERNMODES_PATA5_Disabled (0x0UL) /*!< Test pattern is disabled. */
#define TPIU_CURRENTTESTPATTERNMODES_PATA5_Enabled (0x1UL) /*!< Test pattern is enabled. */

/* Bit 1 : Indicates whether the walking 0s pattern is supported as output over the trace port. */
#define TPIU_CURRENTTESTPATTERNMODES_PATW0_Pos (1UL) /*!< Position of PATW0 field. */
#define TPIU_CURRENTTESTPATTERNMODES_PATW0_Msk (0x1UL << TPIU_CURRENTTESTPATTERNMODES_PATW0_Pos) /*!< Bit mask of PATW0 field. */
#define TPIU_CURRENTTESTPATTERNMODES_PATW0_Disabled (0x0UL) /*!< Test pattern is disabled. */
#define TPIU_CURRENTTESTPATTERNMODES_PATW0_Enabled (0x1UL) /*!< Test pattern is enabled. */

/* Bit 0 : Indicates whether the walking 1s pattern is supported as output over the trace port. */
#define TPIU_CURRENTTESTPATTERNMODES_PATW1_Pos (0UL) /*!< Position of PATW1 field. */
#define TPIU_CURRENTTESTPATTERNMODES_PATW1_Msk (0x1UL << TPIU_CURRENTTESTPATTERNMODES_PATW1_Pos) /*!< Bit mask of PATW1 field. */
#define TPIU_CURRENTTESTPATTERNMODES_PATW1_Disabled (0x0UL) /*!< Test pattern is disabled. */
#define TPIU_CURRENTTESTPATTERNMODES_PATW1_Enabled (0x1UL) /*!< Test pattern is enabled. */

/* Register: TPIU_TPRCR */
/* Description: The TPRCR register is an 8-bit counter start value that is decremented. A write sets the initial counter value and a read returns the programmed value. */

/* Bits 7..0 : 8-bit counter value to indicate the number of traceclkin cycles for which a pattern runs before it switches to the next pattern. */
#define TPIU_TPRCR_PATTCOUNT_Pos (0UL) /*!< Position of PATTCOUNT field. */
#define TPIU_TPRCR_PATTCOUNT_Msk (0xFFUL << TPIU_TPRCR_PATTCOUNT_Pos) /*!< Bit mask of PATTCOUNT field. */

/* Register: TPIU_FFSR */
/* Description: The FFSR register indicates the current status of the formatter and flush features available in the TPIU. */

/* Bit 2 : Indicates whether the TRACECTL pin is available for use. */
#define TPIU_FFSR_TCPRESENT_Pos (2UL) /*!< Position of TCPRESENT field. */
#define TPIU_FFSR_TCPRESENT_Msk (0x1UL << TPIU_FFSR_TCPRESENT_Pos) /*!< Bit mask of TCPRESENT field. */
#define TPIU_FFSR_TCPRESENT_NotPresent (0x0UL) /*!< TRACECTL pin is not present. */
#define TPIU_FFSR_TCPRESENT_Present (0x1UL) /*!< TRACECTL pin is present. */

/* Bit 1 : The formatter has received a stop request signal and all trace data and post-amble is sent. Any additional trace data on the ATB interface is ignored and atreadys goes HIGH. */
#define TPIU_FFSR_FTSTOPPED_Pos (1UL) /*!< Position of FTSTOPPED field. */
#define TPIU_FFSR_FTSTOPPED_Msk (0x1UL << TPIU_FFSR_FTSTOPPED_Pos) /*!< Bit mask of FTSTOPPED field. */
#define TPIU_FFSR_FTSTOPPED_Running (0x0UL) /*!< Formatter has not stopped. */
#define TPIU_FFSR_FTSTOPPED_Stopped (0x1UL) /*!< Formatter has stopped. */

/* Bit 0 : Flush in progress. */
#define TPIU_FFSR_FLINPROG_Pos (0UL) /*!< Position of FLINPROG field. */
#define TPIU_FFSR_FLINPROG_Msk (0x1UL << TPIU_FFSR_FLINPROG_Pos) /*!< Bit mask of FLINPROG field. */
#define TPIU_FFSR_FLINPROG_NotInProgress (0x0UL) /*!< A flush is not in progress. */
#define TPIU_FFSR_FLINPROG_InProgress (0x1UL) /*!< A flush is in progress. */

/* Register: TPIU_FFCR */
/* Description: The FFCR register controls the generation of stop, trigger, and flush events. */

