NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 13 : Stops the formatter after a trigger event is observed. Reset to disabled or 0. */
#define TPIU_FFCR_STOPTRIG_Pos (13UL) /*!< Position of STOPTRIG field. */
#define TPIU_FFCR_STOPTRIG_Msk (0x1UL << TPIU_FFCR_STOPTRIG_Pos) /*!< Bit mask of STOPTRIG field. */
#define TPIU_FFCR_STOPTRIG_Disabled (0x0UL) /*!< The formatting feature is disabled. */
#define TPIU_FFCR_STOPTRIG_Enabled (0x1UL) /*!< The formatting feature is enabled. */

/* Bit 12 : Forces the FIFO to drain off any part-completed packets. */
#define TPIU_FFCR_STOPFL_Pos (12UL) /*!< Position of STOPFL field. */
#define TPIU_FFCR_STOPFL_Msk (0x1UL << TPIU_FFCR_STOPFL_Pos) /*!< Bit mask of STOPFL field. */
#define TPIU_FFCR_STOPFL_Disabled (0x0UL) /*!< The formatting feature is disabled. */
#define TPIU_FFCR_STOPFL_Enabled (0x1UL) /*!< The formatting feature is enabled. */

/* Bit 10 : Indicates a trigger when flush completion on afreadys is returned. */
#define TPIU_FFCR_TRIGFL_Pos (10UL) /*!< Position of TRIGFL field. */
#define TPIU_FFCR_TRIGFL_Msk (0x1UL << TPIU_FFCR_TRIGFL_Pos) /*!< Bit mask of TRIGFL field. */
#define TPIU_FFCR_TRIGFL_Disabled (0x0UL) /*!< The formatting feature is disabled. */
#define TPIU_FFCR_TRIGFL_Enabled (0x1UL) /*!< The formatting feature is enabled. */

/* Bit 9 : Indicates a trigger on a trigger event. */
#define TPIU_FFCR_TRIGEVT_Pos (9UL) /*!< Position of TRIGEVT field. */
#define TPIU_FFCR_TRIGEVT_Msk (0x1UL << TPIU_FFCR_TRIGEVT_Pos) /*!< Bit mask of TRIGEVT field. */
#define TPIU_FFCR_TRIGEVT_Disabled (0x0UL) /*!< The formatting feature is disabled. */
#define TPIU_FFCR_TRIGEVT_Enabled (0x1UL) /*!< The formatting feature is enabled. */

/* Bit 8 : Indicates a trigger when trigin is asserted. */
#define TPIU_FFCR_TRIGIN_Pos (8UL) /*!< Position of TRIGIN field. */
#define TPIU_FFCR_TRIGIN_Msk (0x1UL << TPIU_FFCR_TRIGIN_Pos) /*!< Bit mask of TRIGIN field. */
#define TPIU_FFCR_TRIGIN_Disabled (0x0UL) /*!< The formatting feature is disabled. */
#define TPIU_FFCR_TRIGIN_Enabled (0x1UL) /*!< The formatting feature is enabled. */

/* Bit 7 : Generates a flush. This bit is set to 1 when this flush is serviced. */
#define TPIU_FFCR_FONMANW_Pos (7UL) /*!< Position of FONMANW field. */
#define TPIU_FFCR_FONMANW_Msk (0x1UL << TPIU_FFCR_FONMANW_Pos) /*!< Bit mask of FONMANW field. */
#define TPIU_FFCR_FONMANW_Disabled (0x0UL) /*!< The formatting feature is disabled. */
#define TPIU_FFCR_FONMANW_Enabled (0x1UL) /*!< The formatting feature is enabled. */

/* Bit 6 : Generates a flush. This bit is set to 0 when this flush is serviced. */
#define TPIU_FFCR_FONMANR_Pos (6UL) /*!< Position of FONMANR field. */
#define TPIU_FFCR_FONMANR_Msk (0x1UL << TPIU_FFCR_FONMANR_Pos) /*!< Bit mask of FONMANR field. */
#define TPIU_FFCR_FONMANR_Disabled (0x0UL) /*!< The formatting feature is disabled. */
#define TPIU_FFCR_FONMANR_Enabled (0x1UL) /*!< The formatting feature is enabled. */

/* Bit 5 : Initiates a manual flush of data in the system when a trigger event occurs. */
#define TPIU_FFCR_FONTRIG_Pos (5UL) /*!< Position of FONTRIG field. */
#define TPIU_FFCR_FONTRIG_Msk (0x1UL << TPIU_FFCR_FONTRIG_Pos) /*!< Bit mask of FONTRIG field. */
#define TPIU_FFCR_FONTRIG_Disabled (0x0UL) /*!< The formatting feature is disabled. */
#define TPIU_FFCR_FONTRIG_Enabled (0x1UL) /*!< The formatting feature is enabled. */

/* Bit 4 : Enables the use of the flushin connection. */
#define TPIU_FFCR_FONFLIN_Pos (4UL) /*!< Position of FONFLIN field. */
#define TPIU_FFCR_FONFLIN_Msk (0x1UL << TPIU_FFCR_FONFLIN_Pos) /*!< Bit mask of FONFLIN field. */
#define TPIU_FFCR_FONFLIN_Disabled (0x0UL) /*!< The formatting feature is disabled. */
#define TPIU_FFCR_FONFLIN_Enabled (0x1UL) /*!< The formatting feature is enabled. */

/* Bit 1 : Is embedded in trigger packets and indicates that no cycle is using sync packets. */
#define TPIU_FFCR_ENFCONT_Pos (1UL) /*!< Position of ENFCONT field. */
#define TPIU_FFCR_ENFCONT_Msk (0x1UL << TPIU_FFCR_ENFCONT_Pos) /*!< Bit mask of ENFCONT field. */
#define TPIU_FFCR_ENFCONT_Disabled (0x0UL) /*!< The formatting feature is disabled. */
#define TPIU_FFCR_ENFCONT_Enabled (0x1UL) /*!< The formatting feature is enabled. */

/* Bit 0 : Do not embed triggers into the formatted stream. Trace disable cycles and triggers are indicated by tracectl, where present. */
#define TPIU_FFCR_ENFTC_Pos (0UL) /*!< Position of ENFTC field. */
#define TPIU_FFCR_ENFTC_Msk (0x1UL << TPIU_FFCR_ENFTC_Pos) /*!< Bit mask of ENFTC field. */
#define TPIU_FFCR_ENFTC_Disabled (0x0UL) /*!< The formatting feature is disabled. */
#define TPIU_FFCR_ENFTC_Enabled (0x1UL) /*!< The formatting feature is enabled. */

/* Register: TPIU_FSCR */
/* Description: The FSCR register enables the frequency of synchronization information to be optimized to suit the Trace Port Analyzer (TPA) capture buffer size. */

/* Bits 11..0 : 12-bit counter reload value. Indicates the number of complete frames between full synchronization packets. */
#define TPIU_FSCR_CYCCOUNT_Pos (0UL) /*!< Position of CYCCOUNT field. */
#define TPIU_FSCR_CYCCOUNT_Msk (0xFFFUL << TPIU_FSCR_CYCCOUNT_Pos) /*!< Bit mask of CYCCOUNT field. */

/* Register: TPIU_EXTCTLINPORT */
/* Description: Two ports can be used as a control and feedback mechanism for any serializers, pin sharing multiplexers, or other solutions that might be added to the trace output pins either for pin control or a high-speed trace port solution. */

/* Bit 7 : EXTCTL inputs. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_7_Pos (7UL) /*!< Position of EXTCTLIN_7 field. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_7_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN_7_Pos) /*!< Bit mask of EXTCTLIN_7 field. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_7_Low (0x0UL) /*!< Input EXTCTL7 is low. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_7_High (0x1UL) /*!< Input EXTCTL7 is high. */

/* Bit 6 : EXTCTL inputs. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_6_Pos (6UL) /*!< Position of EXTCTLIN_6 field. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_6_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN_6_Pos) /*!< Bit mask of EXTCTLIN_6 field. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_6_Low (0x0UL) /*!< Input EXTCTL6 is low. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_6_High (0x1UL) /*!< Input EXTCTL6 is high. */

/* Bit 5 : EXTCTL inputs. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_5_Pos (5UL) /*!< Position of EXTCTLIN_5 field. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_5_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN_5_Pos) /*!< Bit mask of EXTCTLIN_5 field. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_5_Low (0x0UL) /*!< Input EXTCTL5 is low. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_5_High (0x1UL) /*!< Input EXTCTL5 is high. */

