NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 4 : EXTCTL inputs. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_4_Pos (4UL) /*!< Position of EXTCTLIN_4 field. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_4_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN_4_Pos) /*!< Bit mask of EXTCTLIN_4 field. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_4_Low (0x0UL) /*!< Input EXTCTL4 is low. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_4_High (0x1UL) /*!< Input EXTCTL4 is high. */

/* Bit 3 : EXTCTL inputs. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_3_Pos (3UL) /*!< Position of EXTCTLIN_3 field. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_3_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN_3_Pos) /*!< Bit mask of EXTCTLIN_3 field. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_3_Low (0x0UL) /*!< Input EXTCTL3 is low. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_3_High (0x1UL) /*!< Input EXTCTL3 is high. */

/* Bit 2 : EXTCTL inputs. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_2_Pos (2UL) /*!< Position of EXTCTLIN_2 field. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_2_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN_2_Pos) /*!< Bit mask of EXTCTLIN_2 field. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_2_Low (0x0UL) /*!< Input EXTCTL2 is low. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_2_High (0x1UL) /*!< Input EXTCTL2 is high. */

/* Bit 1 : EXTCTL inputs. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_1_Pos (1UL) /*!< Position of EXTCTLIN_1 field. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_1_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN_1_Pos) /*!< Bit mask of EXTCTLIN_1 field. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_1_Low (0x0UL) /*!< Input EXTCTL1 is low. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_1_High (0x1UL) /*!< Input EXTCTL1 is high. */

/* Bit 0 : EXTCTL inputs. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_0_Pos (0UL) /*!< Position of EXTCTLIN_0 field. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_0_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN_0_Pos) /*!< Bit mask of EXTCTLIN_0 field. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_0_Low (0x0UL) /*!< Input EXTCTL0 is low. */
#define TPIU_EXTCTLINPORT_EXTCTLIN_0_High (0x1UL) /*!< Input EXTCTL0 is high. */

/* Register: TPIU_EXTCTLOUTPORT */
/* Description: Two ports can be used as a control and feedback mechanism for any serializers, pin sharing multiplexers, or other solutions that might be added to the trace output pins either for pin control or a high speed trace port solution. These ports are raw register banks that sample or export the corresponding external pins. */

/* Bit 7 : EXTCTL outputs. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_7_Pos (7UL) /*!< Position of EXTCTLOUT_7 field. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_7_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT_7_Pos) /*!< Bit mask of EXTCTLOUT_7 field. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_7_Low (0x0UL) /*!< Output EXTCTL7 is low. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_7_High (0x1UL) /*!< Output EXTCTL7 is high. */

/* Bit 6 : EXTCTL outputs. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_6_Pos (6UL) /*!< Position of EXTCTLOUT_6 field. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_6_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT_6_Pos) /*!< Bit mask of EXTCTLOUT_6 field. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_6_Low (0x0UL) /*!< Output EXTCTL6 is low. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_6_High (0x1UL) /*!< Output EXTCTL6 is high. */

/* Bit 5 : EXTCTL outputs. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_5_Pos (5UL) /*!< Position of EXTCTLOUT_5 field. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_5_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT_5_Pos) /*!< Bit mask of EXTCTLOUT_5 field. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_5_Low (0x0UL) /*!< Output EXTCTL5 is low. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_5_High (0x1UL) /*!< Output EXTCTL5 is high. */

/* Bit 4 : EXTCTL outputs. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_4_Pos (4UL) /*!< Position of EXTCTLOUT_4 field. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_4_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT_4_Pos) /*!< Bit mask of EXTCTLOUT_4 field. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_4_Low (0x0UL) /*!< Output EXTCTL4 is low. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_4_High (0x1UL) /*!< Output EXTCTL4 is high. */

/* Bit 3 : EXTCTL outputs. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_3_Pos (3UL) /*!< Position of EXTCTLOUT_3 field. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_3_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT_3_Pos) /*!< Bit mask of EXTCTLOUT_3 field. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_3_Low (0x0UL) /*!< Output EXTCTL3 is low. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_3_High (0x1UL) /*!< Output EXTCTL3 is high. */

/* Bit 2 : EXTCTL outputs. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_2_Pos (2UL) /*!< Position of EXTCTLOUT_2 field. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_2_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT_2_Pos) /*!< Bit mask of EXTCTLOUT_2 field. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_2_Low (0x0UL) /*!< Output EXTCTL2 is low. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_2_High (0x1UL) /*!< Output EXTCTL2 is high. */

/* Bit 1 : EXTCTL outputs. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_1_Pos (1UL) /*!< Position of EXTCTLOUT_1 field. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_1_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT_1_Pos) /*!< Bit mask of EXTCTLOUT_1 field. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_1_Low (0x0UL) /*!< Output EXTCTL1 is low. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_1_High (0x1UL) /*!< Output EXTCTL1 is high. */

/* Bit 0 : EXTCTL outputs. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_0_Pos (0UL) /*!< Position of EXTCTLOUT_0 field. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_0_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT_0_Pos) /*!< Bit mask of EXTCTLOUT_0 field. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_0_Low (0x0UL) /*!< Output EXTCTL0 is low. */
#define TPIU_EXTCTLOUTPORT_EXTCTLOUT_0_High (0x1UL) /*!< Output EXTCTL0 is high. */

/* Register: TPIU_ITTRFLINACK */
/* Description: The ITTRFLINACK register enables control of the triginack and flushinack outputs from the TPIU. */

/* Bit 1 : Sets the value of flushinack. */
#define TPIU_ITTRFLINACK_FLUSHINACK_Pos (1UL) /*!< Position of FLUSHINACK field. */
#define TPIU_ITTRFLINACK_FLUSHINACK_Msk (0x1UL << TPIU_ITTRFLINACK_FLUSHINACK_Pos) /*!< Bit mask of FLUSHINACK field. */
#define TPIU_ITTRFLINACK_FLUSHINACK_Low (0x0UL) /*!< Pin is logic 0. */
#define TPIU_ITTRFLINACK_FLUSHINACK_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 0 : Sets the value of triginack. */
#define TPIU_ITTRFLINACK_TRIGINACK_Pos (0UL) /*!< Position of TRIGINACK field. */
#define TPIU_ITTRFLINACK_TRIGINACK_Msk (0x1UL << TPIU_ITTRFLINACK_TRIGINACK_Pos) /*!< Bit mask of TRIGINACK field. */
#define TPIU_ITTRFLINACK_TRIGINACK_Low (0x0UL) /*!< Pin is logic 0. */
#define TPIU_ITTRFLINACK_TRIGINACK_High (0x1UL) /*!< Pin is logic 1. */

/* Register: TPIU_ITTRFLIN */
/* Description: The ITTRFLIN register contains the values of the flushin and trigin inputs to the TPIU. */

