NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Bit 1 : Reads  the value of flushin. */
#define TPIU_ITTRFLIN_FLUSHIN_Pos (1UL) /*!< Position of FLUSHIN field. */
#define TPIU_ITTRFLIN_FLUSHIN_Msk (0x1UL << TPIU_ITTRFLIN_FLUSHIN_Pos) /*!< Bit mask of FLUSHIN field. */
#define TPIU_ITTRFLIN_FLUSHIN_Low (0x0UL) /*!< Pin is logic 0. */
#define TPIU_ITTRFLIN_FLUSHIN_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 0 : Reads  the value of trigin. */
#define TPIU_ITTRFLIN_TRIGIN_Pos (0UL) /*!< Position of TRIGIN field. */
#define TPIU_ITTRFLIN_TRIGIN_Msk (0x1UL << TPIU_ITTRFLIN_TRIGIN_Pos) /*!< Bit mask of TRIGIN field. */
#define TPIU_ITTRFLIN_TRIGIN_Low (0x0UL) /*!< Pin is logic 0. */
#define TPIU_ITTRFLIN_TRIGIN_High (0x1UL) /*!< Pin is logic 1. */

/* Register: TPIU_ITATBDATA0 */
/* Description: The ITATBDATA0 register contains the value of the atdatas inputs to the TPIU. The values are valid only when atvalids is HIGH. */

/* Bit 4 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define TPIU_ITATBDATA0_ATDATA_4_Pos (4UL) /*!< Position of ATDATA_4 field. */
#define TPIU_ITATBDATA0_ATDATA_4_Msk (0x1UL << TPIU_ITATBDATA0_ATDATA_4_Pos) /*!< Bit mask of ATDATA_4 field. */
#define TPIU_ITATBDATA0_ATDATA_4_Low (0x0UL) /*!< Pin is logic 0. */
#define TPIU_ITATBDATA0_ATDATA_4_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 3 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define TPIU_ITATBDATA0_ATDATA_3_Pos (3UL) /*!< Position of ATDATA_3 field. */
#define TPIU_ITATBDATA0_ATDATA_3_Msk (0x1UL << TPIU_ITATBDATA0_ATDATA_3_Pos) /*!< Bit mask of ATDATA_3 field. */
#define TPIU_ITATBDATA0_ATDATA_3_Low (0x0UL) /*!< Pin is logic 0. */
#define TPIU_ITATBDATA0_ATDATA_3_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 2 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define TPIU_ITATBDATA0_ATDATA_2_Pos (2UL) /*!< Position of ATDATA_2 field. */
#define TPIU_ITATBDATA0_ATDATA_2_Msk (0x1UL << TPIU_ITATBDATA0_ATDATA_2_Pos) /*!< Bit mask of ATDATA_2 field. */
#define TPIU_ITATBDATA0_ATDATA_2_Low (0x0UL) /*!< Pin is logic 0. */
#define TPIU_ITATBDATA0_ATDATA_2_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 1 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define TPIU_ITATBDATA0_ATDATA_1_Pos (1UL) /*!< Position of ATDATA_1 field. */
#define TPIU_ITATBDATA0_ATDATA_1_Msk (0x1UL << TPIU_ITATBDATA0_ATDATA_1_Pos) /*!< Bit mask of ATDATA_1 field. */
#define TPIU_ITATBDATA0_ATDATA_1_Low (0x0UL) /*!< Pin is logic 0. */
#define TPIU_ITATBDATA0_ATDATA_1_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 0 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the corresponding atdatam pin of the enabled port. */
#define TPIU_ITATBDATA0_ATDATA_0_Pos (0UL) /*!< Position of ATDATA_0 field. */
#define TPIU_ITATBDATA0_ATDATA_0_Msk (0x1UL << TPIU_ITATBDATA0_ATDATA_0_Pos) /*!< Bit mask of ATDATA_0 field. */
#define TPIU_ITATBDATA0_ATDATA_0_Low (0x0UL) /*!< Pin is logic 0. */
#define TPIU_ITATBDATA0_ATDATA_0_High (0x1UL) /*!< Pin is logic 1. */

/* Register: TPIU_ITATBCTR2 */
/* Description: Enables control of the atreadys and afvalids outputs of the TPIU. */

/* Bit 1 : Sets the value of atready. */
#define TPIU_ITATBCTR2_AFVALID_Pos (1UL) /*!< Position of AFVALID field. */
#define TPIU_ITATBCTR2_AFVALID_Msk (0x1UL << TPIU_ITATBCTR2_AFVALID_Pos) /*!< Bit mask of AFVALID field. */
#define TPIU_ITATBCTR2_AFVALID_Low (0x0UL) /*!< Pin is logic 0. */
#define TPIU_ITATBCTR2_AFVALID_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 0 : Sets the value of afvalid. */
#define TPIU_ITATBCTR2_ATREADY_Pos (0UL) /*!< Position of ATREADY field. */
#define TPIU_ITATBCTR2_ATREADY_Msk (0x1UL << TPIU_ITATBCTR2_ATREADY_Pos) /*!< Bit mask of ATREADY field. */
#define TPIU_ITATBCTR2_ATREADY_Low (0x0UL) /*!< Pin is logic 0. */
#define TPIU_ITATBCTR2_ATREADY_High (0x1UL) /*!< Pin is logic 1. */

/* Register: TPIU_ITATBCTR1 */
/* Description: The ITATBCTR1 register contains the value of the atids input to the TPIU. This is only valid when atvalids is HIGH. */

/* Bits 6..0 : Reads the value of atids. */
#define TPIU_ITATBCTR1_ATID_Pos (0UL) /*!< Position of ATID field. */
#define TPIU_ITATBCTR1_ATID_Msk (0x7FUL << TPIU_ITATBCTR1_ATID_Pos) /*!< Bit mask of ATID field. */
#define TPIU_ITATBCTR1_ATID_Low (0x00UL) /*!< Pin is logic 0. */
#define TPIU_ITATBCTR1_ATID_High (0x01UL) /*!< Pin is logic 1. */

/* Register: TPIU_ITATBCTR0 */
/* Description: The ITATBCTR0 register captures the values of the atvalids, afreadys, and atbytess inputs to the TPIU. 
      To ensure the integration registers work correctly in a system, the value of atbytess is only valid when atvalids, bit[0], is HIGH. */

/* Bits 9..8 : Reads the value of atbytess. */
#define TPIU_ITATBCTR0_ATBYTES_Pos (8UL) /*!< Position of ATBYTES field. */
#define TPIU_ITATBCTR0_ATBYTES_Msk (0x3UL << TPIU_ITATBCTR0_ATBYTES_Pos) /*!< Bit mask of ATBYTES field. */
#define TPIU_ITATBCTR0_ATBYTES_Low (0x0UL) /*!< Pin is logic 0. */
#define TPIU_ITATBCTR0_ATBYTES_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 2 : Reads the value of afreadys. */
#define TPIU_ITATBCTR0_AFREADY_Pos (2UL) /*!< Position of AFREADY field. */
#define TPIU_ITATBCTR0_AFREADY_Msk (0x1UL << TPIU_ITATBCTR0_AFREADY_Pos) /*!< Bit mask of AFREADY field. */
#define TPIU_ITATBCTR0_AFREADY_Low (0x0UL) /*!< Pin is logic 0. */
#define TPIU_ITATBCTR0_AFREADY_High (0x1UL) /*!< Pin is logic 1. */

/* Bit 0 : Reads the value of atvalids. */
#define TPIU_ITATBCTR0_ATVALID_Pos (0UL) /*!< Position of ATVALID field. */
#define TPIU_ITATBCTR0_ATVALID_Msk (0x1UL << TPIU_ITATBCTR0_ATVALID_Pos) /*!< Bit mask of ATVALID field. */
#define TPIU_ITATBCTR0_ATVALID_Low (0x0UL) /*!< Pin is logic 0. */
#define TPIU_ITATBCTR0_ATVALID_High (0x1UL) /*!< Pin is logic 1. */

/* Register: TPIU_ITCTRL */
/* Description: Used to enable topology detection. 
        This register enables the component to switch from a functional mode, the default behavior, 
        to integration mode where the inputs and outputs of the component can be directly controlled for integration testing and topology solving. */

/* Bit 0 : Enables the component to switch from functional mode to integration mode and back. If no integration functionality is implemented, this register must read as zero. */
#define TPIU_ITCTRL_INTEGRATIONMODE_Pos (0UL) /*!< Position of INTEGRATIONMODE field. */
#define TPIU_ITCTRL_INTEGRATIONMODE_Msk (0x1UL << TPIU_ITCTRL_INTEGRATIONMODE_Pos) /*!< Bit mask of INTEGRATIONMODE field. */
#define TPIU_ITCTRL_INTEGRATIONMODE_Disabled (0x0UL) /*!< Integration mode is disabled. */
#define TPIU_ITCTRL_INTEGRATIONMODE_Enabled (0x1UL) /*!< Integration mode is Enabled. */

/* Register: TPIU_CLAIMSET */
/* Description: Software can use the claim tag to coordinate application and debugger access to trace unit functionality. 
      The claim tags have no effect on the operation of the component. The CLAIMSET register sets bits in the claim tag, and determines the number of claim bits implemented. */

/* Bit 3 : Set claim bit 3 and check if bit is implemented or not. */
#define TPIU_CLAIMSET_BIT_3_Pos (3UL) /*!< Position of BIT_3 field. */
#define TPIU_CLAIMSET_BIT_3_Msk (0x1UL << TPIU_CLAIMSET_BIT_3_Pos) /*!< Bit mask of BIT_3 field. */
#define TPIU_CLAIMSET_BIT_3_NotImplemented (0x0UL) /*!< Claim bit 3 is not implemented. */
#define TPIU_CLAIMSET_BIT_3_Implemented (0x1UL) /*!< Claim bit 3 is implemented. */
#define TPIU_CLAIMSET_BIT_3_Set (0x1UL) /*!< Set claim bit 3. */

/* Bit 2 : Set claim bit 2 and check if bit is implemented or not. */
#define TPIU_CLAIMSET_BIT_2_Pos (2UL) /*!< Position of BIT_2 field. */
#define TPIU_CLAIMSET_BIT_2_Msk (0x1UL << TPIU_CLAIMSET_BIT_2_Pos) /*!< Bit mask of BIT_2 field. */
#define TPIU_CLAIMSET_BIT_2_NotImplemented (0x0UL) /*!< Claim bit 2 is not implemented. */
#define TPIU_CLAIMSET_BIT_2_Implemented (0x1UL) /*!< Claim bit 2 is implemented. */
#define TPIU_CLAIMSET_BIT_2_Set (0x1UL) /*!< Set claim bit 2. */

/* Bit 1 : Set claim bit 1 and check if bit is implemented or not. */
#define TPIU_CLAIMSET_BIT_1_Pos (1UL) /*!< Position of BIT_1 field. */
#define TPIU_CLAIMSET_BIT_1_Msk (0x1UL << TPIU_CLAIMSET_BIT_1_Pos) /*!< Bit mask of BIT_1 field. */
#define TPIU_CLAIMSET_BIT_1_NotImplemented (0x0UL) /*!< Claim bit 1 is not implemented. */
#define TPIU_CLAIMSET_BIT_1_Implemented (0x1UL) /*!< Claim bit 1 is implemented. */
#define TPIU_CLAIMSET_BIT_1_Set (0x1UL) /*!< Set claim bit 1. */

