NordicSemiconductor/nrfx/bsp/stable/mdk/nrf91/nrf9120/nrf9120_bitfields.h
/* Register: TPIU_DEVID */
/* Description: Indicates the capabilities of the component. */

/* Bit 11 : Indicates whether Serial Wire Output, UART or NRZ, is supported. */
#define TPIU_DEVID_SWOUARTNRZ_Pos (11UL) /*!< Position of SWOUARTNRZ field. */
#define TPIU_DEVID_SWOUARTNRZ_Msk (0x1UL << TPIU_DEVID_SWOUARTNRZ_Pos) /*!< Bit mask of SWOUARTNRZ field. */
#define TPIU_DEVID_SWOUARTNRZ_NotSupported (0x0UL) /*!< Serial Wire Output, UART or NRZ, is not supported. */
#define TPIU_DEVID_SWOUARTNRZ_Supported (0x1UL) /*!< Serial Wire Output, UART or NRZ, is supported. */

/* Bit 10 : Indicates whether Serial Wire Output, Manchester encoded format, is supported. */
#define TPIU_DEVID_SWOMAN_Pos (10UL) /*!< Position of SWOMAN field. */
#define TPIU_DEVID_SWOMAN_Msk (0x1UL << TPIU_DEVID_SWOMAN_Pos) /*!< Bit mask of SWOMAN field. */
#define TPIU_DEVID_SWOMAN_NotSupported (0x0UL) /*!< Serial Wire Output, Manchester encoded format, is not supported. */
#define TPIU_DEVID_SWOMAN_Supported (0x1UL) /*!< Serial Wire Output, Manchester encoded format, is supported. */

/* Bit 9 : Indicates whether trace clock plus data is supported. */
#define TPIU_DEVID_TCLKDATA_Pos (9UL) /*!< Position of TCLKDATA field. */
#define TPIU_DEVID_TCLKDATA_Msk (0x1UL << TPIU_DEVID_TCLKDATA_Pos) /*!< Bit mask of TCLKDATA field. */
#define TPIU_DEVID_TCLKDATA_Supported (0x0UL) /*!< Trace clock and data is supported. */
#define TPIU_DEVID_TCLKDATA_NotSupported (0x1UL) /*!< Trace clock and data is not supported. */

/* Bits 8..6 : FIFO size in powers of 2. */
#define TPIU_DEVID_FIFOSIZE_Pos (6UL) /*!< Position of FIFOSIZE field. */
#define TPIU_DEVID_FIFOSIZE_Msk (0x7UL << TPIU_DEVID_FIFOSIZE_Pos) /*!< Bit mask of FIFOSIZE field. */
#define TPIU_DEVID_FIFOSIZE_Entries4 (0x2UL) /*!< FIFO size of 4 entries, that is, 16 bytes. */

/* Bit 5 : Indicates the relationship between atclk and traceclkin. */
#define TPIU_DEVID_CLKRELAT_Pos (5UL) /*!< Position of CLKRELAT field. */
#define TPIU_DEVID_CLKRELAT_Msk (0x1UL << TPIU_DEVID_CLKRELAT_Pos) /*!< Bit mask of CLKRELAT field. */
#define TPIU_DEVID_CLKRELAT_Synchronous (0x0UL) /*!< atclk and traceclkin are synchronous. */
#define TPIU_DEVID_CLKRELAT_ASynchronous (0x1UL) /*!< atclk and traceclkin are asynchronous. */

/* Bits 4..0 : Indicates the hidden level of input multiplexing. When non-zero, this value indicates the type of multiplexing on the input to the ATB. 
        Currently only 0x00 is supported, that is, no multiplexing is present. This value helps detect the ATB structure. */
#define TPIU_DEVID_MUXNUM_Pos (0UL) /*!< Position of MUXNUM field. */
#define TPIU_DEVID_MUXNUM_Msk (0x1FUL << TPIU_DEVID_MUXNUM_Pos) /*!< Bit mask of MUXNUM field. */

/* Register: TPIU_DEVTYPE */
/* Description: The DEVTYPE register provides a debugger with information about the component when the Part Number field is not recognized. The debugger can then report this information. */

/* Bits 7..4 : The sub-type of the component */
#define TPIU_DEVTYPE_SUB_Pos (4UL) /*!< Position of SUB field. */
#define TPIU_DEVTYPE_SUB_Msk (0xFUL << TPIU_DEVTYPE_SUB_Pos) /*!< Bit mask of SUB field. */
#define TPIU_DEVTYPE_SUB_TracePort (0x1UL) /*!< Indicates that this component is a trace port component. */

/* Bits 3..0 : The main type of the component */
#define TPIU_DEVTYPE_MAJOR_Pos (0UL) /*!< Position of MAJOR field. */
#define TPIU_DEVTYPE_MAJOR_Msk (0xFUL << TPIU_DEVTYPE_MAJOR_Pos) /*!< Bit mask of MAJOR field. */
#define TPIU_DEVTYPE_MAJOR_TraceSource (0x1UL) /*!< Peripheral is a trace sink. */


/* Peripheral: TWIM */
/* Description: I2C compatible Two-Wire Master Interface with EasyDMA 0 */

/* Register: TWIM_TASKS_STARTRX */
/* Description: Start TWI receive sequence */

/* Bit 0 : Start TWI receive sequence */
#define TWIM_TASKS_STARTRX_TASKS_STARTRX_Pos (0UL) /*!< Position of TASKS_STARTRX field. */
#define TWIM_TASKS_STARTRX_TASKS_STARTRX_Msk (0x1UL << TWIM_TASKS_STARTRX_TASKS_STARTRX_Pos) /*!< Bit mask of TASKS_STARTRX field. */
#define TWIM_TASKS_STARTRX_TASKS_STARTRX_Trigger (0x1UL) /*!< Trigger task */

/* Register: TWIM_TASKS_STARTTX */
/* Description: Start TWI transmit sequence */

/* Bit 0 : Start TWI transmit sequence */
#define TWIM_TASKS_STARTTX_TASKS_STARTTX_Pos (0UL) /*!< Position of TASKS_STARTTX field. */
#define TWIM_TASKS_STARTTX_TASKS_STARTTX_Msk (0x1UL << TWIM_TASKS_STARTTX_TASKS_STARTTX_Pos) /*!< Bit mask of TASKS_STARTTX field. */
#define TWIM_TASKS_STARTTX_TASKS_STARTTX_Trigger (0x1UL) /*!< Trigger task */

/* Register: TWIM_TASKS_STOP */
/* Description: Stop TWI transaction. Must be issued while the TWI master is not suspended. */

/* Bit 0 : Stop TWI transaction. Must be issued while the TWI master is not suspended. */
#define TWIM_TASKS_STOP_TASKS_STOP_Pos (0UL) /*!< Position of TASKS_STOP field. */
#define TWIM_TASKS_STOP_TASKS_STOP_Msk (0x1UL << TWIM_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field. */
#define TWIM_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task */

/* Register: TWIM_TASKS_SUSPEND */
/* Description: Suspend TWI transaction */

/* Bit 0 : Suspend TWI transaction */
#define TWIM_TASKS_SUSPEND_TASKS_SUSPEND_Pos (0UL) /*!< Position of TASKS_SUSPEND field. */
#define TWIM_TASKS_SUSPEND_TASKS_SUSPEND_Msk (0x1UL << TWIM_TASKS_SUSPEND_TASKS_SUSPEND_Pos) /*!< Bit mask of TASKS_SUSPEND field. */
#define TWIM_TASKS_SUSPEND_TASKS_SUSPEND_Trigger (0x1UL) /*!< Trigger task */

/* Register: TWIM_TASKS_RESUME */
/* Description: Resume TWI transaction */

/* Bit 0 : Resume TWI transaction */
#define TWIM_TASKS_RESUME_TASKS_RESUME_Pos (0UL) /*!< Position of TASKS_RESUME field. */
#define TWIM_TASKS_RESUME_TASKS_RESUME_Msk (0x1UL << TWIM_TASKS_RESUME_TASKS_RESUME_Pos) /*!< Bit mask of TASKS_RESUME field. */
#define TWIM_TASKS_RESUME_TASKS_RESUME_Trigger (0x1UL) /*!< Trigger task */

/* Register: TWIM_SUBSCRIBE_STARTRX */
/* Description: Subscribe configuration for task STARTRX */

/* Bit 31 :   */
#define TWIM_SUBSCRIBE_STARTRX_EN_Pos (31UL) /*!< Position of EN field. */
#define TWIM_SUBSCRIBE_STARTRX_EN_Msk (0x1UL << TWIM_SUBSCRIBE_STARTRX_EN_Pos) /*!< Bit mask of EN field. */
#define TWIM_SUBSCRIBE_STARTRX_EN_Disabled (0x0UL) /*!< Disable subscription */
#define TWIM_SUBSCRIBE_STARTRX_EN_Enabled (0x1UL) /*!< Enable subscription */

